wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
typedef struct {                                    /*!< (@ 0x50001500) I2C2 Structure                                         */
  __IO uint16_t  I2C2_CON_REG;                      /*!< (@ 0x50001500) I2C Control Register                                   */
  __I  uint16_t  RESERVED;
  __IO uint16_t  I2C2_TAR_REG;                      /*!< (@ 0x50001504) I2C Target Address Register                            */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  I2C2_SAR_REG;                      /*!< (@ 0x50001508) I2C Slave Address Register                             */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  I2C2_HS_MADDR_REG;                 /*!< (@ 0x5000150C) I2C High Speed Master Mode Code Address Register       */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  I2C2_DATA_CMD_REG;                 /*!< (@ 0x50001510) I2C Rx/Tx Data Buffer and Command Register             */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  I2C2_SS_SCL_HCNT_REG;              /*!< (@ 0x50001514) Standard Speed I2C Clock SCL High Count Register       */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  I2C2_SS_SCL_LCNT_REG;              /*!< (@ 0x50001518) Standard Speed I2C Clock SCL Low Count Register        */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  I2C2_FS_SCL_HCNT_REG;              /*!< (@ 0x5000151C) Fast Speed I2C Clock SCL High Count Register           */
  __I  uint16_t  RESERVED7;
  __IO uint16_t  I2C2_FS_SCL_LCNT_REG;              /*!< (@ 0x50001520) Fast Speed I2C Clock SCL Low Count Register            */
  __I  uint16_t  RESERVED8[5];
  __IO uint16_t  I2C2_INTR_STAT_REG;                /*!< (@ 0x5000152C) I2C Interrupt Status Register                          */
  __I  uint16_t  RESERVED9;
  __IO uint16_t  I2C2_INTR_MASK_REG;                /*!< (@ 0x50001530) I2C Interrupt Mask Register                            */
  __I  uint16_t  RESERVED10;
  __IO uint16_t  I2C2_RAW_INTR_STAT_REG;            /*!< (@ 0x50001534) I2C Raw Interrupt Status Register                      */
  __I  uint16_t  RESERVED11;
  __IO uint16_t  I2C2_RX_TL_REG;                    /*!< (@ 0x50001538) I2C Receive FIFO Threshold Register                    */
  __I  uint16_t  RESERVED12;
  __IO uint16_t  I2C2_TX_TL_REG;                    /*!< (@ 0x5000153C) I2C Transmit FIFO Threshold Register                   */
  __I  uint16_t  RESERVED13;
  __IO uint16_t  I2C2_CLR_INTR_REG;                 /*!< (@ 0x50001540) Clear Combined and Individual Interrupt Register       */
  __I  uint16_t  RESERVED14;
  __IO uint16_t  I2C2_CLR_RX_UNDER_REG;             /*!< (@ 0x50001544) Clear RX_UNDER Interrupt Register                      */
  __I  uint16_t  RESERVED15;
  __IO uint16_t  I2C2_CLR_RX_OVER_REG;              /*!< (@ 0x50001548) Clear RX_OVER Interrupt Register                       */
  __I  uint16_t  RESERVED16;
  __IO uint16_t  I2C2_CLR_TX_OVER_REG;              /*!< (@ 0x5000154C) Clear TX_OVER Interrupt Register                       */
  __I  uint16_t  RESERVED17;
  __IO uint16_t  I2C2_CLR_RD_REQ_REG;               /*!< (@ 0x50001550) Clear RD_REQ Interrupt Register                        */
  __I  uint16_t  RESERVED18;
  __IO uint16_t  I2C2_CLR_TX_ABRT_REG;              /*!< (@ 0x50001554) Clear TX_ABRT Interrupt Register                       */
  __I  uint16_t  RESERVED19;
  __IO uint16_t  I2C2_CLR_RX_DONE_REG;              /*!< (@ 0x50001558) Clear RX_DONE Interrupt Register                       */
  __I  uint16_t  RESERVED20;
  __IO uint16_t  I2C2_CLR_ACTIVITY_REG;             /*!< (@ 0x5000155C) Clear ACTIVITY Interrupt Register                      */
  __I  uint16_t  RESERVED21;
  __IO uint16_t  I2C2_CLR_STOP_DET_REG;             /*!< (@ 0x50001560) Clear STOP_DET Interrupt Register                      */
  __I  uint16_t  RESERVED22;
  __IO uint16_t  I2C2_CLR_START_DET_REG;            /*!< (@ 0x50001564) Clear START_DET Interrupt Register                     */
  __I  uint16_t  RESERVED23;
  __IO uint16_t  I2C2_CLR_GEN_CALL_REG;             /*!< (@ 0x50001568) Clear GEN_CALL Interrupt Register                      */
  __I  uint16_t  RESERVED24;
  __IO uint16_t  I2C2_ENABLE_REG;                   /*!< (@ 0x5000156C) I2C Enable Register                                    */
  __I  uint16_t  RESERVED25;
  __IO uint16_t  I2C2_STATUS_REG;                   /*!< (@ 0x50001570) I2C Status Register                                    */
  __I  uint16_t  RESERVED26;
  __IO uint16_t  I2C2_TXFLR_REG;                    /*!< (@ 0x50001574) I2C Transmit FIFO Level Register                       */
  __I  uint16_t  RESERVED27;
  __IO uint16_t  I2C2_RXFLR_REG;                    /*!< (@ 0x50001578) I2C Receive FIFO Level Register                        */
  __I  uint16_t  RESERVED28;
  __IO uint16_t  I2C2_SDA_HOLD_REG;                 /*!< (@ 0x5000157C) I2C SDA Hold Time Length Register                      */
  __I  uint16_t  RESERVED29;
  __IO uint16_t  I2C2_TX_ABRT_SOURCE_REG;           /*!< (@ 0x50001580) I2C Transmit Abort Source Register                     */
  __I  uint16_t  RESERVED30[3];
  __IO uint16_t  I2C2_DMA_CR_REG;                   /*!< (@ 0x50001588) DMA Control Register                                   */
  __I  uint16_t  RESERVED31;
  __IO uint16_t  I2C2_DMA_TDLR_REG;                 /*!< (@ 0x5000158C) DMA Transmit Data Level Register                       */
  __I  uint16_t  RESERVED32;
  __IO uint16_t  I2C2_DMA_RDLR_REG;                 /*!< (@ 0x50001590) I2C Receive Data Level Register                        */
  __I  uint16_t  RESERVED33;
  __IO uint16_t  I2C2_SDA_SETUP_REG;                /*!< (@ 0x50001594) I2C SDA Setup Register                                 */
  __I  uint16_t  RESERVED34;
  __IO uint16_t  I2C2_ACK_GENERAL_CALL_REG;         /*!< (@ 0x50001598) I2C ACK General Call Register                          */
  __I  uint16_t  RESERVED35;
  __IO uint16_t  I2C2_ENABLE_STATUS_REG;            /*!< (@ 0x5000159C) I2C Enable Status Register                             */
  __I  uint16_t  RESERVED36;
  __IO uint16_t  I2C2_IC_FS_SPKLEN_REG;             /*!< (@ 0x500015A0) I2C SS and FS spike suppression limit Size             */
  __I  uint16_t  RESERVED37[41];
  __IO uint16_t  I2C2_COMP_PARAM1_REG;              /*!< (@ 0x500015F4) Component Parameter Register                           */
  __IO uint16_t  I2C2_COMP_PARAM2_REG;              /*!< (@ 0x500015F6) Component Parameter Register 2                         */
  __IO uint16_t  I2C2_COMP_VERSION_REG;             /*!< (@ 0x500015F8) I2C Component Version Register                         */
  __IO uint16_t  I2C2_COMP2_VERSION;                /*!< (@ 0x500015FA) I2C Component2 Version Register                        */
  __IO uint16_t  I2C2_COMP_TYPE_REG;                /*!< (@ 0x500015FC) I2C Component Type Register                            */
  __IO uint16_t  I2C2_COMP_TYPE2_REG;               /*!< (@ 0x500015FE) I2C Component2 Type Register                           */
} I2C2_Type;


/* ================================================================================ */
/* ================                       IR                       ================ */
/* ================================================================================ */


/**
  * @brief IR registers (IR)
  */

