wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* ----------------------------------  NVIC_IPR0  --------------------------------- */
#define NVIC_IPR0_BLE_WAKEUP_LP_IRQn_prio_Pos (0UL)                     /*!< NVIC IPR0: BLE_WAKEUP_LP_IRQn_prio (Bit 0)                  */
#define NVIC_IPR0_BLE_WAKEUP_LP_IRQn_prio_Msk (0xffUL)                  /*!< NVIC IPR0: BLE_WAKEUP_LP_IRQn_prio (Bitfield-Mask: 0xff)    */
#define NVIC_IPR0_BLE_GEN_IRQn_prio_Pos       (8UL)                     /*!< NVIC IPR0: BLE_GEN_IRQn_prio (Bit 8)                        */
#define NVIC_IPR0_BLE_GEN_IRQn_prio_Msk       (0xff00UL)                /*!< NVIC IPR0: BLE_GEN_IRQn_prio (Bitfield-Mask: 0xff)          */
#define NVIC_IPR0_FTDF_WAKEUP_IRQn_prio_Pos   (16UL)                    /*!< NVIC IPR0: FTDF_WAKEUP_IRQn_prio (Bit 16)                   */
#define NVIC_IPR0_FTDF_WAKEUP_IRQn_prio_Msk   (0xff0000UL)              /*!< NVIC IPR0: FTDF_WAKEUP_IRQn_prio (Bitfield-Mask: 0xff)      */
#define NVIC_IPR0_FTDF_GEN_IRQn_prio_Pos      (24UL)                    /*!< NVIC IPR0: FTDF_GEN_IRQn_prio (Bit 24)                      */
#define NVIC_IPR0_FTDF_GEN_IRQn_prio_Msk      (0xff000000UL)            /*!< NVIC IPR0: FTDF_GEN_IRQn_prio (Bitfield-Mask: 0xff)         */

/* ----------------------------------  NVIC_IPR1  --------------------------------- */
#define NVIC_IPR1_RFCAL_IRQn_prio_Pos         (0UL)                     /*!< NVIC IPR1: RFCAL_IRQn_prio (Bit 0)                          */
#define NVIC_IPR1_RFCAL_IRQn_prio_Msk         (0xffUL)                  /*!< NVIC IPR1: RFCAL_IRQn_prio (Bitfield-Mask: 0xff)            */
#define NVIC_IPR1_COEX_IRQn_prio_Pos          (8UL)                     /*!< NVIC IPR1: COEX_IRQn_prio (Bit 8)                           */
#define NVIC_IPR1_COEX_IRQn_prio_Msk          (0xff00UL)                /*!< NVIC IPR1: COEX_IRQn_prio (Bitfield-Mask: 0xff)             */
#define NVIC_IPR1_CRYPTO_IRQn_prio_Pos        (16UL)                    /*!< NVIC IPR1: CRYPTO_IRQn_prio (Bit 16)                        */
#define NVIC_IPR1_CRYPTO_IRQn_prio_Msk        (0xff0000UL)              /*!< NVIC IPR1: CRYPTO_IRQn_prio (Bitfield-Mask: 0xff)           */
#define NVIC_IPR1_MRM_IRQn_prio_Pos           (24UL)                    /*!< NVIC IPR1: MRM_IRQn_prio (Bit 24)                           */
#define NVIC_IPR1_MRM_IRQn_prio_Msk           (0xff000000UL)            /*!< NVIC IPR1: MRM_IRQn_prio (Bitfield-Mask: 0xff)              */

/* ----------------------------------  NVIC_IPR2  --------------------------------- */
#define NVIC_IPR2_UART_IRQn_prio_Pos          (0UL)                     /*!< NVIC IPR2: UART_IRQn_prio (Bit 0)                           */
#define NVIC_IPR2_UART_IRQn_prio_Msk          (0xffUL)                  /*!< NVIC IPR2: UART_IRQn_prio (Bitfield-Mask: 0xff)             */
#define NVIC_IPR2_UART2_IRQn_prio_Pos         (8UL)                     /*!< NVIC IPR2: UART2_IRQn_prio (Bit 8)                          */
#define NVIC_IPR2_UART2_IRQn_prio_Msk         (0xff00UL)                /*!< NVIC IPR2: UART2_IRQn_prio (Bitfield-Mask: 0xff)            */
#define NVIC_IPR2_I2C_IRQn_prio_Pos           (16UL)                    /*!< NVIC IPR2: I2C_IRQn_prio (Bit 16)                           */
#define NVIC_IPR2_I2C_IRQn_prio_Msk           (0xff0000UL)              /*!< NVIC IPR2: I2C_IRQn_prio (Bitfield-Mask: 0xff)              */
#define NVIC_IPR2_I2C2_IRQn_prio_Pos          (24UL)                    /*!< NVIC IPR2: I2C2_IRQn_prio (Bit 24)                          */
#define NVIC_IPR2_I2C2_IRQn_prio_Msk          (0xff000000UL)            /*!< NVIC IPR2: I2C2_IRQn_prio (Bitfield-Mask: 0xff)             */

/* ----------------------------------  NVIC_IPR3  --------------------------------- */
#define NVIC_IPR3_SPI_IRQn_prio_Pos           (0UL)                     /*!< NVIC IPR3: SPI_IRQn_prio (Bit 0)                            */
#define NVIC_IPR3_SPI_IRQn_prio_Msk           (0xffUL)                  /*!< NVIC IPR3: SPI_IRQn_prio (Bitfield-Mask: 0xff)              */
#define NVIC_IPR3_SPI2_IRQn_prio_Pos          (8UL)                     /*!< NVIC IPR3: SPI2_IRQn_prio (Bit 8)                           */
#define NVIC_IPR3_SPI2_IRQn_prio_Msk          (0xff00UL)                /*!< NVIC IPR3: SPI2_IRQn_prio (Bitfield-Mask: 0xff)             */
#define NVIC_IPR3_ADC_IRQn_prio_Pos           (16UL)                    /*!< NVIC IPR3: ADC_IRQn_prio (Bit 16)                           */
#define NVIC_IPR3_ADC_IRQn_prio_Msk           (0xff0000UL)              /*!< NVIC IPR3: ADC_IRQn_prio (Bitfield-Mask: 0xff)              */
#define NVIC_IPR3_KEYBRD_IRQn_prio_Pos        (24UL)                    /*!< NVIC IPR3: KEYBRD_IRQn_prio (Bit 24)                        */
#define NVIC_IPR3_KEYBRD_IRQn_prio_Msk        (0xff000000UL)            /*!< NVIC IPR3: KEYBRD_IRQn_prio (Bitfield-Mask: 0xff)           */

/* ----------------------------------  NVIC_IPR4  --------------------------------- */
#define NVIC_IPR4_IRGEN_IRQn_prio_Pos         (0UL)                     /*!< NVIC IPR4: IRGEN_IRQn_prio (Bit 0)                          */
#define NVIC_IPR4_IRGEN_IRQn_prio_Msk         (0xffUL)                  /*!< NVIC IPR4: IRGEN_IRQn_prio (Bitfield-Mask: 0xff)            */
#define NVIC_IPR4_WKUP_GPIO_IRQn_prio_Pos     (8UL)                     /*!< NVIC IPR4: WKUP_GPIO_IRQn_prio (Bit 8)                      */
#define NVIC_IPR4_WKUP_GPIO_IRQn_prio_Msk     (0xff00UL)                /*!< NVIC IPR4: WKUP_GPIO_IRQn_prio (Bitfield-Mask: 0xff)        */
#define NVIC_IPR4_SWTIM0_IRQn_prio_Pos        (16UL)                    /*!< NVIC IPR4: SWTIM0_IRQn_prio (Bit 16)                        */
#define NVIC_IPR4_SWTIM0_IRQn_prio_Msk        (0xff0000UL)              /*!< NVIC IPR4: SWTIM0_IRQn_prio (Bitfield-Mask: 0xff)           */
#define NVIC_IPR4_SWTIM1_IRQn_prio_Pos        (24UL)                    /*!< NVIC IPR4: SWTIM1_IRQn_prio (Bit 24)                        */
#define NVIC_IPR4_SWTIM1_IRQn_prio_Msk        (0xff000000UL)            /*!< NVIC IPR4: SWTIM1_IRQn_prio (Bitfield-Mask: 0xff)           */

