wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* -----------------------------  APU_COEF76_SET1_REG  ---------------------------- */
#define APU_COEF76_SET1_REG_SRC_COEF6_Pos     (0UL)                     /*!< APU COEF76_SET1_REG: SRC_COEF6 (Bit 0)                      */
#define APU_COEF76_SET1_REG_SRC_COEF6_Msk     (0xffffUL)                /*!< APU COEF76_SET1_REG: SRC_COEF6 (Bitfield-Mask: 0xffff)      */
#define APU_COEF76_SET1_REG_SRC_COEF7_Pos     (16UL)                    /*!< APU COEF76_SET1_REG: SRC_COEF7 (Bit 16)                     */
#define APU_COEF76_SET1_REG_SRC_COEF7_Msk     (0xffff0000UL)            /*!< APU COEF76_SET1_REG: SRC_COEF7 (Bitfield-Mask: 0xffff)      */

/* -----------------------------  APU_COEF98_SET1_REG  ---------------------------- */
#define APU_COEF98_SET1_REG_SRC_COEF8_Pos     (0UL)                     /*!< APU COEF98_SET1_REG: SRC_COEF8 (Bit 0)                      */
#define APU_COEF98_SET1_REG_SRC_COEF8_Msk     (0xffffUL)                /*!< APU COEF98_SET1_REG: SRC_COEF8 (Bitfield-Mask: 0xffff)      */
#define APU_COEF98_SET1_REG_SRC_COEF9_Pos     (16UL)                    /*!< APU COEF98_SET1_REG: SRC_COEF9 (Bit 16)                     */
#define APU_COEF98_SET1_REG_SRC_COEF9_Msk     (0xffff0000UL)            /*!< APU COEF98_SET1_REG: SRC_COEF9 (Bitfield-Mask: 0xffff)      */

/* -----------------------------  APU_COEF0A_SET1_REG  ---------------------------- */
#define APU_COEF0A_SET1_REG_SRC_COEF10_Pos    (0UL)                     /*!< APU COEF0A_SET1_REG: SRC_COEF10 (Bit 0)                     */
#define APU_COEF0A_SET1_REG_SRC_COEF10_Msk    (0xffffUL)                /*!< APU COEF0A_SET1_REG: SRC_COEF10 (Bitfield-Mask: 0xffff)     */

/* ------------------------------  APU_PCM1_CTRL_REG  ----------------------------- */
#define APU_PCM1_CTRL_REG_PCM_EN_Pos          (0UL)                     /*!< APU PCM1_CTRL_REG: PCM_EN (Bit 0)                           */
#define APU_PCM1_CTRL_REG_PCM_EN_Msk          (0x1UL)                   /*!< APU PCM1_CTRL_REG: PCM_EN (Bitfield-Mask: 0x01)             */
#define APU_PCM1_CTRL_REG_PCM_MASTER_Pos      (1UL)                     /*!< APU PCM1_CTRL_REG: PCM_MASTER (Bit 1)                       */
#define APU_PCM1_CTRL_REG_PCM_MASTER_Msk      (0x2UL)                   /*!< APU PCM1_CTRL_REG: PCM_MASTER (Bitfield-Mask: 0x01)         */
#define APU_PCM1_CTRL_REG_PCM_FSCLEN_Pos      (2UL)                     /*!< APU PCM1_CTRL_REG: PCM_FSCLEN (Bit 2)                       */
#define APU_PCM1_CTRL_REG_PCM_FSCLEN_Msk      (0x3cUL)                  /*!< APU PCM1_CTRL_REG: PCM_FSCLEN (Bitfield-Mask: 0x0f)         */
#define APU_PCM1_CTRL_REG_PCM_FSCDEL_Pos      (6UL)                     /*!< APU PCM1_CTRL_REG: PCM_FSCDEL (Bit 6)                       */
#define APU_PCM1_CTRL_REG_PCM_FSCDEL_Msk      (0x40UL)                  /*!< APU PCM1_CTRL_REG: PCM_FSCDEL (Bitfield-Mask: 0x01)         */
#define APU_PCM1_CTRL_REG_PCM_PPOD_Pos        (7UL)                     /*!< APU PCM1_CTRL_REG: PCM_PPOD (Bit 7)                         */
#define APU_PCM1_CTRL_REG_PCM_PPOD_Msk        (0x80UL)                  /*!< APU PCM1_CTRL_REG: PCM_PPOD (Bitfield-Mask: 0x01)           */
#define APU_PCM1_CTRL_REG_PCM_CLKINV_Pos      (8UL)                     /*!< APU PCM1_CTRL_REG: PCM_CLKINV (Bit 8)                       */
#define APU_PCM1_CTRL_REG_PCM_CLKINV_Msk      (0x100UL)                 /*!< APU PCM1_CTRL_REG: PCM_CLKINV (Bitfield-Mask: 0x01)         */
#define APU_PCM1_CTRL_REG_PCM_FSCINV_Pos      (9UL)                     /*!< APU PCM1_CTRL_REG: PCM_FSCINV (Bit 9)                       */
#define APU_PCM1_CTRL_REG_PCM_FSCINV_Msk      (0x200UL)                 /*!< APU PCM1_CTRL_REG: PCM_FSCINV (Bitfield-Mask: 0x01)         */
#define APU_PCM1_CTRL_REG_PCM_CLK_BIT_Pos     (10UL)                    /*!< APU PCM1_CTRL_REG: PCM_CLK_BIT (Bit 10)                     */
#define APU_PCM1_CTRL_REG_PCM_CLK_BIT_Msk     (0x400UL)                 /*!< APU PCM1_CTRL_REG: PCM_CLK_BIT (Bitfield-Mask: 0x01)        */
#define APU_PCM1_CTRL_REG_PCM_CH_DEL_Pos      (11UL)                    /*!< APU PCM1_CTRL_REG: PCM_CH_DEL (Bit 11)                      */
#define APU_PCM1_CTRL_REG_PCM_CH_DEL_Msk      (0xf800UL)                /*!< APU PCM1_CTRL_REG: PCM_CH_DEL (Bitfield-Mask: 0x1f)         */
#define APU_PCM1_CTRL_REG_PCM_FSC_EDGE_Pos    (16UL)                    /*!< APU PCM1_CTRL_REG: PCM_FSC_EDGE (Bit 16)                    */
#define APU_PCM1_CTRL_REG_PCM_FSC_EDGE_Msk    (0x10000UL)               /*!< APU PCM1_CTRL_REG: PCM_FSC_EDGE (Bitfield-Mask: 0x01)       */
#define APU_PCM1_CTRL_REG_PCM_FSC_DIV_Pos     (20UL)                    /*!< APU PCM1_CTRL_REG: PCM_FSC_DIV (Bit 20)                     */
#define APU_PCM1_CTRL_REG_PCM_FSC_DIV_Msk     (0xfff00000UL)            /*!< APU PCM1_CTRL_REG: PCM_FSC_DIV (Bitfield-Mask: 0xfff)       */

/* ------------------------------  APU_PCM1_IN1_REG  ------------------------------ */
#define APU_PCM1_IN1_REG_PCM_IN_Pos           (0UL)                     /*!< APU PCM1_IN1_REG: PCM_IN (Bit 0)                            */
#define APU_PCM1_IN1_REG_PCM_IN_Msk           (0xffffffffUL)            /*!< APU PCM1_IN1_REG: PCM_IN (Bitfield-Mask: 0xffffffff)        */

/* ------------------------------  APU_PCM1_IN2_REG  ------------------------------ */
#define APU_PCM1_IN2_REG_PCM_IN_Pos           (0UL)                     /*!< APU PCM1_IN2_REG: PCM_IN (Bit 0)                            */
#define APU_PCM1_IN2_REG_PCM_IN_Msk           (0xffffffffUL)            /*!< APU PCM1_IN2_REG: PCM_IN (Bitfield-Mask: 0xffffffff)        */

/* ------------------------------  APU_PCM1_OUT1_REG  ----------------------------- */
#define APU_PCM1_OUT1_REG_PCM_OUT_Pos         (0UL)                     /*!< APU PCM1_OUT1_REG: PCM_OUT (Bit 0)                          */
#define APU_PCM1_OUT1_REG_PCM_OUT_Msk         (0xffffffffUL)            /*!< APU PCM1_OUT1_REG: PCM_OUT (Bitfield-Mask: 0xffffffff)      */

/* ------------------------------  APU_PCM1_OUT2_REG  ----------------------------- */
#define APU_PCM1_OUT2_REG_PCM_OUT_Pos         (0UL)                     /*!< APU PCM1_OUT2_REG: PCM_OUT (Bit 0)                          */
#define APU_PCM1_OUT2_REG_PCM_OUT_Msk         (0xffffffffUL)            /*!< APU PCM1_OUT2_REG: PCM_OUT (Bitfield-Mask: 0xffffffff)      */


/* ================================================================================ */
/* ================          struct 'BLE' Position & Mask          ================ */
/* ================================================================================ */


/* ----------------------------  BLE_BLE_RWBLECNTL_REG  --------------------------- */
#define BLE_BLE_RWBLECNTL_REG_SYNCERR_Pos     (0UL)                     /*!< BLE BLE_RWBLECNTL_REG: SYNCERR (Bit 0)                      */
#define BLE_BLE_RWBLECNTL_REG_SYNCERR_Msk     (0x7UL)                   /*!< BLE BLE_RWBLECNTL_REG: SYNCERR (Bitfield-Mask: 0x07)        */
#define BLE_BLE_RWBLECNTL_REG_RXWINSZDEF_Pos  (4UL)                     /*!< BLE BLE_RWBLECNTL_REG: RXWINSZDEF (Bit 4)                   */
#define BLE_BLE_RWBLECNTL_REG_RXWINSZDEF_Msk  (0xf0UL)                  /*!< BLE BLE_RWBLECNTL_REG: RXWINSZDEF (Bitfield-Mask: 0x0f)     */
#define BLE_BLE_RWBLECNTL_REG_RWBLE_EN_Pos    (8UL)                     /*!< BLE BLE_RWBLECNTL_REG: RWBLE_EN (Bit 8)                     */
#define BLE_BLE_RWBLECNTL_REG_RWBLE_EN_Msk    (0x100UL)                 /*!< BLE BLE_RWBLECNTL_REG: RWBLE_EN (Bitfield-Mask: 0x01)       */
#define BLE_BLE_RWBLECNTL_REG_ADVERTFILT_EN_Pos (9UL)                   /*!< BLE BLE_RWBLECNTL_REG: ADVERTFILT_EN (Bit 9)                */
#define BLE_BLE_RWBLECNTL_REG_ADVERTFILT_EN_Msk (0x200UL)               /*!< BLE BLE_RWBLECNTL_REG: ADVERTFILT_EN (Bitfield-Mask: 0x01)  */
#define BLE_BLE_RWBLECNTL_REG_CORR_MODE_Pos   (12UL)                    /*!< BLE BLE_RWBLECNTL_REG: CORR_MODE (Bit 12)                   */
#define BLE_BLE_RWBLECNTL_REG_CORR_MODE_Msk   (0x3000UL)                /*!< BLE BLE_RWBLECNTL_REG: CORR_MODE (Bitfield-Mask: 0x03)      */
#define BLE_BLE_RWBLECNTL_REG_HOP_REMAP_DSB_Pos (16UL)                  /*!< BLE BLE_RWBLECNTL_REG: HOP_REMAP_DSB (Bit 16)               */
#define BLE_BLE_RWBLECNTL_REG_HOP_REMAP_DSB_Msk (0x10000UL)             /*!< BLE BLE_RWBLECNTL_REG: HOP_REMAP_DSB (Bitfield-Mask: 0x01)  */
#define BLE_BLE_RWBLECNTL_REG_CRC_DSB_Pos     (17UL)                    /*!< BLE BLE_RWBLECNTL_REG: CRC_DSB (Bit 17)                     */
#define BLE_BLE_RWBLECNTL_REG_CRC_DSB_Msk     (0x20000UL)               /*!< BLE BLE_RWBLECNTL_REG: CRC_DSB (Bitfield-Mask: 0x01)        */
#define BLE_BLE_RWBLECNTL_REG_WHIT_DSB_Pos    (18UL)                    /*!< BLE BLE_RWBLECNTL_REG: WHIT_DSB (Bit 18)                    */
#define BLE_BLE_RWBLECNTL_REG_WHIT_DSB_Msk    (0x40000UL)               /*!< BLE BLE_RWBLECNTL_REG: WHIT_DSB (Bitfield-Mask: 0x01)       */
#define BLE_BLE_RWBLECNTL_REG_CRYPT_DSB_Pos   (19UL)                    /*!< BLE BLE_RWBLECNTL_REG: CRYPT_DSB (Bit 19)                   */
#define BLE_BLE_RWBLECNTL_REG_CRYPT_DSB_Msk   (0x80000UL)               /*!< BLE BLE_RWBLECNTL_REG: CRYPT_DSB (Bitfield-Mask: 0x01)      */
#define BLE_BLE_RWBLECNTL_REG_NESN_DSB_Pos    (20UL)                    /*!< BLE BLE_RWBLECNTL_REG: NESN_DSB (Bit 20)                    */
#define BLE_BLE_RWBLECNTL_REG_NESN_DSB_Msk    (0x100000UL)              /*!< BLE BLE_RWBLECNTL_REG: NESN_DSB (Bitfield-Mask: 0x01)       */
#define BLE_BLE_RWBLECNTL_REG_SN_DSB_Pos      (21UL)                    /*!< BLE BLE_RWBLECNTL_REG: SN_DSB (Bit 21)                      */
#define BLE_BLE_RWBLECNTL_REG_SN_DSB_Msk      (0x200000UL)              /*!< BLE BLE_RWBLECNTL_REG: SN_DSB (Bitfield-Mask: 0x01)         */
#define BLE_BLE_RWBLECNTL_REG_MD_DSB_Pos      (22UL)                    /*!< BLE BLE_RWBLECNTL_REG: MD_DSB (Bit 22)                      */
#define BLE_BLE_RWBLECNTL_REG_MD_DSB_Msk      (0x400000UL)              /*!< BLE BLE_RWBLECNTL_REG: MD_DSB (Bitfield-Mask: 0x01)         */
#define BLE_BLE_RWBLECNTL_REG_SCAN_ABORT_Pos  (24UL)                    /*!< BLE BLE_RWBLECNTL_REG: SCAN_ABORT (Bit 24)                  */
#define BLE_BLE_RWBLECNTL_REG_SCAN_ABORT_Msk  (0x1000000UL)             /*!< BLE BLE_RWBLECNTL_REG: SCAN_ABORT (Bitfield-Mask: 0x01)     */
#define BLE_BLE_RWBLECNTL_REG_ADVERT_ABORT_Pos (25UL)                   /*!< BLE BLE_RWBLECNTL_REG: ADVERT_ABORT (Bit 25)                */
#define BLE_BLE_RWBLECNTL_REG_ADVERT_ABORT_Msk (0x2000000UL)            /*!< BLE BLE_RWBLECNTL_REG: ADVERT_ABORT (Bitfield-Mask: 0x01)   */
#define BLE_BLE_RWBLECNTL_REG_RFTEST_ABORT_Pos (26UL)                   /*!< BLE BLE_RWBLECNTL_REG: RFTEST_ABORT (Bit 26)                */
#define BLE_BLE_RWBLECNTL_REG_RFTEST_ABORT_Msk (0x4000000UL)            /*!< BLE BLE_RWBLECNTL_REG: RFTEST_ABORT (Bitfield-Mask: 0x01)   */
#define BLE_BLE_RWBLECNTL_REG_SWINT_REQ_Pos   (28UL)                    /*!< BLE BLE_RWBLECNTL_REG: SWINT_REQ (Bit 28)                   */
#define BLE_BLE_RWBLECNTL_REG_SWINT_REQ_Msk   (0x10000000UL)            /*!< BLE BLE_RWBLECNTL_REG: SWINT_REQ (Bitfield-Mask: 0x01)      */
#define BLE_BLE_RWBLECNTL_REG_REG_SOFT_RST_Pos (29UL)                   /*!< BLE BLE_RWBLECNTL_REG: REG_SOFT_RST (Bit 29)                */
#define BLE_BLE_RWBLECNTL_REG_REG_SOFT_RST_Msk (0x20000000UL)           /*!< BLE BLE_RWBLECNTL_REG: REG_SOFT_RST (Bitfield-Mask: 0x01)   */
#define BLE_BLE_RWBLECNTL_REG_MASTER_TGSOFT_RST_Pos (30UL)              /*!< BLE BLE_RWBLECNTL_REG: MASTER_TGSOFT_RST (Bit 30)           */
#define BLE_BLE_RWBLECNTL_REG_MASTER_TGSOFT_RST_Msk (0x40000000UL)      /*!< BLE BLE_RWBLECNTL_REG: MASTER_TGSOFT_RST (Bitfield-Mask: 0x01) */
#define BLE_BLE_RWBLECNTL_REG_MASTER_SOFT_RST_Pos (31UL)                /*!< BLE BLE_RWBLECNTL_REG: MASTER_SOFT_RST (Bit 31)             */
#define BLE_BLE_RWBLECNTL_REG_MASTER_SOFT_RST_Msk (0x80000000UL)        /*!< BLE BLE_RWBLECNTL_REG: MASTER_SOFT_RST (Bitfield-Mask: 0x01) */

/* -----------------------------  BLE_BLE_VERSION_REG  ---------------------------- */
#define BLE_BLE_VERSION_REG_BUILD_Pos         (0UL)                     /*!< BLE BLE_VERSION_REG: BUILD (Bit 0)                          */
#define BLE_BLE_VERSION_REG_BUILD_Msk         (0xffUL)                  /*!< BLE BLE_VERSION_REG: BUILD (Bitfield-Mask: 0xff)            */
#define BLE_BLE_VERSION_REG_UPG_Pos           (8UL)                     /*!< BLE BLE_VERSION_REG: UPG (Bit 8)                            */
#define BLE_BLE_VERSION_REG_UPG_Msk           (0xff00UL)                /*!< BLE BLE_VERSION_REG: UPG (Bitfield-Mask: 0xff)              */
#define BLE_BLE_VERSION_REG_REL_Pos           (16UL)                    /*!< BLE BLE_VERSION_REG: REL (Bit 16)                           */
#define BLE_BLE_VERSION_REG_REL_Msk           (0xff0000UL)              /*!< BLE BLE_VERSION_REG: REL (Bitfield-Mask: 0xff)              */
#define BLE_BLE_VERSION_REG_TYP_Pos           (24UL)                    /*!< BLE BLE_VERSION_REG: TYP (Bit 24)                           */
#define BLE_BLE_VERSION_REG_TYP_Msk           (0xff000000UL)            /*!< BLE BLE_VERSION_REG: TYP (Bitfield-Mask: 0xff)              */

/* ----------------------------  BLE_BLE_RWBLECONF_REG  --------------------------- */
#define BLE_BLE_RWBLECONF_REG_BUSWIDTH_Pos    (0UL)                     /*!< BLE BLE_RWBLECONF_REG: BUSWIDTH (Bit 0)                     */
#define BLE_BLE_RWBLECONF_REG_BUSWIDTH_Msk    (0x1UL)                   /*!< BLE BLE_RWBLECONF_REG: BUSWIDTH (Bitfield-Mask: 0x01)       */
#define BLE_BLE_RWBLECONF_REG_USECRYPT_Pos    (1UL)                     /*!< BLE BLE_RWBLECONF_REG: USECRYPT (Bit 1)                     */
#define BLE_BLE_RWBLECONF_REG_USECRYPT_Msk    (0x2UL)                   /*!< BLE BLE_RWBLECONF_REG: USECRYPT (Bitfield-Mask: 0x01)       */
#define BLE_BLE_RWBLECONF_REG_USEDBG_Pos      (2UL)                     /*!< BLE BLE_RWBLECONF_REG: USEDBG (Bit 2)                       */
#define BLE_BLE_RWBLECONF_REG_USEDBG_Msk      (0x4UL)                   /*!< BLE BLE_RWBLECONF_REG: USEDBG (Bitfield-Mask: 0x01)         */
#define BLE_BLE_RWBLECONF_REG_COEX_Pos        (3UL)                     /*!< BLE BLE_RWBLECONF_REG: COEX (Bit 3)                         */
#define BLE_BLE_RWBLECONF_REG_COEX_Msk        (0x8UL)                   /*!< BLE BLE_RWBLECONF_REG: COEX (Bitfield-Mask: 0x01)           */
#define BLE_BLE_RWBLECONF_REG_INTMODE_Pos     (4UL)                     /*!< BLE BLE_RWBLECONF_REG: INTMODE (Bit 4)                      */
#define BLE_BLE_RWBLECONF_REG_INTMODE_Msk     (0x10UL)                  /*!< BLE BLE_RWBLECONF_REG: INTMODE (Bitfield-Mask: 0x01)        */
#define BLE_BLE_RWBLECONF_REG_DMMODE_Pos      (5UL)                     /*!< BLE BLE_RWBLECONF_REG: DMMODE (Bit 5)                       */
#define BLE_BLE_RWBLECONF_REG_DMMODE_Msk      (0x20UL)                  /*!< BLE BLE_RWBLECONF_REG: DMMODE (Bitfield-Mask: 0x01)         */
#define BLE_BLE_RWBLECONF_REG_DECIPHER_Pos    (6UL)                     /*!< BLE BLE_RWBLECONF_REG: DECIPHER (Bit 6)                     */
#define BLE_BLE_RWBLECONF_REG_DECIPHER_Msk    (0x40UL)                  /*!< BLE BLE_RWBLECONF_REG: DECIPHER (Bitfield-Mask: 0x01)       */
#define BLE_BLE_RWBLECONF_REG_CLK_SEL_Pos     (8UL)                     /*!< BLE BLE_RWBLECONF_REG: CLK_SEL (Bit 8)                      */
#define BLE_BLE_RWBLECONF_REG_CLK_SEL_Msk     (0x3f00UL)                /*!< BLE BLE_RWBLECONF_REG: CLK_SEL (Bitfield-Mask: 0x3f)        */
#define BLE_BLE_RWBLECONF_REG_RFIF_Pos        (16UL)                    /*!< BLE BLE_RWBLECONF_REG: RFIF (Bit 16)                        */
#define BLE_BLE_RWBLECONF_REG_RFIF_Msk        (0x7f0000UL)              /*!< BLE BLE_RWBLECONF_REG: RFIF (Bitfield-Mask: 0x7f)           */
#define BLE_BLE_RWBLECONF_REG_ADD_WIDTH_Pos   (24UL)                    /*!< BLE BLE_RWBLECONF_REG: ADD_WIDTH (Bit 24)                   */
#define BLE_BLE_RWBLECONF_REG_ADD_WIDTH_Msk   (0x3f000000UL)            /*!< BLE BLE_RWBLECONF_REG: ADD_WIDTH (Bitfield-Mask: 0x3f)      */

/* -----------------------------  BLE_BLE_INTCNTL_REG  ---------------------------- */
#define BLE_BLE_INTCNTL_REG_CSCNTINTMSK_Pos   (0UL)                     /*!< BLE BLE_INTCNTL_REG: CSCNTINTMSK (Bit 0)                    */
#define BLE_BLE_INTCNTL_REG_CSCNTINTMSK_Msk   (0x1UL)                   /*!< BLE BLE_INTCNTL_REG: CSCNTINTMSK (Bitfield-Mask: 0x01)      */
#define BLE_BLE_INTCNTL_REG_RXINTMSK_Pos      (1UL)                     /*!< BLE BLE_INTCNTL_REG: RXINTMSK (Bit 1)                       */
#define BLE_BLE_INTCNTL_REG_RXINTMSK_Msk      (0x2UL)                   /*!< BLE BLE_INTCNTL_REG: RXINTMSK (Bitfield-Mask: 0x01)         */
#define BLE_BLE_INTCNTL_REG_SLPINTMSK_Pos     (2UL)                     /*!< BLE BLE_INTCNTL_REG: SLPINTMSK (Bit 2)                      */
#define BLE_BLE_INTCNTL_REG_SLPINTMSK_Msk     (0x4UL)                   /*!< BLE BLE_INTCNTL_REG: SLPINTMSK (Bitfield-Mask: 0x01)        */
#define BLE_BLE_INTCNTL_REG_EVENTINTMSK_Pos   (3UL)                     /*!< BLE BLE_INTCNTL_REG: EVENTINTMSK (Bit 3)                    */
#define BLE_BLE_INTCNTL_REG_EVENTINTMSK_Msk   (0x8UL)                   /*!< BLE BLE_INTCNTL_REG: EVENTINTMSK (Bitfield-Mask: 0x01)      */
#define BLE_BLE_INTCNTL_REG_CRYPTINTMSK_Pos   (4UL)                     /*!< BLE BLE_INTCNTL_REG: CRYPTINTMSK (Bit 4)                    */
#define BLE_BLE_INTCNTL_REG_CRYPTINTMSK_Msk   (0x10UL)                  /*!< BLE BLE_INTCNTL_REG: CRYPTINTMSK (Bitfield-Mask: 0x01)      */
#define BLE_BLE_INTCNTL_REG_ERRORINTMSK_Pos   (5UL)                     /*!< BLE BLE_INTCNTL_REG: ERRORINTMSK (Bit 5)                    */
#define BLE_BLE_INTCNTL_REG_ERRORINTMSK_Msk   (0x20UL)                  /*!< BLE BLE_INTCNTL_REG: ERRORINTMSK (Bitfield-Mask: 0x01)      */
#define BLE_BLE_INTCNTL_REG_GROSSTGTIMINTMSK_Pos (6UL)                  /*!< BLE BLE_INTCNTL_REG: GROSSTGTIMINTMSK (Bit 6)               */
#define BLE_BLE_INTCNTL_REG_GROSSTGTIMINTMSK_Msk (0x40UL)               /*!< BLE BLE_INTCNTL_REG: GROSSTGTIMINTMSK (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTCNTL_REG_FINETGTIMINTMSK_Pos (7UL)                   /*!< BLE BLE_INTCNTL_REG: FINETGTIMINTMSK (Bit 7)                */
#define BLE_BLE_INTCNTL_REG_FINETGTIMINTMSK_Msk (0x80UL)                /*!< BLE BLE_INTCNTL_REG: FINETGTIMINTMSK (Bitfield-Mask: 0x01)  */
#define BLE_BLE_INTCNTL_REG_EVENTAPFAINTMSK_Pos (8UL)                   /*!< BLE BLE_INTCNTL_REG: EVENTAPFAINTMSK (Bit 8)                */
#define BLE_BLE_INTCNTL_REG_EVENTAPFAINTMSK_Msk (0x100UL)               /*!< BLE BLE_INTCNTL_REG: EVENTAPFAINTMSK (Bitfield-Mask: 0x01)  */
#define BLE_BLE_INTCNTL_REG_SWINTMSK_Pos      (9UL)                     /*!< BLE BLE_INTCNTL_REG: SWINTMSK (Bit 9)                       */
#define BLE_BLE_INTCNTL_REG_SWINTMSK_Msk      (0x200UL)                 /*!< BLE BLE_INTCNTL_REG: SWINTMSK (Bitfield-Mask: 0x01)         */
#define BLE_BLE_INTCNTL_REG_CSCNTDEVMSK_Pos   (15UL)                    /*!< BLE BLE_INTCNTL_REG: CSCNTDEVMSK (Bit 15)                   */
#define BLE_BLE_INTCNTL_REG_CSCNTDEVMSK_Msk   (0x8000UL)                /*!< BLE BLE_INTCNTL_REG: CSCNTDEVMSK (Bitfield-Mask: 0x01)      */

/* -----------------------------  BLE_BLE_INTSTAT_REG  ---------------------------- */
#define BLE_BLE_INTSTAT_REG_CSCNTINTSTAT_Pos  (0UL)                     /*!< BLE BLE_INTSTAT_REG: CSCNTINTSTAT (Bit 0)                   */
#define BLE_BLE_INTSTAT_REG_CSCNTINTSTAT_Msk  (0x1UL)                   /*!< BLE BLE_INTSTAT_REG: CSCNTINTSTAT (Bitfield-Mask: 0x01)     */
#define BLE_BLE_INTSTAT_REG_RXINTSTAT_Pos     (1UL)                     /*!< BLE BLE_INTSTAT_REG: RXINTSTAT (Bit 1)                      */
#define BLE_BLE_INTSTAT_REG_RXINTSTAT_Msk     (0x2UL)                   /*!< BLE BLE_INTSTAT_REG: RXINTSTAT (Bitfield-Mask: 0x01)        */
#define BLE_BLE_INTSTAT_REG_SLPINTSTAT_Pos    (2UL)                     /*!< BLE BLE_INTSTAT_REG: SLPINTSTAT (Bit 2)                     */
#define BLE_BLE_INTSTAT_REG_SLPINTSTAT_Msk    (0x4UL)                   /*!< BLE BLE_INTSTAT_REG: SLPINTSTAT (Bitfield-Mask: 0x01)       */
#define BLE_BLE_INTSTAT_REG_EVENTINTSTAT_Pos  (3UL)                     /*!< BLE BLE_INTSTAT_REG: EVENTINTSTAT (Bit 3)                   */
#define BLE_BLE_INTSTAT_REG_EVENTINTSTAT_Msk  (0x8UL)                   /*!< BLE BLE_INTSTAT_REG: EVENTINTSTAT (Bitfield-Mask: 0x01)     */
#define BLE_BLE_INTSTAT_REG_CRYPTINTSTAT_Pos  (4UL)                     /*!< BLE BLE_INTSTAT_REG: CRYPTINTSTAT (Bit 4)                   */
#define BLE_BLE_INTSTAT_REG_CRYPTINTSTAT_Msk  (0x10UL)                  /*!< BLE BLE_INTSTAT_REG: CRYPTINTSTAT (Bitfield-Mask: 0x01)     */
#define BLE_BLE_INTSTAT_REG_ERRORINTSTAT_Pos  (5UL)                     /*!< BLE BLE_INTSTAT_REG: ERRORINTSTAT (Bit 5)                   */
#define BLE_BLE_INTSTAT_REG_ERRORINTSTAT_Msk  (0x20UL)                  /*!< BLE BLE_INTSTAT_REG: ERRORINTSTAT (Bitfield-Mask: 0x01)     */
#define BLE_BLE_INTSTAT_REG_GROSSTGTIMINTSTAT_Pos (6UL)                 /*!< BLE BLE_INTSTAT_REG: GROSSTGTIMINTSTAT (Bit 6)              */
#define BLE_BLE_INTSTAT_REG_GROSSTGTIMINTSTAT_Msk (0x40UL)              /*!< BLE BLE_INTSTAT_REG: GROSSTGTIMINTSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTSTAT_REG_FINETGTIMINTSTAT_Pos (7UL)                  /*!< BLE BLE_INTSTAT_REG: FINETGTIMINTSTAT (Bit 7)               */
#define BLE_BLE_INTSTAT_REG_FINETGTIMINTSTAT_Msk (0x80UL)               /*!< BLE BLE_INTSTAT_REG: FINETGTIMINTSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTSTAT_REG_EVENTAPFAINTSTAT_Pos (8UL)                  /*!< BLE BLE_INTSTAT_REG: EVENTAPFAINTSTAT (Bit 8)               */
#define BLE_BLE_INTSTAT_REG_EVENTAPFAINTSTAT_Msk (0x100UL)              /*!< BLE BLE_INTSTAT_REG: EVENTAPFAINTSTAT (Bitfield-Mask: 0x01) */
#define BLE_BLE_INTSTAT_REG_SWINTSTAT_Pos     (9UL)                     /*!< BLE BLE_INTSTAT_REG: SWINTSTAT (Bit 9)                      */
#define BLE_BLE_INTSTAT_REG_SWINTSTAT_Msk     (0x200UL)                 /*!< BLE BLE_INTSTAT_REG: SWINTSTAT (Bitfield-Mask: 0x01)        */

