wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* -------------------------  CACHE_CACHE_MRM_MISSES_REG  ------------------------- */
#define CACHE_CACHE_MRM_MISSES_REG_MRM_MISSES_Pos (0UL)                 /*!< CACHE CACHE_MRM_MISSES_REG: MRM_MISSES (Bit 0)              */
#define CACHE_CACHE_MRM_MISSES_REG_MRM_MISSES_Msk (0x3ffffUL)           /*!< CACHE CACHE_MRM_MISSES_REG: MRM_MISSES (Bitfield-Mask: 0x3ffff) */

/* --------------------------  CACHE_CACHE_MRM_CTRL_REG  -------------------------- */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_START_Pos (0UL)                    /*!< CACHE CACHE_MRM_CTRL_REG: MRM_START (Bit 0)                 */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_START_Msk (0x1UL)                  /*!< CACHE CACHE_MRM_CTRL_REG: MRM_START (Bitfield-Mask: 0x01)   */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_MASK_Pos (1UL)                 /*!< CACHE CACHE_MRM_CTRL_REG: MRM_IRQ_MASK (Bit 1)              */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_MASK_Msk (0x2UL)               /*!< CACHE CACHE_MRM_CTRL_REG: MRM_IRQ_MASK (Bitfield-Mask: 0x01) */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_TINT_STATUS_Pos (2UL)          /*!< CACHE CACHE_MRM_CTRL_REG: MRM_IRQ_TINT_STATUS (Bit 2)       */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_TINT_STATUS_Msk (0x4UL)        /*!< CACHE CACHE_MRM_CTRL_REG: MRM_IRQ_TINT_STATUS (Bitfield-Mask: 0x01) */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_THRES_STATUS_Pos (3UL)         /*!< CACHE CACHE_MRM_CTRL_REG: MRM_IRQ_THRES_STATUS (Bit 3)      */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_THRES_STATUS_Msk (0x8UL)       /*!< CACHE CACHE_MRM_CTRL_REG: MRM_IRQ_THRES_STATUS (Bitfield-Mask: 0x01) */

/* --------------------------  CACHE_CACHE_MRM_TINT_REG  -------------------------- */
#define CACHE_CACHE_MRM_TINT_REG_MRM_TINT_Pos (0UL)                     /*!< CACHE CACHE_MRM_TINT_REG: MRM_TINT (Bit 0)                  */
#define CACHE_CACHE_MRM_TINT_REG_MRM_TINT_Msk (0x3ffffUL)               /*!< CACHE CACHE_MRM_TINT_REG: MRM_TINT (Bitfield-Mask: 0x3ffff) */

/* --------------------------  CACHE_CACHE_MRM_THRES_REG  ------------------------- */
#define CACHE_CACHE_MRM_THRES_REG_MRM_THRES_Pos (0UL)                   /*!< CACHE CACHE_MRM_THRES_REG: MRM_THRES (Bit 0)                */
#define CACHE_CACHE_MRM_THRES_REG_MRM_THRES_Msk (0x3ffffUL)             /*!< CACHE CACHE_MRM_THRES_REG: MRM_THRES (Bitfield-Mask: 0x3ffff) */

/* -----------------------------  CACHE_SWD_RESET_REG  ---------------------------- */
#define CACHE_SWD_RESET_REG_SWD_HW_RESET_REQ_Pos (0UL)                  /*!< CACHE SWD_RESET_REG: SWD_HW_RESET_REQ (Bit 0)               */
#define CACHE_SWD_RESET_REG_SWD_HW_RESET_REQ_Msk (0x1UL)                /*!< CACHE SWD_RESET_REG: SWD_HW_RESET_REQ (Bitfield-Mask: 0x01) */


/* ================================================================================ */
/* ================      struct 'CHIP_VERSION' Position & Mask     ================ */
/* ================================================================================ */


/* --------------------------  CHIP_VERSION_CHIP_ID1_REG  ------------------------- */
#define CHIP_VERSION_CHIP_ID1_REG_CHIP_ID1_Pos (0UL)                    /*!< CHIP_VERSION CHIP_ID1_REG: CHIP_ID1 (Bit 0)                 */
#define CHIP_VERSION_CHIP_ID1_REG_CHIP_ID1_Msk (0xffUL)                 /*!< CHIP_VERSION CHIP_ID1_REG: CHIP_ID1 (Bitfield-Mask: 0xff)   */

/* --------------------------  CHIP_VERSION_CHIP_ID2_REG  ------------------------- */
#define CHIP_VERSION_CHIP_ID2_REG_CHIP_ID2_Pos (0UL)                    /*!< CHIP_VERSION CHIP_ID2_REG: CHIP_ID2 (Bit 0)                 */
#define CHIP_VERSION_CHIP_ID2_REG_CHIP_ID2_Msk (0xffUL)                 /*!< CHIP_VERSION CHIP_ID2_REG: CHIP_ID2 (Bitfield-Mask: 0xff)   */

/* --------------------------  CHIP_VERSION_CHIP_ID3_REG  ------------------------- */
#define CHIP_VERSION_CHIP_ID3_REG_CHIP_ID3_Pos (0UL)                    /*!< CHIP_VERSION CHIP_ID3_REG: CHIP_ID3 (Bit 0)                 */
#define CHIP_VERSION_CHIP_ID3_REG_CHIP_ID3_Msk (0xffUL)                 /*!< CHIP_VERSION CHIP_ID3_REG: CHIP_ID3 (Bitfield-Mask: 0xff)   */

/* --------------------------  CHIP_VERSION_CHIP_SWC_REG  ------------------------- */
#define CHIP_VERSION_CHIP_SWC_REG_CHIP_SWC_Pos (0UL)                    /*!< CHIP_VERSION CHIP_SWC_REG: CHIP_SWC (Bit 0)                 */
#define CHIP_VERSION_CHIP_SWC_REG_CHIP_SWC_Msk (0xfUL)                  /*!< CHIP_VERSION CHIP_SWC_REG: CHIP_SWC (Bitfield-Mask: 0x0f)   */

/* -----------------------  CHIP_VERSION_CHIP_REVISION_REG  ----------------------- */
#define CHIP_VERSION_CHIP_REVISION_REG_REVISION_ID_Pos (0UL)            /*!< CHIP_VERSION CHIP_REVISION_REG: REVISION_ID (Bit 0)         */
#define CHIP_VERSION_CHIP_REVISION_REG_REVISION_ID_Msk (0xffUL)         /*!< CHIP_VERSION CHIP_REVISION_REG: REVISION_ID (Bitfield-Mask: 0xff) */

/* ------------------------  CHIP_VERSION_CHIP_CONFIG1_REG  ----------------------- */
#define CHIP_VERSION_CHIP_CONFIG1_REG_CHIP_CONFIG1_Pos (0UL)            /*!< CHIP_VERSION CHIP_CONFIG1_REG: CHIP_CONFIG1 (Bit 0)         */
#define CHIP_VERSION_CHIP_CONFIG1_REG_CHIP_CONFIG1_Msk (0xffUL)         /*!< CHIP_VERSION CHIP_CONFIG1_REG: CHIP_CONFIG1 (Bitfield-Mask: 0xff) */

/* ------------------------  CHIP_VERSION_CHIP_CONFIG2_REG  ----------------------- */
#define CHIP_VERSION_CHIP_CONFIG2_REG_CHIP_CONFIG2_Pos (0UL)            /*!< CHIP_VERSION CHIP_CONFIG2_REG: CHIP_CONFIG2 (Bit 0)         */
#define CHIP_VERSION_CHIP_CONFIG2_REG_CHIP_CONFIG2_Msk (0xffUL)         /*!< CHIP_VERSION CHIP_CONFIG2_REG: CHIP_CONFIG2 (Bitfield-Mask: 0xff) */

/* ------------------------  CHIP_VERSION_CHIP_CONFIG3_REG  ----------------------- */
#define CHIP_VERSION_CHIP_CONFIG3_REG_CHIP_CONFIG3_Pos (0UL)            /*!< CHIP_VERSION CHIP_CONFIG3_REG: CHIP_CONFIG3 (Bit 0)         */
#define CHIP_VERSION_CHIP_CONFIG3_REG_CHIP_CONFIG3_Msk (0xffUL)         /*!< CHIP_VERSION CHIP_CONFIG3_REG: CHIP_CONFIG3 (Bitfield-Mask: 0xff) */


/* ================================================================================ */
/* ================          struct 'COEX' Position & Mask         ================ */
/* ================================================================================ */


/* -----------------------------  COEX_COEX_CTRL_REG  ----------------------------- */
#define COEX_COEX_CTRL_REG_PRGING_ARBITER_Pos (0UL)                     /*!< COEX COEX_CTRL_REG: PRGING_ARBITER (Bit 0)                  */
#define COEX_COEX_CTRL_REG_PRGING_ARBITER_Msk (0x1UL)                   /*!< COEX COEX_CTRL_REG: PRGING_ARBITER (Bitfield-Mask: 0x01)    */
#define COEX_COEX_CTRL_REG_SMART_ACT_IMPL_Pos (4UL)                     /*!< COEX COEX_CTRL_REG: SMART_ACT_IMPL (Bit 4)                  */
#define COEX_COEX_CTRL_REG_SMART_ACT_IMPL_Msk (0x10UL)                  /*!< COEX COEX_CTRL_REG: SMART_ACT_IMPL (Bitfield-Mask: 0x01)    */
#define COEX_COEX_CTRL_REG_SEL_COEX_DIAG_Pos  (5UL)                     /*!< COEX COEX_CTRL_REG: SEL_COEX_DIAG (Bit 5)                   */
#define COEX_COEX_CTRL_REG_SEL_COEX_DIAG_Msk  (0x60UL)                  /*!< COEX COEX_CTRL_REG: SEL_COEX_DIAG (Bitfield-Mask: 0x03)     */
#define COEX_COEX_CTRL_REG_SEL_FTDF_CCA_Pos   (7UL)                     /*!< COEX COEX_CTRL_REG: SEL_FTDF_CCA (Bit 7)                    */
#define COEX_COEX_CTRL_REG_SEL_FTDF_CCA_Msk   (0x80UL)                  /*!< COEX COEX_CTRL_REG: SEL_FTDF_CCA (Bitfield-Mask: 0x01)      */
#define COEX_COEX_CTRL_REG_SEL_FTDF_PTI_Pos   (8UL)                     /*!< COEX COEX_CTRL_REG: SEL_FTDF_PTI (Bit 8)                    */
#define COEX_COEX_CTRL_REG_SEL_FTDF_PTI_Msk   (0x100UL)                 /*!< COEX COEX_CTRL_REG: SEL_FTDF_PTI (Bitfield-Mask: 0x01)      */
#define COEX_COEX_CTRL_REG_SEL_BLE_WLAN_TX_RX_Pos (10UL)                /*!< COEX COEX_CTRL_REG: SEL_BLE_WLAN_TX_RX (Bit 10)             */
#define COEX_COEX_CTRL_REG_SEL_BLE_WLAN_TX_RX_Msk (0x400UL)             /*!< COEX COEX_CTRL_REG: SEL_BLE_WLAN_TX_RX (Bitfield-Mask: 0x01) */
#define COEX_COEX_CTRL_REG_SEL_BLE_RADIO_BUSY_Pos (11UL)                /*!< COEX COEX_CTRL_REG: SEL_BLE_RADIO_BUSY (Bit 11)             */
#define COEX_COEX_CTRL_REG_SEL_BLE_RADIO_BUSY_Msk (0x1800UL)            /*!< COEX COEX_CTRL_REG: SEL_BLE_RADIO_BUSY (Bitfield-Mask: 0x03) */
#define COEX_COEX_CTRL_REG_IGNORE_EXT_Pos     (13UL)                    /*!< COEX COEX_CTRL_REG: IGNORE_EXT (Bit 13)                     */
#define COEX_COEX_CTRL_REG_IGNORE_EXT_Msk     (0x2000UL)                /*!< COEX COEX_CTRL_REG: IGNORE_EXT (Bitfield-Mask: 0x01)        */
#define COEX_COEX_CTRL_REG_IGNORE_FTDF_Pos    (14UL)                    /*!< COEX COEX_CTRL_REG: IGNORE_FTDF (Bit 14)                    */
#define COEX_COEX_CTRL_REG_IGNORE_FTDF_Msk    (0x4000UL)                /*!< COEX COEX_CTRL_REG: IGNORE_FTDF (Bitfield-Mask: 0x01)       */
#define COEX_COEX_CTRL_REG_IGNORE_BLE_Pos     (15UL)                    /*!< COEX COEX_CTRL_REG: IGNORE_BLE (Bit 15)                     */
#define COEX_COEX_CTRL_REG_IGNORE_BLE_Msk     (0x8000UL)                /*!< COEX COEX_CTRL_REG: IGNORE_BLE (Bitfield-Mask: 0x01)        */

