wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* -----------------------------  DCDC_DCDC_TRIM_REG  ----------------------------- */
#define DCDC_DCDC_TRIM_REG_DCDC_N_COMP_TRIM_Pos (0UL)                   /*!< DCDC DCDC_TRIM_REG: DCDC_N_COMP_TRIM (Bit 0)                */
#define DCDC_DCDC_TRIM_REG_DCDC_N_COMP_TRIM_Msk (0x3fUL)                /*!< DCDC DCDC_TRIM_REG: DCDC_N_COMP_TRIM (Bitfield-Mask: 0x3f)  */
#define DCDC_DCDC_TRIM_REG_DCDC_N_COMP_MAN_TRIM_Pos (6UL)               /*!< DCDC DCDC_TRIM_REG: DCDC_N_COMP_MAN_TRIM (Bit 6)            */
#define DCDC_DCDC_TRIM_REG_DCDC_N_COMP_MAN_TRIM_Msk (0x40UL)            /*!< DCDC DCDC_TRIM_REG: DCDC_N_COMP_MAN_TRIM (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TRIM_REG_DCDC_P_COMP_TRIM_Pos (7UL)                   /*!< DCDC DCDC_TRIM_REG: DCDC_P_COMP_TRIM (Bit 7)                */
#define DCDC_DCDC_TRIM_REG_DCDC_P_COMP_TRIM_Msk (0x1f80UL)              /*!< DCDC DCDC_TRIM_REG: DCDC_P_COMP_TRIM (Bitfield-Mask: 0x3f)  */
#define DCDC_DCDC_TRIM_REG_DCDC_P_COMP_MAN_TRIM_Pos (13UL)              /*!< DCDC DCDC_TRIM_REG: DCDC_P_COMP_MAN_TRIM (Bit 13)           */
#define DCDC_DCDC_TRIM_REG_DCDC_P_COMP_MAN_TRIM_Msk (0x2000UL)          /*!< DCDC DCDC_TRIM_REG: DCDC_P_COMP_MAN_TRIM (Bitfield-Mask: 0x01) */

/* ----------------------------  DCDC_DCDC_TEST_0_REG  ---------------------------- */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_PSW_Pos (0UL)                   /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_PSW (Bit 0)                */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_PSW_Msk (0x1UL)                 /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_PSW (Bitfield-Mask: 0x01)  */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_NSW_Pos (1UL)                   /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_NSW (Bit 1)                */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_NSW_Msk (0x2UL)                 /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_NSW (Bitfield-Mask: 0x01)  */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_FW_Pos (2UL)                    /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_FW (Bit 2)                 */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_FW_Msk (0x4UL)                  /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_FW (Bitfield-Mask: 0x01)   */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_V14_Pos (3UL)                   /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_V14 (Bit 3)                */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_V14_Msk (0x8UL)                 /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_V14 (Bitfield-Mask: 0x01)  */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_V18_Pos (4UL)                   /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_V18 (Bit 4)                */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_V18_Msk (0x10UL)                /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_V18 (Bitfield-Mask: 0x01)  */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_VDD_Pos (5UL)                   /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_VDD (Bit 5)                */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_VDD_Msk (0x20UL)                /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_VDD (Bitfield-Mask: 0x01)  */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_V18P_Pos (6UL)                  /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_V18P (Bit 6)               */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_V18P_Msk (0x40UL)               /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_V18P (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_IDLE_Pos (7UL)                  /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_IDLE (Bit 7)               */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_IDLE_Msk (0x80UL)               /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_IDLE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TEST_0_REG_DCDC_ANA_TEST_Pos (8UL)                    /*!< DCDC DCDC_TEST_0_REG: DCDC_ANA_TEST (Bit 8)                 */
#define DCDC_DCDC_TEST_0_REG_DCDC_ANA_TEST_Msk (0x700UL)                /*!< DCDC DCDC_TEST_0_REG: DCDC_ANA_TEST (Bitfield-Mask: 0x07)   */
#define DCDC_DCDC_TEST_0_REG_DCDC_OUTPUT_MONITOR_Pos (11UL)             /*!< DCDC DCDC_TEST_0_REG: DCDC_OUTPUT_MONITOR (Bit 11)          */
#define DCDC_DCDC_TEST_0_REG_DCDC_OUTPUT_MONITOR_Msk (0x3800UL)         /*!< DCDC DCDC_TEST_0_REG: DCDC_OUTPUT_MONITOR (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_CURRENT_Pos (14UL)              /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_CURRENT (Bit 14)           */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_CURRENT_Msk (0x4000UL)          /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_CURRENT (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_COMP_CLK_Pos (15UL)             /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_COMP_CLK (Bit 15)          */
#define DCDC_DCDC_TEST_0_REG_DCDC_FORCE_COMP_CLK_Msk (0x8000UL)         /*!< DCDC DCDC_TEST_0_REG: DCDC_FORCE_COMP_CLK (Bitfield-Mask: 0x01) */

/* ----------------------------  DCDC_DCDC_TEST_1_REG  ---------------------------- */
#define DCDC_DCDC_TEST_1_REG_DCDC_TEST_REG_Pos (0UL)                    /*!< DCDC DCDC_TEST_1_REG: DCDC_TEST_REG (Bit 0)                 */
#define DCDC_DCDC_TEST_1_REG_DCDC_TEST_REG_Msk (0xfUL)                  /*!< DCDC DCDC_TEST_1_REG: DCDC_TEST_REG (Bitfield-Mask: 0x0f)   */
#define DCDC_DCDC_TEST_1_REG_DCDC_TEST_CURRENT_Pos (4UL)                /*!< DCDC DCDC_TEST_1_REG: DCDC_TEST_CURRENT (Bit 4)             */
#define DCDC_DCDC_TEST_1_REG_DCDC_TEST_CURRENT_Msk (0x1f0UL)            /*!< DCDC DCDC_TEST_1_REG: DCDC_TEST_CURRENT (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_TEST_1_REG_DCDC_COMP_CLK_Pos (9UL)                    /*!< DCDC DCDC_TEST_1_REG: DCDC_COMP_CLK (Bit 9)                 */
#define DCDC_DCDC_TEST_1_REG_DCDC_COMP_CLK_Msk (0x1e00UL)               /*!< DCDC DCDC_TEST_1_REG: DCDC_COMP_CLK (Bitfield-Mask: 0x0f)   */

/* ---------------------------  DCDC_DCDC_STATUS_0_REG  --------------------------- */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_0_Pos (0UL)              /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_0 (Bit 0)           */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_0_Msk (0x7UL)            /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_0 (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_1_Pos (3UL)              /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_1 (Bit 3)           */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_1_Msk (0x38UL)           /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_1 (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_2_Pos (6UL)              /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_2 (Bit 6)           */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_2_Msk (0x1c0UL)          /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_2 (Bitfield-Mask: 0x07) */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_3_Pos (9UL)              /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_3 (Bit 9)           */
#define DCDC_DCDC_STATUS_0_REG_DCDC_CHARGE_REG_3_Msk (0xe00UL)          /*!< DCDC DCDC_STATUS_0_REG: DCDC_CHARGE_REG_3 (Bitfield-Mask: 0x07) */

/* ---------------------------  DCDC_DCDC_STATUS_1_REG  --------------------------- */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V14_NOK_Pos (0UL)                   /*!< DCDC DCDC_STATUS_1_REG: DCDC_V14_NOK (Bit 0)                */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V14_NOK_Msk (0x1UL)                 /*!< DCDC DCDC_STATUS_1_REG: DCDC_V14_NOK (Bitfield-Mask: 0x01)  */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18_NOK_Pos (1UL)                   /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18_NOK (Bit 1)                */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18_NOK_Msk (0x2UL)                 /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18_NOK (Bitfield-Mask: 0x01)  */
#define DCDC_DCDC_STATUS_1_REG_DCDC_VDD_NOK_Pos (2UL)                   /*!< DCDC DCDC_STATUS_1_REG: DCDC_VDD_NOK (Bit 2)                */
#define DCDC_DCDC_STATUS_1_REG_DCDC_VDD_NOK_Msk (0x4UL)                 /*!< DCDC DCDC_STATUS_1_REG: DCDC_VDD_NOK (Bitfield-Mask: 0x01)  */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18P_NOK_Pos (3UL)                  /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18P_NOK (Bit 3)               */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18P_NOK_Msk (0x8UL)                /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18P_NOK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V14_OK_Pos (4UL)                    /*!< DCDC DCDC_STATUS_1_REG: DCDC_V14_OK (Bit 4)                 */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V14_OK_Msk (0x10UL)                 /*!< DCDC DCDC_STATUS_1_REG: DCDC_V14_OK (Bitfield-Mask: 0x01)   */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18_OK_Pos (5UL)                    /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18_OK (Bit 5)                 */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18_OK_Msk (0x20UL)                 /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18_OK (Bitfield-Mask: 0x01)   */
#define DCDC_DCDC_STATUS_1_REG_DCDC_VDD_OK_Pos (6UL)                    /*!< DCDC DCDC_STATUS_1_REG: DCDC_VDD_OK (Bit 6)                 */
#define DCDC_DCDC_STATUS_1_REG_DCDC_VDD_OK_Msk (0x40UL)                 /*!< DCDC DCDC_STATUS_1_REG: DCDC_VDD_OK (Bitfield-Mask: 0x01)   */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18P_OK_Pos (7UL)                   /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18P_OK (Bit 7)                */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18P_OK_Msk (0x80UL)                /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18P_OK (Bitfield-Mask: 0x01)  */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V14_AVAILABLE_Pos (8UL)             /*!< DCDC DCDC_STATUS_1_REG: DCDC_V14_AVAILABLE (Bit 8)          */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V14_AVAILABLE_Msk (0x100UL)         /*!< DCDC DCDC_STATUS_1_REG: DCDC_V14_AVAILABLE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18_AVAILABLE_Pos (9UL)             /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18_AVAILABLE (Bit 9)          */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18_AVAILABLE_Msk (0x200UL)         /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18_AVAILABLE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_VDD_AVAILABLE_Pos (10UL)            /*!< DCDC DCDC_STATUS_1_REG: DCDC_VDD_AVAILABLE (Bit 10)         */
#define DCDC_DCDC_STATUS_1_REG_DCDC_VDD_AVAILABLE_Msk (0x400UL)         /*!< DCDC DCDC_STATUS_1_REG: DCDC_VDD_AVAILABLE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18P_AVAILABLE_Pos (11UL)           /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18P_AVAILABLE (Bit 11)        */
#define DCDC_DCDC_STATUS_1_REG_DCDC_V18P_AVAILABLE_Msk (0x800UL)        /*!< DCDC DCDC_STATUS_1_REG: DCDC_V18P_AVAILABLE (Bitfield-Mask: 0x01) */

/* ---------------------------  DCDC_DCDC_STATUS_2_REG  --------------------------- */
#define DCDC_DCDC_STATUS_2_REG_DCDC_N_COMP_Pos (0UL)                    /*!< DCDC DCDC_STATUS_2_REG: DCDC_N_COMP (Bit 0)                 */
#define DCDC_DCDC_STATUS_2_REG_DCDC_N_COMP_Msk (0x1UL)                  /*!< DCDC DCDC_STATUS_2_REG: DCDC_N_COMP (Bitfield-Mask: 0x01)   */
#define DCDC_DCDC_STATUS_2_REG_DCDC_P_COMP_Pos (1UL)                    /*!< DCDC DCDC_STATUS_2_REG: DCDC_P_COMP (Bit 1)                 */
#define DCDC_DCDC_STATUS_2_REG_DCDC_P_COMP_Msk (0x2UL)                  /*!< DCDC DCDC_STATUS_2_REG: DCDC_P_COMP (Bitfield-Mask: 0x01)   */
#define DCDC_DCDC_STATUS_2_REG_DCDC_N_COMP_N_Pos (2UL)                  /*!< DCDC DCDC_STATUS_2_REG: DCDC_N_COMP_N (Bit 2)               */
#define DCDC_DCDC_STATUS_2_REG_DCDC_N_COMP_N_Msk (0x4UL)                /*!< DCDC DCDC_STATUS_2_REG: DCDC_N_COMP_N (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_N_COMP_P_Pos (3UL)                  /*!< DCDC DCDC_STATUS_2_REG: DCDC_N_COMP_P (Bit 3)               */
#define DCDC_DCDC_STATUS_2_REG_DCDC_N_COMP_P_Msk (0x8UL)                /*!< DCDC DCDC_STATUS_2_REG: DCDC_N_COMP_P (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_P_COMP_N_Pos (4UL)                  /*!< DCDC DCDC_STATUS_2_REG: DCDC_P_COMP_N (Bit 4)               */
#define DCDC_DCDC_STATUS_2_REG_DCDC_P_COMP_N_Msk (0x10UL)               /*!< DCDC DCDC_STATUS_2_REG: DCDC_P_COMP_N (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_P_COMP_P_Pos (5UL)                  /*!< DCDC DCDC_STATUS_2_REG: DCDC_P_COMP_P (Bit 5)               */
#define DCDC_DCDC_STATUS_2_REG_DCDC_P_COMP_P_Msk (0x20UL)               /*!< DCDC DCDC_STATUS_2_REG: DCDC_P_COMP_P (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_PSW_STATE_Pos (6UL)                 /*!< DCDC DCDC_STATUS_2_REG: DCDC_PSW_STATE (Bit 6)              */
#define DCDC_DCDC_STATUS_2_REG_DCDC_PSW_STATE_Msk (0x40UL)              /*!< DCDC DCDC_STATUS_2_REG: DCDC_PSW_STATE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_NSW_STATE_Pos (7UL)                 /*!< DCDC DCDC_STATUS_2_REG: DCDC_NSW_STATE (Bit 7)              */
#define DCDC_DCDC_STATUS_2_REG_DCDC_NSW_STATE_Msk (0x80UL)              /*!< DCDC DCDC_STATUS_2_REG: DCDC_NSW_STATE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_V14_SW_STATE_Pos (8UL)              /*!< DCDC DCDC_STATUS_2_REG: DCDC_V14_SW_STATE (Bit 8)           */
#define DCDC_DCDC_STATUS_2_REG_DCDC_V14_SW_STATE_Msk (0x100UL)          /*!< DCDC DCDC_STATUS_2_REG: DCDC_V14_SW_STATE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_V18_SW_STATE_Pos (9UL)              /*!< DCDC DCDC_STATUS_2_REG: DCDC_V18_SW_STATE (Bit 9)           */
#define DCDC_DCDC_STATUS_2_REG_DCDC_V18_SW_STATE_Msk (0x200UL)          /*!< DCDC DCDC_STATUS_2_REG: DCDC_V18_SW_STATE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_VDD_SW_STATE_Pos (10UL)             /*!< DCDC DCDC_STATUS_2_REG: DCDC_VDD_SW_STATE (Bit 10)          */
#define DCDC_DCDC_STATUS_2_REG_DCDC_VDD_SW_STATE_Msk (0x400UL)          /*!< DCDC DCDC_STATUS_2_REG: DCDC_VDD_SW_STATE (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_STATUS_2_REG_DCDC_V18P_SW_STATE_Pos (11UL)            /*!< DCDC DCDC_STATUS_2_REG: DCDC_V18P_SW_STATE (Bit 11)         */
#define DCDC_DCDC_STATUS_2_REG_DCDC_V18P_SW_STATE_Msk (0x800UL)         /*!< DCDC DCDC_STATUS_2_REG: DCDC_V18P_SW_STATE (Bitfield-Mask: 0x01) */

/* ---------------------------  DCDC_DCDC_STATUS_3_REG  --------------------------- */
#define DCDC_DCDC_STATUS_3_REG_DCDC_I_LIM_VDD_Pos (0UL)                 /*!< DCDC DCDC_STATUS_3_REG: DCDC_I_LIM_VDD (Bit 0)              */
#define DCDC_DCDC_STATUS_3_REG_DCDC_I_LIM_VDD_Msk (0x1fUL)              /*!< DCDC DCDC_STATUS_3_REG: DCDC_I_LIM_VDD (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_STATUS_3_REG_DCDC_I_LIM_V18P_Pos (5UL)                /*!< DCDC DCDC_STATUS_3_REG: DCDC_I_LIM_V18P (Bit 5)             */
#define DCDC_DCDC_STATUS_3_REG_DCDC_I_LIM_V18P_Msk (0x3e0UL)            /*!< DCDC DCDC_STATUS_3_REG: DCDC_I_LIM_V18P (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_STATUS_3_REG_DCDC_LV_MODE_Pos (10UL)                  /*!< DCDC DCDC_STATUS_3_REG: DCDC_LV_MODE (Bit 10)               */
#define DCDC_DCDC_STATUS_3_REG_DCDC_LV_MODE_Msk (0x400UL)               /*!< DCDC DCDC_STATUS_3_REG: DCDC_LV_MODE (Bitfield-Mask: 0x01)  */

/* ---------------------------  DCDC_DCDC_STATUS_4_REG  --------------------------- */
#define DCDC_DCDC_STATUS_4_REG_DCDC_I_LIM_V14_Pos (0UL)                 /*!< DCDC DCDC_STATUS_4_REG: DCDC_I_LIM_V14 (Bit 0)              */
#define DCDC_DCDC_STATUS_4_REG_DCDC_I_LIM_V14_Msk (0x1fUL)              /*!< DCDC DCDC_STATUS_4_REG: DCDC_I_LIM_V14 (Bitfield-Mask: 0x1f) */
#define DCDC_DCDC_STATUS_4_REG_DCDC_I_LIM_V18_Pos (5UL)                 /*!< DCDC DCDC_STATUS_4_REG: DCDC_I_LIM_V18 (Bit 5)              */
#define DCDC_DCDC_STATUS_4_REG_DCDC_I_LIM_V18_Msk (0x3e0UL)             /*!< DCDC DCDC_STATUS_4_REG: DCDC_I_LIM_V18 (Bitfield-Mask: 0x1f) */

/* ----------------------------  DCDC_DCDC_TRIM_0_REG  ---------------------------- */
#define DCDC_DCDC_TRIM_0_REG_DCDC_V14_TRIM_N_Pos (0UL)                  /*!< DCDC DCDC_TRIM_0_REG: DCDC_V14_TRIM_N (Bit 0)               */
#define DCDC_DCDC_TRIM_0_REG_DCDC_V14_TRIM_N_Msk (0x3fUL)               /*!< DCDC DCDC_TRIM_0_REG: DCDC_V14_TRIM_N (Bitfield-Mask: 0x3f) */
#define DCDC_DCDC_TRIM_0_REG_DCDC_V14_TRIM_P_Pos (6UL)                  /*!< DCDC DCDC_TRIM_0_REG: DCDC_V14_TRIM_P (Bit 6)               */
#define DCDC_DCDC_TRIM_0_REG_DCDC_V14_TRIM_P_Msk (0xfc0UL)              /*!< DCDC DCDC_TRIM_0_REG: DCDC_V14_TRIM_P (Bitfield-Mask: 0x3f) */

/* ----------------------------  DCDC_DCDC_TRIM_1_REG  ---------------------------- */
#define DCDC_DCDC_TRIM_1_REG_DCDC_V18_TRIM_N_Pos (0UL)                  /*!< DCDC DCDC_TRIM_1_REG: DCDC_V18_TRIM_N (Bit 0)               */
#define DCDC_DCDC_TRIM_1_REG_DCDC_V18_TRIM_N_Msk (0x3fUL)               /*!< DCDC DCDC_TRIM_1_REG: DCDC_V18_TRIM_N (Bitfield-Mask: 0x3f) */
#define DCDC_DCDC_TRIM_1_REG_DCDC_V18_TRIM_P_Pos (6UL)                  /*!< DCDC DCDC_TRIM_1_REG: DCDC_V18_TRIM_P (Bit 6)               */
#define DCDC_DCDC_TRIM_1_REG_DCDC_V18_TRIM_P_Msk (0xfc0UL)              /*!< DCDC DCDC_TRIM_1_REG: DCDC_V18_TRIM_P (Bitfield-Mask: 0x3f) */

/* ----------------------------  DCDC_DCDC_TRIM_2_REG  ---------------------------- */
#define DCDC_DCDC_TRIM_2_REG_DCDC_VDD_TRIM_N_Pos (0UL)                  /*!< DCDC DCDC_TRIM_2_REG: DCDC_VDD_TRIM_N (Bit 0)               */
#define DCDC_DCDC_TRIM_2_REG_DCDC_VDD_TRIM_N_Msk (0x3fUL)               /*!< DCDC DCDC_TRIM_2_REG: DCDC_VDD_TRIM_N (Bitfield-Mask: 0x3f) */
#define DCDC_DCDC_TRIM_2_REG_DCDC_VDD_TRIM_P_Pos (6UL)                  /*!< DCDC DCDC_TRIM_2_REG: DCDC_VDD_TRIM_P (Bit 6)               */
#define DCDC_DCDC_TRIM_2_REG_DCDC_VDD_TRIM_P_Msk (0xfc0UL)              /*!< DCDC DCDC_TRIM_2_REG: DCDC_VDD_TRIM_P (Bitfield-Mask: 0x3f) */

