wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* ----------------------------  DEM_RF_AGC_LUT_23_REG  --------------------------- */
#define DEM_RF_AGC_LUT_23_REG_VGA2_GAIN2_Pos  (0UL)                     /*!< DEM RF_AGC_LUT_23_REG: VGA2_GAIN2 (Bit 0)                   */
#define DEM_RF_AGC_LUT_23_REG_VGA2_GAIN2_Msk  (0x7UL)                   /*!< DEM RF_AGC_LUT_23_REG: VGA2_GAIN2 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_23_REG_VGA1_GAIN2_Pos  (3UL)                     /*!< DEM RF_AGC_LUT_23_REG: VGA1_GAIN2 (Bit 3)                   */
#define DEM_RF_AGC_LUT_23_REG_VGA1_GAIN2_Msk  (0x38UL)                  /*!< DEM RF_AGC_LUT_23_REG: VGA1_GAIN2 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_23_REG_LNA_GAIN2_Pos   (6UL)                     /*!< DEM RF_AGC_LUT_23_REG: LNA_GAIN2 (Bit 6)                    */
#define DEM_RF_AGC_LUT_23_REG_LNA_GAIN2_Msk   (0xc0UL)                  /*!< DEM RF_AGC_LUT_23_REG: LNA_GAIN2 (Bitfield-Mask: 0x03)      */
#define DEM_RF_AGC_LUT_23_REG_VGA2_GAIN3_Pos  (8UL)                     /*!< DEM RF_AGC_LUT_23_REG: VGA2_GAIN3 (Bit 8)                   */
#define DEM_RF_AGC_LUT_23_REG_VGA2_GAIN3_Msk  (0x700UL)                 /*!< DEM RF_AGC_LUT_23_REG: VGA2_GAIN3 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_23_REG_VGA1_GAIN3_Pos  (11UL)                    /*!< DEM RF_AGC_LUT_23_REG: VGA1_GAIN3 (Bit 11)                  */
#define DEM_RF_AGC_LUT_23_REG_VGA1_GAIN3_Msk  (0x3800UL)                /*!< DEM RF_AGC_LUT_23_REG: VGA1_GAIN3 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_23_REG_LNA_GAIN3_Pos   (14UL)                    /*!< DEM RF_AGC_LUT_23_REG: LNA_GAIN3 (Bit 14)                   */
#define DEM_RF_AGC_LUT_23_REG_LNA_GAIN3_Msk   (0xc000UL)                /*!< DEM RF_AGC_LUT_23_REG: LNA_GAIN3 (Bitfield-Mask: 0x03)      */

/* ----------------------------  DEM_RF_AGC_LUT_45_REG  --------------------------- */
#define DEM_RF_AGC_LUT_45_REG_VGA2_GAIN4_Pos  (0UL)                     /*!< DEM RF_AGC_LUT_45_REG: VGA2_GAIN4 (Bit 0)                   */
#define DEM_RF_AGC_LUT_45_REG_VGA2_GAIN4_Msk  (0x7UL)                   /*!< DEM RF_AGC_LUT_45_REG: VGA2_GAIN4 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_45_REG_VGA1_GAIN4_Pos  (3UL)                     /*!< DEM RF_AGC_LUT_45_REG: VGA1_GAIN4 (Bit 3)                   */
#define DEM_RF_AGC_LUT_45_REG_VGA1_GAIN4_Msk  (0x38UL)                  /*!< DEM RF_AGC_LUT_45_REG: VGA1_GAIN4 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_45_REG_LNA_GAIN4_Pos   (6UL)                     /*!< DEM RF_AGC_LUT_45_REG: LNA_GAIN4 (Bit 6)                    */
#define DEM_RF_AGC_LUT_45_REG_LNA_GAIN4_Msk   (0xc0UL)                  /*!< DEM RF_AGC_LUT_45_REG: LNA_GAIN4 (Bitfield-Mask: 0x03)      */
#define DEM_RF_AGC_LUT_45_REG_VGA2_GAIN5_Pos  (8UL)                     /*!< DEM RF_AGC_LUT_45_REG: VGA2_GAIN5 (Bit 8)                   */
#define DEM_RF_AGC_LUT_45_REG_VGA2_GAIN5_Msk  (0x700UL)                 /*!< DEM RF_AGC_LUT_45_REG: VGA2_GAIN5 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_45_REG_VGA1_GAIN5_Pos  (11UL)                    /*!< DEM RF_AGC_LUT_45_REG: VGA1_GAIN5 (Bit 11)                  */
#define DEM_RF_AGC_LUT_45_REG_VGA1_GAIN5_Msk  (0x3800UL)                /*!< DEM RF_AGC_LUT_45_REG: VGA1_GAIN5 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_45_REG_LNA_GAIN5_Pos   (14UL)                    /*!< DEM RF_AGC_LUT_45_REG: LNA_GAIN5 (Bit 14)                   */
#define DEM_RF_AGC_LUT_45_REG_LNA_GAIN5_Msk   (0xc000UL)                /*!< DEM RF_AGC_LUT_45_REG: LNA_GAIN5 (Bitfield-Mask: 0x03)      */

/* ----------------------------  DEM_RF_AGC_LUT_67_REG  --------------------------- */
#define DEM_RF_AGC_LUT_67_REG_VGA2_GAIN6_Pos  (0UL)                     /*!< DEM RF_AGC_LUT_67_REG: VGA2_GAIN6 (Bit 0)                   */
#define DEM_RF_AGC_LUT_67_REG_VGA2_GAIN6_Msk  (0x7UL)                   /*!< DEM RF_AGC_LUT_67_REG: VGA2_GAIN6 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_67_REG_VGA1_GAIN6_Pos  (3UL)                     /*!< DEM RF_AGC_LUT_67_REG: VGA1_GAIN6 (Bit 3)                   */
#define DEM_RF_AGC_LUT_67_REG_VGA1_GAIN6_Msk  (0x38UL)                  /*!< DEM RF_AGC_LUT_67_REG: VGA1_GAIN6 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_67_REG_LNA_GAIN6_Pos   (6UL)                     /*!< DEM RF_AGC_LUT_67_REG: LNA_GAIN6 (Bit 6)                    */
#define DEM_RF_AGC_LUT_67_REG_LNA_GAIN6_Msk   (0xc0UL)                  /*!< DEM RF_AGC_LUT_67_REG: LNA_GAIN6 (Bitfield-Mask: 0x03)      */
#define DEM_RF_AGC_LUT_67_REG_VGA2_GAIN7_Pos  (8UL)                     /*!< DEM RF_AGC_LUT_67_REG: VGA2_GAIN7 (Bit 8)                   */
#define DEM_RF_AGC_LUT_67_REG_VGA2_GAIN7_Msk  (0x700UL)                 /*!< DEM RF_AGC_LUT_67_REG: VGA2_GAIN7 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_67_REG_VGA1_GAIN7_Pos  (11UL)                    /*!< DEM RF_AGC_LUT_67_REG: VGA1_GAIN7 (Bit 11)                  */
#define DEM_RF_AGC_LUT_67_REG_VGA1_GAIN7_Msk  (0x3800UL)                /*!< DEM RF_AGC_LUT_67_REG: VGA1_GAIN7 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_67_REG_LNA_GAIN7_Pos   (14UL)                    /*!< DEM RF_AGC_LUT_67_REG: LNA_GAIN7 (Bit 14)                   */
#define DEM_RF_AGC_LUT_67_REG_LNA_GAIN7_Msk   (0xc000UL)                /*!< DEM RF_AGC_LUT_67_REG: LNA_GAIN7 (Bitfield-Mask: 0x03)      */

/* ----------------------------  DEM_RF_AGC_LUT_89_REG  --------------------------- */
#define DEM_RF_AGC_LUT_89_REG_VGA2_GAIN8_Pos  (0UL)                     /*!< DEM RF_AGC_LUT_89_REG: VGA2_GAIN8 (Bit 0)                   */
#define DEM_RF_AGC_LUT_89_REG_VGA2_GAIN8_Msk  (0x7UL)                   /*!< DEM RF_AGC_LUT_89_REG: VGA2_GAIN8 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_89_REG_VGA1_GAIN8_Pos  (3UL)                     /*!< DEM RF_AGC_LUT_89_REG: VGA1_GAIN8 (Bit 3)                   */
#define DEM_RF_AGC_LUT_89_REG_VGA1_GAIN8_Msk  (0x38UL)                  /*!< DEM RF_AGC_LUT_89_REG: VGA1_GAIN8 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_89_REG_LNA_GAIN8_Pos   (6UL)                     /*!< DEM RF_AGC_LUT_89_REG: LNA_GAIN8 (Bit 6)                    */
#define DEM_RF_AGC_LUT_89_REG_LNA_GAIN8_Msk   (0xc0UL)                  /*!< DEM RF_AGC_LUT_89_REG: LNA_GAIN8 (Bitfield-Mask: 0x03)      */
#define DEM_RF_AGC_LUT_89_REG_VGA2_GAIN9_Pos  (8UL)                     /*!< DEM RF_AGC_LUT_89_REG: VGA2_GAIN9 (Bit 8)                   */
#define DEM_RF_AGC_LUT_89_REG_VGA2_GAIN9_Msk  (0x700UL)                 /*!< DEM RF_AGC_LUT_89_REG: VGA2_GAIN9 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_89_REG_VGA1_GAIN9_Pos  (11UL)                    /*!< DEM RF_AGC_LUT_89_REG: VGA1_GAIN9 (Bit 11)                  */
#define DEM_RF_AGC_LUT_89_REG_VGA1_GAIN9_Msk  (0x3800UL)                /*!< DEM RF_AGC_LUT_89_REG: VGA1_GAIN9 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_89_REG_LNA_GAIN9_Pos   (14UL)                    /*!< DEM RF_AGC_LUT_89_REG: LNA_GAIN9 (Bit 14)                   */
#define DEM_RF_AGC_LUT_89_REG_LNA_GAIN9_Msk   (0xc000UL)                /*!< DEM RF_AGC_LUT_89_REG: LNA_GAIN9 (Bitfield-Mask: 0x03)      */

/* ----------------------------  DEM_RF_AGC_CTRL1_REG  ---------------------------- */
#define DEM_RF_AGC_CTRL1_REG_AGC_TH_LOW_Pos   (0UL)                     /*!< DEM RF_AGC_CTRL1_REG: AGC_TH_LOW (Bit 0)                    */
#define DEM_RF_AGC_CTRL1_REG_AGC_TH_LOW_Msk   (0x7fUL)                  /*!< DEM RF_AGC_CTRL1_REG: AGC_TH_LOW (Bitfield-Mask: 0x7f)      */
#define DEM_RF_AGC_CTRL1_REG_AGC_TH_HIGH_Pos  (7UL)                     /*!< DEM RF_AGC_CTRL1_REG: AGC_TH_HIGH (Bit 7)                   */
#define DEM_RF_AGC_CTRL1_REG_AGC_TH_HIGH_Msk  (0x3f80UL)                /*!< DEM RF_AGC_CTRL1_REG: AGC_TH_HIGH (Bitfield-Mask: 0x7f)     */
#define DEM_RF_AGC_CTRL1_REG_AGC_MODE_Pos     (14UL)                    /*!< DEM RF_AGC_CTRL1_REG: AGC_MODE (Bit 14)                     */
#define DEM_RF_AGC_CTRL1_REG_AGC_MODE_Msk     (0xc000UL)                /*!< DEM RF_AGC_CTRL1_REG: AGC_MODE (Bitfield-Mask: 0x03)        */

/* ----------------------------  DEM_RF_AGC_CTRL2_REG  ---------------------------- */
#define DEM_RF_AGC_CTRL2_REG_RSSI_TH_Pos      (0UL)                     /*!< DEM RF_AGC_CTRL2_REG: RSSI_TH (Bit 0)                       */
#define DEM_RF_AGC_CTRL2_REG_RSSI_TH_Msk      (0x3fUL)                  /*!< DEM RF_AGC_CTRL2_REG: RSSI_TH (Bitfield-Mask: 0x3f)         */
#define DEM_RF_AGC_CTRL2_REG_EN_FRZ_GAIN_Pos  (6UL)                     /*!< DEM RF_AGC_CTRL2_REG: EN_FRZ_GAIN (Bit 6)                   */
#define DEM_RF_AGC_CTRL2_REG_EN_FRZ_GAIN_Msk  (0x40UL)                  /*!< DEM RF_AGC_CTRL2_REG: EN_FRZ_GAIN (Bitfield-Mask: 0x01)     */
#define DEM_RF_AGC_CTRL2_REG_AGCSETTING_SEL_Pos (7UL)                   /*!< DEM RF_AGC_CTRL2_REG: AGCSETTING_SEL (Bit 7)                */
#define DEM_RF_AGC_CTRL2_REG_AGCSETTING_SEL_Msk (0x80UL)                /*!< DEM RF_AGC_CTRL2_REG: AGCSETTING_SEL (Bitfield-Mask: 0x01)  */
#define DEM_RF_AGC_CTRL2_REG_AGCSETTING_WR_Pos (8UL)                    /*!< DEM RF_AGC_CTRL2_REG: AGCSETTING_WR (Bit 8)                 */
#define DEM_RF_AGC_CTRL2_REG_AGCSETTING_WR_Msk (0xf00UL)                /*!< DEM RF_AGC_CTRL2_REG: AGCSETTING_WR (Bitfield-Mask: 0x0f)   */
#define DEM_RF_AGC_CTRL2_REG_SLOW_AGC_Pos     (12UL)                    /*!< DEM RF_AGC_CTRL2_REG: SLOW_AGC (Bit 12)                     */
#define DEM_RF_AGC_CTRL2_REG_SLOW_AGC_Msk     (0x1000UL)                /*!< DEM RF_AGC_CTRL2_REG: SLOW_AGC (Bitfield-Mask: 0x01)        */

