wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* -----------------------------  DEM_RF_AFC_CTRL_REG  ---------------------------- */
#define DEM_RF_AFC_CTRL_REG_AFC_MODE_Pos      (0UL)                     /*!< DEM RF_AFC_CTRL_REG: AFC_MODE (Bit 0)                       */
#define DEM_RF_AFC_CTRL_REG_AFC_MODE_Msk      (0xfUL)                   /*!< DEM RF_AFC_CTRL_REG: AFC_MODE (Bitfield-Mask: 0x0f)         */
#define DEM_RF_AFC_CTRL_REG_POLE1_Pos         (4UL)                     /*!< DEM RF_AFC_CTRL_REG: POLE1 (Bit 4)                          */
#define DEM_RF_AFC_CTRL_REG_POLE1_Msk         (0x30UL)                  /*!< DEM RF_AFC_CTRL_REG: POLE1 (Bitfield-Mask: 0x03)            */
#define DEM_RF_AFC_CTRL_REG_POLE2_Pos         (6UL)                     /*!< DEM RF_AFC_CTRL_REG: POLE2 (Bit 6)                          */
#define DEM_RF_AFC_CTRL_REG_POLE2_Msk         (0xc0UL)                  /*!< DEM RF_AFC_CTRL_REG: POLE2 (Bitfield-Mask: 0x03)            */

/* -------------------------  DEM_RF_DC_OFFSET_CTRL1_REG  ------------------------- */
#define DEM_RF_DC_OFFSET_CTRL1_REG_DCOFFSET_I_WR_Pos (0UL)              /*!< DEM RF_DC_OFFSET_CTRL1_REG: DCOFFSET_I_WR (Bit 0)           */
#define DEM_RF_DC_OFFSET_CTRL1_REG_DCOFFSET_I_WR_Msk (0xffUL)           /*!< DEM RF_DC_OFFSET_CTRL1_REG: DCOFFSET_I_WR (Bitfield-Mask: 0xff) */
#define DEM_RF_DC_OFFSET_CTRL1_REG_DCOFFSET_Q_WR_Pos (8UL)              /*!< DEM RF_DC_OFFSET_CTRL1_REG: DCOFFSET_Q_WR (Bit 8)           */
#define DEM_RF_DC_OFFSET_CTRL1_REG_DCOFFSET_Q_WR_Msk (0xff00UL)         /*!< DEM RF_DC_OFFSET_CTRL1_REG: DCOFFSET_Q_WR (Bitfield-Mask: 0xff) */

/* -------------------------  DEM_RF_DC_OFFSET_CTRL2_REG  ------------------------- */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCOFFSET_SEL_Pos (0UL)               /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCOFFSET_SEL (Bit 0)            */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCOFFSET_SEL_Msk (0x1UL)             /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCOFFSET_SEL (Bitfield-Mask: 0x01) */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCPARCAL_EN_Pos (1UL)                /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCPARCAL_EN (Bit 1)             */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCPARCAL_EN_Msk (0x2UL)              /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCPARCAL_EN (Bitfield-Mask: 0x01) */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCPOLE_Pos (2UL)                     /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCPOLE (Bit 2)                  */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCPOLE_Msk (0xcUL)                   /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCPOLE (Bitfield-Mask: 0x03)    */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCNSTEP_Pos (4UL)                    /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCNSTEP (Bit 4)                 */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCNSTEP_Msk (0x70UL)                 /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCNSTEP (Bitfield-Mask: 0x07)   */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCNGAIN_Pos (7UL)                    /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCNGAIN (Bit 7)                 */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCNGAIN_Msk (0x180UL)                /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCNGAIN (Bitfield-Mask: 0x03)   */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCPARCAL_INIT_Pos (9UL)              /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCPARCAL_INIT (Bit 9)           */
#define DEM_RF_DC_OFFSET_CTRL2_REG_DCPARCAL_INIT_Msk (0x200UL)          /*!< DEM RF_DC_OFFSET_CTRL2_REG: DCPARCAL_INIT (Bitfield-Mask: 0x01) */

/* -------------------------  DEM_RF_DC_OFFSET_CTRL3_REG  ------------------------- */
#define DEM_RF_DC_OFFSET_CTRL3_REG_DCBETA_I_Pos (0UL)                   /*!< DEM RF_DC_OFFSET_CTRL3_REG: DCBETA_I (Bit 0)                */
#define DEM_RF_DC_OFFSET_CTRL3_REG_DCBETA_I_Msk (0xffUL)                /*!< DEM RF_DC_OFFSET_CTRL3_REG: DCBETA_I (Bitfield-Mask: 0xff)  */
#define DEM_RF_DC_OFFSET_CTRL3_REG_DCBETA_Q_Pos (8UL)                   /*!< DEM RF_DC_OFFSET_CTRL3_REG: DCBETA_Q (Bit 8)                */
#define DEM_RF_DC_OFFSET_CTRL3_REG_DCBETA_Q_Msk (0xff00UL)              /*!< DEM RF_DC_OFFSET_CTRL3_REG: DCBETA_Q (Bitfield-Mask: 0xff)  */

/* -------------------------  DEM_RF_DC_OFFSET_CTRL4_REG  ------------------------- */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL0_Pos (0UL)         /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL0 (Bit 0)      */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL0_Msk (0xfUL)       /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL0 (Bitfield-Mask: 0x0f) */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL1_Pos (4UL)         /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL1 (Bit 4)      */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL1_Msk (0xf0UL)      /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL1 (Bitfield-Mask: 0x0f) */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL2_Pos (8UL)         /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL2 (Bit 8)      */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL2_Msk (0xf00UL)     /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL2 (Bitfield-Mask: 0x0f) */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL3_Pos (12UL)        /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL3 (Bit 12)     */
#define DEM_RF_DC_OFFSET_CTRL4_REG_DCAGCSETTING_FULL3_Msk (0xf000UL)    /*!< DEM RF_DC_OFFSET_CTRL4_REG: DCAGCSETTING_FULL3 (Bitfield-Mask: 0x0f) */

/* ----------------------------  DEM_RF_AGC_RESULT_REG  --------------------------- */
#define DEM_RF_AGC_RESULT_REG_AFC_RD_Pos      (0UL)                     /*!< DEM RF_AGC_RESULT_REG: AFC_RD (Bit 0)                       */
#define DEM_RF_AGC_RESULT_REG_AFC_RD_Msk      (0xffUL)                  /*!< DEM RF_AGC_RESULT_REG: AFC_RD (Bitfield-Mask: 0xff)         */
#define DEM_RF_AGC_RESULT_REG_AGCSETTING_RD_Pos (8UL)                   /*!< DEM RF_AGC_RESULT_REG: AGCSETTING_RD (Bit 8)                */
#define DEM_RF_AGC_RESULT_REG_AGCSETTING_RD_Msk (0xf00UL)               /*!< DEM RF_AGC_RESULT_REG: AGCSETTING_RD (Bitfield-Mask: 0x0f)  */

/* ---------------------------  DEM_RF_RSSI_RESULT_REG  --------------------------- */
#define DEM_RF_RSSI_RESULT_REG_RSSI_PH_RD_Pos (0UL)                     /*!< DEM RF_RSSI_RESULT_REG: RSSI_PH_RD (Bit 0)                  */
#define DEM_RF_RSSI_RESULT_REG_RSSI_PH_RD_Msk (0x3fUL)                  /*!< DEM RF_RSSI_RESULT_REG: RSSI_PH_RD (Bitfield-Mask: 0x3f)    */
#define DEM_RF_RSSI_RESULT_REG_RSSI_AVG_RD_Pos (6UL)                    /*!< DEM RF_RSSI_RESULT_REG: RSSI_AVG_RD (Bit 6)                 */
#define DEM_RF_RSSI_RESULT_REG_RSSI_AVG_RD_Msk (0xffc0UL)               /*!< DEM RF_RSSI_RESULT_REG: RSSI_AVG_RD (Bitfield-Mask: 0x3ff)  */

