wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* --------------------------  DEM_RF_FTDF_COBI_HIGH_REG  ------------------------- */
#define DEM_RF_FTDF_COBI_HIGH_REG_COBI_Pos    (0UL)                     /*!< DEM RF_FTDF_COBI_HIGH_REG: COBI (Bit 0)                     */
#define DEM_RF_FTDF_COBI_HIGH_REG_COBI_Msk    (0xffffUL)                /*!< DEM RF_FTDF_COBI_HIGH_REG: COBI (Bitfield-Mask: 0xffff)     */

/* ---------------------------  DEM_RF_DEM_TESTMODE_REG  -------------------------- */
#define DEM_RF_DEM_TESTMODE_REG_DEM_TESTMODE_Pos (0UL)                  /*!< DEM RF_DEM_TESTMODE_REG: DEM_TESTMODE (Bit 0)               */
#define DEM_RF_DEM_TESTMODE_REG_DEM_TESTMODE_Msk (0xffUL)               /*!< DEM RF_DEM_TESTMODE_REG: DEM_TESTMODE (Bitfield-Mask: 0xff) */

/* --------------------------  DEM_RF_DEM_IQCORRECT_REG  -------------------------- */
#define DEM_RF_DEM_IQCORRECT_REG_IQCORR_BETA_Pos (0UL)                  /*!< DEM RF_DEM_IQCORRECT_REG: IQCORR_BETA (Bit 0)               */
#define DEM_RF_DEM_IQCORRECT_REG_IQCORR_BETA_Msk (0xffUL)               /*!< DEM RF_DEM_IQCORRECT_REG: IQCORR_BETA (Bitfield-Mask: 0xff) */
#define DEM_RF_DEM_IQCORRECT_REG_IQCORR_ALPHA_Pos (8UL)                 /*!< DEM RF_DEM_IQCORRECT_REG: IQCORR_ALPHA (Bit 8)              */
#define DEM_RF_DEM_IQCORRECT_REG_IQCORR_ALPHA_Msk (0xff00UL)            /*!< DEM RF_DEM_IQCORRECT_REG: IQCORR_ALPHA (Bitfield-Mask: 0xff) */

/* ---------------------------  DEM_RF_PAD_CNT_CTRL_REG  -------------------------- */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_POS_LIMIT_Pos (0UL)                 /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_POS_LIMIT (Bit 0)              */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_POS_LIMIT_Msk (0x7fUL)              /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_POS_LIMIT (Bitfield-Mask: 0x7f) */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_NEG_LIMIT_Pos (7UL)                 /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_NEG_LIMIT (Bit 7)              */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_NEG_LIMIT_Msk (0x3f80UL)            /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_NEG_LIMIT (Bitfield-Mask: 0x7f) */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_CLEAR_COUNT_Pos (14UL)              /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_CLEAR_COUNT (Bit 14)           */
#define DEM_RF_PAD_CNT_CTRL_REG_PAD_CLEAR_COUNT_Msk (0x4000UL)          /*!< DEM RF_PAD_CNT_CTRL_REG: PAD_CLEAR_COUNT (Bitfield-Mask: 0x01) */

/* --------------------------  DEM_RF_PAD_CNT_RESULT_REG  ------------------------- */
#define DEM_RF_PAD_CNT_RESULT_REG_PAD_POS_CNT_RD_Pos (0UL)              /*!< DEM RF_PAD_CNT_RESULT_REG: PAD_POS_CNT_RD (Bit 0)           */
#define DEM_RF_PAD_CNT_RESULT_REG_PAD_POS_CNT_RD_Msk (0xffUL)           /*!< DEM RF_PAD_CNT_RESULT_REG: PAD_POS_CNT_RD (Bitfield-Mask: 0xff) */
#define DEM_RF_PAD_CNT_RESULT_REG_PAD_NEG_CNT_RD_Pos (8UL)              /*!< DEM RF_PAD_CNT_RESULT_REG: PAD_NEG_CNT_RD (Bit 8)           */
#define DEM_RF_PAD_CNT_RESULT_REG_PAD_NEG_CNT_RD_Msk (0xff00UL)         /*!< DEM RF_PAD_CNT_RESULT_REG: PAD_NEG_CNT_RD (Bitfield-Mask: 0xff) */

/* --------------------------  DEM_RF_FSSS_I_RESULT_REG  -------------------------- */
#define DEM_RF_FSSS_I_RESULT_REG_FSSS_I_RD_Pos (0UL)                    /*!< DEM RF_FSSS_I_RESULT_REG: FSSS_I_RD (Bit 0)                 */
#define DEM_RF_FSSS_I_RESULT_REG_FSSS_I_RD_Msk (0xffffUL)               /*!< DEM RF_FSSS_I_RESULT_REG: FSSS_I_RD (Bitfield-Mask: 0xffff) */

/* --------------------------  DEM_RF_FSSS_Q_RESULT_REG  -------------------------- */
#define DEM_RF_FSSS_Q_RESULT_REG_FSSS_Q_RD_Pos (0UL)                    /*!< DEM RF_FSSS_Q_RESULT_REG: FSSS_Q_RD (Bit 0)                 */
#define DEM_RF_FSSS_Q_RESULT_REG_FSSS_Q_RD_Msk (0xffffUL)               /*!< DEM RF_FSSS_Q_RESULT_REG: FSSS_Q_RD (Bitfield-Mask: 0xffff) */

/* -------------------------  DEM_RF_FSSS_MAG_RESULT_REG  ------------------------- */
#define DEM_RF_FSSS_MAG_RESULT_REG_FSSS_MAG_RD_Pos (0UL)                /*!< DEM RF_FSSS_MAG_RESULT_REG: FSSS_MAG_RD (Bit 0)             */
#define DEM_RF_FSSS_MAG_RESULT_REG_FSSS_MAG_RD_Msk (0xffffUL)           /*!< DEM RF_FSSS_MAG_RESULT_REG: FSSS_MAG_RD (Bitfield-Mask: 0xffff) */


/* ================================================================================ */
/* ================          struct 'DMA' Position & Mask          ================ */
/* ================================================================================ */


/* ----------------------------  DMA_DMA0_A_STARTL_REG  --------------------------- */
#define DMA_DMA0_A_STARTL_REG_DMA0_A_STARTL_Pos (0UL)                   /*!< DMA DMA0_A_STARTL_REG: DMA0_A_STARTL (Bit 0)                */
#define DMA_DMA0_A_STARTL_REG_DMA0_A_STARTL_Msk (0xffffUL)              /*!< DMA DMA0_A_STARTL_REG: DMA0_A_STARTL (Bitfield-Mask: 0xffff) */

/* ----------------------------  DMA_DMA0_A_STARTH_REG  --------------------------- */
#define DMA_DMA0_A_STARTH_REG_DMA0_A_STARTH_Pos (0UL)                   /*!< DMA DMA0_A_STARTH_REG: DMA0_A_STARTH (Bit 0)                */
#define DMA_DMA0_A_STARTH_REG_DMA0_A_STARTH_Msk (0xffffUL)              /*!< DMA DMA0_A_STARTH_REG: DMA0_A_STARTH (Bitfield-Mask: 0xffff) */

/* ----------------------------  DMA_DMA0_B_STARTL_REG  --------------------------- */
#define DMA_DMA0_B_STARTL_REG_DMA0_B_STARTL_Pos (0UL)                   /*!< DMA DMA0_B_STARTL_REG: DMA0_B_STARTL (Bit 0)                */
#define DMA_DMA0_B_STARTL_REG_DMA0_B_STARTL_Msk (0xffffUL)              /*!< DMA DMA0_B_STARTL_REG: DMA0_B_STARTL (Bitfield-Mask: 0xffff) */

/* ----------------------------  DMA_DMA0_B_STARTH_REG  --------------------------- */
#define DMA_DMA0_B_STARTH_REG_DMA0_B_STARTH_Pos (0UL)                   /*!< DMA DMA0_B_STARTH_REG: DMA0_B_STARTH (Bit 0)                */
#define DMA_DMA0_B_STARTH_REG_DMA0_B_STARTH_Msk (0xffffUL)              /*!< DMA DMA0_B_STARTH_REG: DMA0_B_STARTH (Bitfield-Mask: 0xffff) */

/* ------------------------------  DMA_DMA0_INT_REG  ------------------------------ */
#define DMA_DMA0_INT_REG_DMA0_INT_Pos         (0UL)                     /*!< DMA DMA0_INT_REG: DMA0_INT (Bit 0)                          */
#define DMA_DMA0_INT_REG_DMA0_INT_Msk         (0xffffUL)                /*!< DMA DMA0_INT_REG: DMA0_INT (Bitfield-Mask: 0xffff)          */

/* ------------------------------  DMA_DMA0_LEN_REG  ------------------------------ */
#define DMA_DMA0_LEN_REG_DMA0_LEN_Pos         (0UL)                     /*!< DMA DMA0_LEN_REG: DMA0_LEN (Bit 0)                          */
#define DMA_DMA0_LEN_REG_DMA0_LEN_Msk         (0xffffUL)                /*!< DMA DMA0_LEN_REG: DMA0_LEN (Bitfield-Mask: 0xffff)          */

/* ------------------------------  DMA_DMA0_CTRL_REG  ----------------------------- */
#define DMA_DMA0_CTRL_REG_DMA_ON_Pos          (0UL)                     /*!< DMA DMA0_CTRL_REG: DMA_ON (Bit 0)                           */
#define DMA_DMA0_CTRL_REG_DMA_ON_Msk          (0x1UL)                   /*!< DMA DMA0_CTRL_REG: DMA_ON (Bitfield-Mask: 0x01)             */
#define DMA_DMA0_CTRL_REG_BW_Pos              (1UL)                     /*!< DMA DMA0_CTRL_REG: BW (Bit 1)                               */
#define DMA_DMA0_CTRL_REG_BW_Msk              (0x6UL)                   /*!< DMA DMA0_CTRL_REG: BW (Bitfield-Mask: 0x03)                 */
#define DMA_DMA0_CTRL_REG_IRQ_ENABLE_Pos      (3UL)                     /*!< DMA DMA0_CTRL_REG: IRQ_ENABLE (Bit 3)                       */
#define DMA_DMA0_CTRL_REG_IRQ_ENABLE_Msk      (0x8UL)                   /*!< DMA DMA0_CTRL_REG: IRQ_ENABLE (Bitfield-Mask: 0x01)         */
#define DMA_DMA0_CTRL_REG_DREQ_MODE_Pos       (4UL)                     /*!< DMA DMA0_CTRL_REG: DREQ_MODE (Bit 4)                        */
#define DMA_DMA0_CTRL_REG_DREQ_MODE_Msk       (0x10UL)                  /*!< DMA DMA0_CTRL_REG: DREQ_MODE (Bitfield-Mask: 0x01)          */
#define DMA_DMA0_CTRL_REG_BINC_Pos            (5UL)                     /*!< DMA DMA0_CTRL_REG: BINC (Bit 5)                             */
#define DMA_DMA0_CTRL_REG_BINC_Msk            (0x20UL)                  /*!< DMA DMA0_CTRL_REG: BINC (Bitfield-Mask: 0x01)               */
#define DMA_DMA0_CTRL_REG_AINC_Pos            (6UL)                     /*!< DMA DMA0_CTRL_REG: AINC (Bit 6)                             */
#define DMA_DMA0_CTRL_REG_AINC_Msk            (0x40UL)                  /*!< DMA DMA0_CTRL_REG: AINC (Bitfield-Mask: 0x01)               */
#define DMA_DMA0_CTRL_REG_CIRCULAR_Pos        (7UL)                     /*!< DMA DMA0_CTRL_REG: CIRCULAR (Bit 7)                         */
#define DMA_DMA0_CTRL_REG_CIRCULAR_Msk        (0x80UL)                  /*!< DMA DMA0_CTRL_REG: CIRCULAR (Bitfield-Mask: 0x01)           */
#define DMA_DMA0_CTRL_REG_DMA_PRIO_Pos        (8UL)                     /*!< DMA DMA0_CTRL_REG: DMA_PRIO (Bit 8)                         */
#define DMA_DMA0_CTRL_REG_DMA_PRIO_Msk        (0x700UL)                 /*!< DMA DMA0_CTRL_REG: DMA_PRIO (Bitfield-Mask: 0x07)           */
#define DMA_DMA0_CTRL_REG_DMA_IDLE_Pos        (11UL)                    /*!< DMA DMA0_CTRL_REG: DMA_IDLE (Bit 11)                        */
#define DMA_DMA0_CTRL_REG_DMA_IDLE_Msk        (0x800UL)                 /*!< DMA DMA0_CTRL_REG: DMA_IDLE (Bitfield-Mask: 0x01)           */
#define DMA_DMA0_CTRL_REG_DMA_INIT_Pos        (12UL)                    /*!< DMA DMA0_CTRL_REG: DMA_INIT (Bit 12)                        */
#define DMA_DMA0_CTRL_REG_DMA_INIT_Msk        (0x1000UL)                /*!< DMA DMA0_CTRL_REG: DMA_INIT (Bitfield-Mask: 0x01)           */

/* ------------------------------  DMA_DMA0_IDX_REG  ------------------------------ */
#define DMA_DMA0_IDX_REG_DMA0_IDX_Pos         (0UL)                     /*!< DMA DMA0_IDX_REG: DMA0_IDX (Bit 0)                          */
#define DMA_DMA0_IDX_REG_DMA0_IDX_Msk         (0xffffUL)                /*!< DMA DMA0_IDX_REG: DMA0_IDX (Bitfield-Mask: 0xffff)          */

/* ----------------------------  DMA_DMA1_A_STARTL_REG  --------------------------- */
#define DMA_DMA1_A_STARTL_REG_DMA1_A_STARTL_Pos (0UL)                   /*!< DMA DMA1_A_STARTL_REG: DMA1_A_STARTL (Bit 0)                */
#define DMA_DMA1_A_STARTL_REG_DMA1_A_STARTL_Msk (0xffffUL)              /*!< DMA DMA1_A_STARTL_REG: DMA1_A_STARTL (Bitfield-Mask: 0xffff) */

/* ----------------------------  DMA_DMA1_A_STARTH_REG  --------------------------- */
#define DMA_DMA1_A_STARTH_REG_DMA1_A_STARTH_Pos (0UL)                   /*!< DMA DMA1_A_STARTH_REG: DMA1_A_STARTH (Bit 0)                */
#define DMA_DMA1_A_STARTH_REG_DMA1_A_STARTH_Msk (0xffffUL)              /*!< DMA DMA1_A_STARTH_REG: DMA1_A_STARTH (Bitfield-Mask: 0xffff) */

