wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* ------------------------------  GPIO_P01_MODE_REG  ----------------------------- */
#define GPIO_P01_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P01_MODE_REG: PID (Bit 0)                              */
#define GPIO_P01_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P01_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P01_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P01_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P01_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P01_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P01_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P01_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P01_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P01_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P02_MODE_REG  ----------------------------- */
#define GPIO_P02_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P02_MODE_REG: PID (Bit 0)                              */
#define GPIO_P02_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P02_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P02_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P02_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P02_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P02_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P02_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P02_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P02_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P02_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P03_MODE_REG  ----------------------------- */
#define GPIO_P03_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P03_MODE_REG: PID (Bit 0)                              */
#define GPIO_P03_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P03_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P03_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P03_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P03_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P03_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P03_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P03_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P03_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P03_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P04_MODE_REG  ----------------------------- */
#define GPIO_P04_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P04_MODE_REG: PID (Bit 0)                              */
#define GPIO_P04_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P04_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P04_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P04_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P04_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P04_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P04_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P04_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P04_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P04_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P05_MODE_REG  ----------------------------- */
#define GPIO_P05_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P05_MODE_REG: PID (Bit 0)                              */
#define GPIO_P05_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P05_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P05_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P05_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P05_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P05_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P05_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P05_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P05_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P05_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P06_MODE_REG  ----------------------------- */
#define GPIO_P06_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P06_MODE_REG: PID (Bit 0)                              */
#define GPIO_P06_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P06_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P06_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P06_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P06_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P06_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P06_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P06_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P06_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P06_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P07_MODE_REG  ----------------------------- */
#define GPIO_P07_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P07_MODE_REG: PID (Bit 0)                              */
#define GPIO_P07_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P07_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P07_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P07_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P07_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P07_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P07_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P07_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P07_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P07_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P10_MODE_REG  ----------------------------- */
#define GPIO_P10_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P10_MODE_REG: PID (Bit 0)                              */
#define GPIO_P10_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P10_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P10_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P10_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P10_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P10_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P10_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P10_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P10_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P10_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

