wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* ------------------------------  GPIO_P45_MODE_REG  ----------------------------- */
#define GPIO_P45_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P45_MODE_REG: PID (Bit 0)                              */
#define GPIO_P45_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P45_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P45_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P45_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P45_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P45_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P45_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P45_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P45_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P45_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P46_MODE_REG  ----------------------------- */
#define GPIO_P46_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P46_MODE_REG: PID (Bit 0)                              */
#define GPIO_P46_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P46_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P46_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P46_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P46_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P46_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P46_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P46_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P46_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P46_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ------------------------------  GPIO_P47_MODE_REG  ----------------------------- */
#define GPIO_P47_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P47_MODE_REG: PID (Bit 0)                              */
#define GPIO_P47_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P47_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P47_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P47_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P47_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P47_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P47_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P47_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P47_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P47_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

/* ---------------------------  GPIO_P0_PADPWR_CTRL_REG  -------------------------- */
#define GPIO_P0_PADPWR_CTRL_REG_P0_OUT_CTRL_Pos (6UL)                   /*!< GPIO P0_PADPWR_CTRL_REG: P0_OUT_CTRL (Bit 6)                */
#define GPIO_P0_PADPWR_CTRL_REG_P0_OUT_CTRL_Msk (0xc0UL)                /*!< GPIO P0_PADPWR_CTRL_REG: P0_OUT_CTRL (Bitfield-Mask: 0x03)  */

/* ---------------------------  GPIO_P1_PADPWR_CTRL_REG  -------------------------- */
#define GPIO_P1_PADPWR_CTRL_REG_P1_OUT_CTRL_Pos (0UL)                   /*!< GPIO P1_PADPWR_CTRL_REG: P1_OUT_CTRL (Bit 0)                */
#define GPIO_P1_PADPWR_CTRL_REG_P1_OUT_CTRL_Msk (0xffUL)                /*!< GPIO P1_PADPWR_CTRL_REG: P1_OUT_CTRL (Bitfield-Mask: 0xff)  */

/* ---------------------------  GPIO_P2_PADPWR_CTRL_REG  -------------------------- */
#define GPIO_P2_PADPWR_CTRL_REG_P2_OUT_CTRL_Pos (0UL)                   /*!< GPIO P2_PADPWR_CTRL_REG: P2_OUT_CTRL (Bit 0)                */
#define GPIO_P2_PADPWR_CTRL_REG_P2_OUT_CTRL_Msk (0x1fUL)                /*!< GPIO P2_PADPWR_CTRL_REG: P2_OUT_CTRL (Bitfield-Mask: 0x1f)  */

/* ---------------------------  GPIO_P3_PADPWR_CTRL_REG  -------------------------- */
#define GPIO_P3_PADPWR_CTRL_REG_P3_OUT_CTRL_Pos (0UL)                   /*!< GPIO P3_PADPWR_CTRL_REG: P3_OUT_CTRL (Bit 0)                */
#define GPIO_P3_PADPWR_CTRL_REG_P3_OUT_CTRL_Msk (0xffUL)                /*!< GPIO P3_PADPWR_CTRL_REG: P3_OUT_CTRL (Bitfield-Mask: 0xff)  */

/* ---------------------------  GPIO_P4_PADPWR_CTRL_REG  -------------------------- */
#define GPIO_P4_PADPWR_CTRL_REG_P4_OUT_CTRL_Pos (0UL)                   /*!< GPIO P4_PADPWR_CTRL_REG: P4_OUT_CTRL (Bit 0)                */
#define GPIO_P4_PADPWR_CTRL_REG_P4_OUT_CTRL_Msk (0xffUL)                /*!< GPIO P4_PADPWR_CTRL_REG: P4_OUT_CTRL (Bitfield-Mask: 0xff)  */

/* ------------------------------  GPIO_GPIO_CLK_SEL  ----------------------------- */
#define GPIO_GPIO_CLK_SEL_FUNC_CLOCK_SEL_Pos  (0UL)                     /*!< GPIO GPIO_CLK_SEL: FUNC_CLOCK_SEL (Bit 0)                   */
#define GPIO_GPIO_CLK_SEL_FUNC_CLOCK_SEL_Msk  (0x7UL)                   /*!< GPIO GPIO_CLK_SEL: FUNC_CLOCK_SEL (Bitfield-Mask: 0x07)     */

/* -----------------------------  GPIO_BIST_CTRL_REG  ----------------------------- */
#define GPIO_BIST_CTRL_REG_RAM_BIST_CONFIG_Pos (0UL)                    /*!< GPIO BIST_CTRL_REG: RAM_BIST_CONFIG (Bit 0)                 */
#define GPIO_BIST_CTRL_REG_RAM_BIST_CONFIG_Msk (0x3UL)                  /*!< GPIO BIST_CTRL_REG: RAM_BIST_CONFIG (Bitfield-Mask: 0x03)   */
#define GPIO_BIST_CTRL_REG_RAM_BIST_PATTERN_Pos (2UL)                   /*!< GPIO BIST_CTRL_REG: RAM_BIST_PATTERN (Bit 2)                */
#define GPIO_BIST_CTRL_REG_RAM_BIST_PATTERN_Msk (0xcUL)                 /*!< GPIO BIST_CTRL_REG: RAM_BIST_PATTERN (Bitfield-Mask: 0x03)  */
#define GPIO_BIST_CTRL_REG_ROMBIST_ENABLE_Pos (4UL)                     /*!< GPIO BIST_CTRL_REG: ROMBIST_ENABLE (Bit 4)                  */
#define GPIO_BIST_CTRL_REG_ROMBIST_ENABLE_Msk (0x10UL)                  /*!< GPIO BIST_CTRL_REG: ROMBIST_ENABLE (Bitfield-Mask: 0x01)    */
#define GPIO_BIST_CTRL_REG_RAMBIST_ENABLE_Pos (5UL)                     /*!< GPIO BIST_CTRL_REG: RAMBIST_ENABLE (Bit 5)                  */
#define GPIO_BIST_CTRL_REG_RAMBIST_ENABLE_Msk (0x20UL)                  /*!< GPIO BIST_CTRL_REG: RAMBIST_ENABLE (Bitfield-Mask: 0x01)    */
#define GPIO_BIST_CTRL_REG_SYSRAMBIST_ENABLE_Pos (6UL)                  /*!< GPIO BIST_CTRL_REG: SYSRAMBIST_ENABLE (Bit 6)               */
#define GPIO_BIST_CTRL_REG_SYSRAMBIST_ENABLE_Msk (0x40UL)               /*!< GPIO BIST_CTRL_REG: SYSRAMBIST_ENABLE (Bitfield-Mask: 0x01) */
#define GPIO_BIST_CTRL_REG_SHOW_BIST_Pos      (7UL)                     /*!< GPIO BIST_CTRL_REG: SHOW_BIST (Bit 7)                       */
#define GPIO_BIST_CTRL_REG_SHOW_BIST_Msk      (0x80UL)                  /*!< GPIO BIST_CTRL_REG: SHOW_BIST (Bitfield-Mask: 0x01)         */

/* --------------------------  GPIO_RAMBIST_STATUS1_REG  -------------------------- */
#define GPIO_RAMBIST_STATUS1_REG_SYSRAM_BIST_LINE_FAIL_Pos (0UL)        /*!< GPIO RAMBIST_STATUS1_REG: SYSRAM_BIST_LINE_FAIL (Bit 0)     */
#define GPIO_RAMBIST_STATUS1_REG_SYSRAM_BIST_LINE_FAIL_Msk (0x1UL)      /*!< GPIO RAMBIST_STATUS1_REG: SYSRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_SYSRAM_BIST_FAIL_Pos (1UL)             /*!< GPIO RAMBIST_STATUS1_REG: SYSRAM_BIST_FAIL (Bit 1)          */
#define GPIO_RAMBIST_STATUS1_REG_SYSRAM_BIST_FAIL_Msk (0x2UL)           /*!< GPIO RAMBIST_STATUS1_REG: SYSRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_SYSRAM_BIST_BUSY_Pos (2UL)             /*!< GPIO RAMBIST_STATUS1_REG: SYSRAM_BIST_BUSY (Bit 2)          */
#define GPIO_RAMBIST_STATUS1_REG_SYSRAM_BIST_BUSY_Msk (0x4UL)           /*!< GPIO RAMBIST_STATUS1_REG: SYSRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_CTRAM_BIST_LINE_FAIL_Pos (3UL)         /*!< GPIO RAMBIST_STATUS1_REG: CTRAM_BIST_LINE_FAIL (Bit 3)      */
#define GPIO_RAMBIST_STATUS1_REG_CTRAM_BIST_LINE_FAIL_Msk (0x8UL)       /*!< GPIO RAMBIST_STATUS1_REG: CTRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_CTRAM_BIST_FAIL_Pos (4UL)              /*!< GPIO RAMBIST_STATUS1_REG: CTRAM_BIST_FAIL (Bit 4)           */
#define GPIO_RAMBIST_STATUS1_REG_CTRAM_BIST_FAIL_Msk (0x10UL)           /*!< GPIO RAMBIST_STATUS1_REG: CTRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_CTRAM_BIST_BUSY_Pos (5UL)              /*!< GPIO RAMBIST_STATUS1_REG: CTRAM_BIST_BUSY (Bit 5)           */
#define GPIO_RAMBIST_STATUS1_REG_CTRAM_BIST_BUSY_Msk (0x20UL)           /*!< GPIO RAMBIST_STATUS1_REG: CTRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_CDRAM_BIST_LINE_FAIL_Pos (6UL)         /*!< GPIO RAMBIST_STATUS1_REG: CDRAM_BIST_LINE_FAIL (Bit 6)      */
#define GPIO_RAMBIST_STATUS1_REG_CDRAM_BIST_LINE_FAIL_Msk (0x40UL)      /*!< GPIO RAMBIST_STATUS1_REG: CDRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_CDRAM_BIST_FAIL_Pos (7UL)              /*!< GPIO RAMBIST_STATUS1_REG: CDRAM_BIST_FAIL (Bit 7)           */
#define GPIO_RAMBIST_STATUS1_REG_CDRAM_BIST_FAIL_Msk (0x80UL)           /*!< GPIO RAMBIST_STATUS1_REG: CDRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_CDRAM_BIST_BUSY_Pos (8UL)              /*!< GPIO RAMBIST_STATUS1_REG: CDRAM_BIST_BUSY (Bit 8)           */
#define GPIO_RAMBIST_STATUS1_REG_CDRAM_BIST_BUSY_Msk (0x100UL)          /*!< GPIO RAMBIST_STATUS1_REG: CDRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_USBRAM_BIST_LINE_FAIL_Pos (9UL)        /*!< GPIO RAMBIST_STATUS1_REG: USBRAM_BIST_LINE_FAIL (Bit 9)     */
#define GPIO_RAMBIST_STATUS1_REG_USBRAM_BIST_LINE_FAIL_Msk (0x200UL)    /*!< GPIO RAMBIST_STATUS1_REG: USBRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_USBRAM_BIST_FAIL_Pos (10UL)            /*!< GPIO RAMBIST_STATUS1_REG: USBRAM_BIST_FAIL (Bit 10)         */
#define GPIO_RAMBIST_STATUS1_REG_USBRAM_BIST_FAIL_Msk (0x400UL)         /*!< GPIO RAMBIST_STATUS1_REG: USBRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_USBRAM_BIST_BUSY_Pos (11UL)            /*!< GPIO RAMBIST_STATUS1_REG: USBRAM_BIST_BUSY (Bit 11)         */
#define GPIO_RAMBIST_STATUS1_REG_USBRAM_BIST_BUSY_Msk (0x800UL)         /*!< GPIO RAMBIST_STATUS1_REG: USBRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_QSPIRAM_BIST_LINE_FAIL_Pos (12UL)      /*!< GPIO RAMBIST_STATUS1_REG: QSPIRAM_BIST_LINE_FAIL (Bit 12)   */
#define GPIO_RAMBIST_STATUS1_REG_QSPIRAM_BIST_LINE_FAIL_Msk (0x1000UL)  /*!< GPIO RAMBIST_STATUS1_REG: QSPIRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_QSPIRAM_BIST_FAIL_Pos (13UL)           /*!< GPIO RAMBIST_STATUS1_REG: QSPIRAM_BIST_FAIL (Bit 13)        */
#define GPIO_RAMBIST_STATUS1_REG_QSPIRAM_BIST_FAIL_Msk (0x2000UL)       /*!< GPIO RAMBIST_STATUS1_REG: QSPIRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_QSPIRAM_BIST_BUSY_Pos (14UL)           /*!< GPIO RAMBIST_STATUS1_REG: QSPIRAM_BIST_BUSY (Bit 14)        */
#define GPIO_RAMBIST_STATUS1_REG_QSPIRAM_BIST_BUSY_Msk (0x4000UL)       /*!< GPIO RAMBIST_STATUS1_REG: QSPIRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS1_REG_ROM_BIST_BUSY_Pos (15UL)               /*!< GPIO RAMBIST_STATUS1_REG: ROM_BIST_BUSY (Bit 15)            */
#define GPIO_RAMBIST_STATUS1_REG_ROM_BIST_BUSY_Msk (0x8000UL)           /*!< GPIO RAMBIST_STATUS1_REG: ROM_BIST_BUSY (Bitfield-Mask: 0x01) */

/* --------------------------  GPIO_RAMBIST_STATUS2_REG  -------------------------- */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_TXRAM_BIST_LINE_FAIL_Pos (0UL)    /*!< GPIO RAMBIST_STATUS2_REG: FTDF_TXRAM_BIST_LINE_FAIL (Bit 0) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_TXRAM_BIST_LINE_FAIL_Msk (0x1UL)  /*!< GPIO RAMBIST_STATUS2_REG: FTDF_TXRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_TXRAM_BIST_FAIL_Pos (1UL)         /*!< GPIO RAMBIST_STATUS2_REG: FTDF_TXRAM_BIST_FAIL (Bit 1)      */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_TXRAM_BIST_FAIL_Msk (0x2UL)       /*!< GPIO RAMBIST_STATUS2_REG: FTDF_TXRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_TXRAM_BIST_BUSY_Pos (2UL)         /*!< GPIO RAMBIST_STATUS2_REG: FTDF_TXRAM_BIST_BUSY (Bit 2)      */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_TXRAM_BIST_BUSY_Msk (0x4UL)       /*!< GPIO RAMBIST_STATUS2_REG: FTDF_TXRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_RXRAM_BIST_LINE_FAIL_Pos (3UL)    /*!< GPIO RAMBIST_STATUS2_REG: FTDF_RXRAM_BIST_LINE_FAIL (Bit 3) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_RXRAM_BIST_LINE_FAIL_Msk (0x8UL)  /*!< GPIO RAMBIST_STATUS2_REG: FTDF_RXRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_RXRAM_BIST_FAIL_Pos (4UL)         /*!< GPIO RAMBIST_STATUS2_REG: FTDF_RXRAM_BIST_FAIL (Bit 4)      */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_RXRAM_BIST_FAIL_Msk (0x10UL)      /*!< GPIO RAMBIST_STATUS2_REG: FTDF_RXRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_RXRAM_BIST_BUSY_Pos (5UL)         /*!< GPIO RAMBIST_STATUS2_REG: FTDF_RXRAM_BIST_BUSY (Bit 5)      */
#define GPIO_RAMBIST_STATUS2_REG_FTDF_RXRAM_BIST_BUSY_Msk (0x20UL)      /*!< GPIO RAMBIST_STATUS2_REG: FTDF_RXRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_CODERAM_BIST_LINE_FAIL_Pos (6UL)   /*!< GPIO RAMBIST_STATUS2_REG: ECC_CODERAM_BIST_LINE_FAIL (Bit 6) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_CODERAM_BIST_LINE_FAIL_Msk (0x40UL) /*!< GPIO RAMBIST_STATUS2_REG: ECC_CODERAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_CODERAM_BIST_FAIL_Pos (7UL)        /*!< GPIO RAMBIST_STATUS2_REG: ECC_CODERAM_BIST_FAIL (Bit 7)     */
#define GPIO_RAMBIST_STATUS2_REG_ECC_CODERAM_BIST_FAIL_Msk (0x80UL)     /*!< GPIO RAMBIST_STATUS2_REG: ECC_CODERAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_CODERAM_BIST_BUSY_Pos (8UL)        /*!< GPIO RAMBIST_STATUS2_REG: ECC_CODERAM_BIST_BUSY (Bit 8)     */
#define GPIO_RAMBIST_STATUS2_REG_ECC_CODERAM_BIST_BUSY_Msk (0x100UL)    /*!< GPIO RAMBIST_STATUS2_REG: ECC_CODERAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_TCMRAM_BIST_LINE_FAIL_Pos (9UL)    /*!< GPIO RAMBIST_STATUS2_REG: ECC_TCMRAM_BIST_LINE_FAIL (Bit 9) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_TCMRAM_BIST_LINE_FAIL_Msk (0x200UL) /*!< GPIO RAMBIST_STATUS2_REG: ECC_TCMRAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_TCMRAM_BIST_FAIL_Pos (10UL)        /*!< GPIO RAMBIST_STATUS2_REG: ECC_TCMRAM_BIST_FAIL (Bit 10)     */
#define GPIO_RAMBIST_STATUS2_REG_ECC_TCMRAM_BIST_FAIL_Msk (0x400UL)     /*!< GPIO RAMBIST_STATUS2_REG: ECC_TCMRAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_ECC_TCMRAM_BIST_BUSY_Pos (11UL)        /*!< GPIO RAMBIST_STATUS2_REG: ECC_TCMRAM_BIST_BUSY (Bit 11)     */
#define GPIO_RAMBIST_STATUS2_REG_ECC_TCMRAM_BIST_BUSY_Msk (0x800UL)     /*!< GPIO RAMBIST_STATUS2_REG: ECC_TCMRAM_BIST_BUSY (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_CRYPTORAM_BIST_LINE_FAIL_Pos (12UL)    /*!< GPIO RAMBIST_STATUS2_REG: CRYPTORAM_BIST_LINE_FAIL (Bit 12) */
#define GPIO_RAMBIST_STATUS2_REG_CRYPTORAM_BIST_LINE_FAIL_Msk (0x1000UL) /*!< GPIO RAMBIST_STATUS2_REG: CRYPTORAM_BIST_LINE_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_CRYPTORAM_BIST_FAIL_Pos (13UL)         /*!< GPIO RAMBIST_STATUS2_REG: CRYPTORAM_BIST_FAIL (Bit 13)      */
#define GPIO_RAMBIST_STATUS2_REG_CRYPTORAM_BIST_FAIL_Msk (0x2000UL)     /*!< GPIO RAMBIST_STATUS2_REG: CRYPTORAM_BIST_FAIL (Bitfield-Mask: 0x01) */
#define GPIO_RAMBIST_STATUS2_REG_CRYPTORAM_BIST_BUSY_Pos (14UL)         /*!< GPIO RAMBIST_STATUS2_REG: CRYPTORAM_BIST_BUSY (Bit 14)      */
#define GPIO_RAMBIST_STATUS2_REG_CRYPTORAM_BIST_BUSY_Msk (0x4000UL)     /*!< GPIO RAMBIST_STATUS2_REG: CRYPTORAM_BIST_BUSY (Bitfield-Mask: 0x01) */

/* --------------------------  GPIO_ROMBIST_RESULTL_REG  -------------------------- */
#define GPIO_ROMBIST_RESULTL_REG_ROMBIST_RESULTL_Pos (0UL)              /*!< GPIO ROMBIST_RESULTL_REG: ROMBIST_RESULTL (Bit 0)           */
#define GPIO_ROMBIST_RESULTL_REG_ROMBIST_RESULTL_Msk (0xffffUL)         /*!< GPIO ROMBIST_RESULTL_REG: ROMBIST_RESULTL (Bitfield-Mask: 0xffff) */

/* --------------------------  GPIO_ROMBIST_RESULTH_REG  -------------------------- */
#define GPIO_ROMBIST_RESULTH_REG_ROMBIST_RESULTH_Pos (0UL)              /*!< GPIO ROMBIST_RESULTH_REG: ROMBIST_RESULTH (Bit 0)           */
#define GPIO_ROMBIST_RESULTH_REG_ROMBIST_RESULTH_Msk (0xffffUL)         /*!< GPIO ROMBIST_RESULTH_REG: ROMBIST_RESULTH (Bitfield-Mask: 0xffff) */

/* -----------------------------  GPIO_TEST_CTRL_REG  ----------------------------- */
#define GPIO_TEST_CTRL_REG_SHOW_CLOCKS_Pos    (0UL)                     /*!< GPIO TEST_CTRL_REG: SHOW_CLOCKS (Bit 0)                     */
#define GPIO_TEST_CTRL_REG_SHOW_CLOCKS_Msk    (0x1UL)                   /*!< GPIO TEST_CTRL_REG: SHOW_CLOCKS (Bitfield-Mask: 0x01)       */
#define GPIO_TEST_CTRL_REG_ENABLE_RFPT_Pos    (1UL)                     /*!< GPIO TEST_CTRL_REG: ENABLE_RFPT (Bit 1)                     */
#define GPIO_TEST_CTRL_REG_ENABLE_RFPT_Msk    (0x2UL)                   /*!< GPIO TEST_CTRL_REG: ENABLE_RFPT (Bitfield-Mask: 0x01)       */
#define GPIO_TEST_CTRL_REG_SHOW_PLL_TEST_OUT_Pos (2UL)                  /*!< GPIO TEST_CTRL_REG: SHOW_PLL_TEST_OUT (Bit 2)               */
#define GPIO_TEST_CTRL_REG_SHOW_PLL_TEST_OUT_Msk (0x4UL)                /*!< GPIO TEST_CTRL_REG: SHOW_PLL_TEST_OUT (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL_REG_SHOW_DCDC_TESTBUS_Pos (3UL)                  /*!< GPIO TEST_CTRL_REG: SHOW_DCDC_TESTBUS (Bit 3)               */
#define GPIO_TEST_CTRL_REG_SHOW_DCDC_TESTBUS_Msk (0x8UL)                /*!< GPIO TEST_CTRL_REG: SHOW_DCDC_TESTBUS (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL_REG_XTAL16M_CAP_TEST_EN_Pos (4UL)                /*!< GPIO TEST_CTRL_REG: XTAL16M_CAP_TEST_EN (Bit 4)             */
#define GPIO_TEST_CTRL_REG_XTAL16M_CAP_TEST_EN_Msk (0x10UL)             /*!< GPIO TEST_CTRL_REG: XTAL16M_CAP_TEST_EN (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL_REG_SHOW_IF_RO_Pos     (5UL)                     /*!< GPIO TEST_CTRL_REG: SHOW_IF_RO (Bit 5)                      */
#define GPIO_TEST_CTRL_REG_SHOW_IF_RO_Msk     (0x20UL)                  /*!< GPIO TEST_CTRL_REG: SHOW_IF_RO (Bitfield-Mask: 0x01)        */
#define GPIO_TEST_CTRL_REG_PLL_TST_MODE_Pos   (6UL)                     /*!< GPIO TEST_CTRL_REG: PLL_TST_MODE (Bit 6)                    */
#define GPIO_TEST_CTRL_REG_PLL_TST_MODE_Msk   (0x40UL)                  /*!< GPIO TEST_CTRL_REG: PLL_TST_MODE (Bitfield-Mask: 0x01)      */
#define GPIO_TEST_CTRL_REG_SHOW_TXDAC_MOD_Pos (7UL)                     /*!< GPIO TEST_CTRL_REG: SHOW_TXDAC_MOD (Bit 7)                  */
#define GPIO_TEST_CTRL_REG_SHOW_TXDAC_MOD_Msk (0x80UL)                  /*!< GPIO TEST_CTRL_REG: SHOW_TXDAC_MOD (Bitfield-Mask: 0x01)    */
#define GPIO_TEST_CTRL_REG_SHOW_PWR_TST_OUT_Pos (8UL)                   /*!< GPIO TEST_CTRL_REG: SHOW_PWR_TST_OUT (Bit 8)                */
#define GPIO_TEST_CTRL_REG_SHOW_PWR_TST_OUT_Msk (0x700UL)               /*!< GPIO TEST_CTRL_REG: SHOW_PWR_TST_OUT (Bitfield-Mask: 0x07)  */

