wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* --------------------------  I2C2_I2C2_SS_SCL_HCNT_REG  ------------------------- */
#define I2C2_I2C2_SS_SCL_HCNT_REG_IC_SS_SCL_HCNT_Pos (0UL)              /*!< I2C2 I2C2_SS_SCL_HCNT_REG: IC_SS_SCL_HCNT (Bit 0)           */
#define I2C2_I2C2_SS_SCL_HCNT_REG_IC_SS_SCL_HCNT_Msk (0xffffUL)         /*!< I2C2 I2C2_SS_SCL_HCNT_REG: IC_SS_SCL_HCNT (Bitfield-Mask: 0xffff) */

/* --------------------------  I2C2_I2C2_SS_SCL_LCNT_REG  ------------------------- */
#define I2C2_I2C2_SS_SCL_LCNT_REG_IC_SS_SCL_LCNT_Pos (0UL)              /*!< I2C2 I2C2_SS_SCL_LCNT_REG: IC_SS_SCL_LCNT (Bit 0)           */
#define I2C2_I2C2_SS_SCL_LCNT_REG_IC_SS_SCL_LCNT_Msk (0xffffUL)         /*!< I2C2 I2C2_SS_SCL_LCNT_REG: IC_SS_SCL_LCNT (Bitfield-Mask: 0xffff) */

/* --------------------------  I2C2_I2C2_FS_SCL_HCNT_REG  ------------------------- */
#define I2C2_I2C2_FS_SCL_HCNT_REG_IC_FS_SCL_HCNT_Pos (0UL)              /*!< I2C2 I2C2_FS_SCL_HCNT_REG: IC_FS_SCL_HCNT (Bit 0)           */
#define I2C2_I2C2_FS_SCL_HCNT_REG_IC_FS_SCL_HCNT_Msk (0xffffUL)         /*!< I2C2 I2C2_FS_SCL_HCNT_REG: IC_FS_SCL_HCNT (Bitfield-Mask: 0xffff) */

/* --------------------------  I2C2_I2C2_FS_SCL_LCNT_REG  ------------------------- */
#define I2C2_I2C2_FS_SCL_LCNT_REG_IC_FS_SCL_LCNT_Pos (0UL)              /*!< I2C2 I2C2_FS_SCL_LCNT_REG: IC_FS_SCL_LCNT (Bit 0)           */
#define I2C2_I2C2_FS_SCL_LCNT_REG_IC_FS_SCL_LCNT_Msk (0xffffUL)         /*!< I2C2 I2C2_FS_SCL_LCNT_REG: IC_FS_SCL_LCNT (Bitfield-Mask: 0xffff) */

/* ---------------------------  I2C2_I2C2_INTR_STAT_REG  -------------------------- */
#define I2C2_I2C2_INTR_STAT_REG_R_RX_UNDER_Pos (0UL)                    /*!< I2C2 I2C2_INTR_STAT_REG: R_RX_UNDER (Bit 0)                 */
#define I2C2_I2C2_INTR_STAT_REG_R_RX_UNDER_Msk (0x1UL)                  /*!< I2C2 I2C2_INTR_STAT_REG: R_RX_UNDER (Bitfield-Mask: 0x01)   */
#define I2C2_I2C2_INTR_STAT_REG_R_RX_OVER_Pos (1UL)                     /*!< I2C2 I2C2_INTR_STAT_REG: R_RX_OVER (Bit 1)                  */
#define I2C2_I2C2_INTR_STAT_REG_R_RX_OVER_Msk (0x2UL)                   /*!< I2C2 I2C2_INTR_STAT_REG: R_RX_OVER (Bitfield-Mask: 0x01)    */
#define I2C2_I2C2_INTR_STAT_REG_R_RX_FULL_Pos (2UL)                     /*!< I2C2 I2C2_INTR_STAT_REG: R_RX_FULL (Bit 2)                  */
#define I2C2_I2C2_INTR_STAT_REG_R_RX_FULL_Msk (0x4UL)                   /*!< I2C2 I2C2_INTR_STAT_REG: R_RX_FULL (Bitfield-Mask: 0x01)    */
#define I2C2_I2C2_INTR_STAT_REG_R_TX_OVER_Pos (3UL)                     /*!< I2C2 I2C2_INTR_STAT_REG: R_TX_OVER (Bit 3)                  */
#define I2C2_I2C2_INTR_STAT_REG_R_TX_OVER_Msk (0x8UL)                   /*!< I2C2 I2C2_INTR_STAT_REG: R_TX_OVER (Bitfield-Mask: 0x01)    */
#define I2C2_I2C2_INTR_STAT_REG_R_TX_EMPTY_Pos (4UL)                    /*!< I2C2 I2C2_INTR_STAT_REG: R_TX_EMPTY (Bit 4)                 */
#define I2C2_I2C2_INTR_STAT_REG_R_TX_EMPTY_Msk (0x10UL)                 /*!< I2C2 I2C2_INTR_STAT_REG: R_TX_EMPTY (Bitfield-Mask: 0x01)   */
#define I2C2_I2C2_INTR_STAT_REG_R_RD_REQ_Pos  (5UL)                     /*!< I2C2 I2C2_INTR_STAT_REG: R_RD_REQ (Bit 5)                   */
#define I2C2_I2C2_INTR_STAT_REG_R_RD_REQ_Msk  (0x20UL)                  /*!< I2C2 I2C2_INTR_STAT_REG: R_RD_REQ (Bitfield-Mask: 0x01)     */
#define I2C2_I2C2_INTR_STAT_REG_R_TX_ABRT_Pos (6UL)                     /*!< I2C2 I2C2_INTR_STAT_REG: R_TX_ABRT (Bit 6)                  */
#define I2C2_I2C2_INTR_STAT_REG_R_TX_ABRT_Msk (0x40UL)                  /*!< I2C2 I2C2_INTR_STAT_REG: R_TX_ABRT (Bitfield-Mask: 0x01)    */
#define I2C2_I2C2_INTR_STAT_REG_R_RX_DONE_Pos (7UL)                     /*!< I2C2 I2C2_INTR_STAT_REG: R_RX_DONE (Bit 7)                  */
#define I2C2_I2C2_INTR_STAT_REG_R_RX_DONE_Msk (0x80UL)                  /*!< I2C2 I2C2_INTR_STAT_REG: R_RX_DONE (Bitfield-Mask: 0x01)    */
#define I2C2_I2C2_INTR_STAT_REG_R_ACTIVITY_Pos (8UL)                    /*!< I2C2 I2C2_INTR_STAT_REG: R_ACTIVITY (Bit 8)                 */
#define I2C2_I2C2_INTR_STAT_REG_R_ACTIVITY_Msk (0x100UL)                /*!< I2C2 I2C2_INTR_STAT_REG: R_ACTIVITY (Bitfield-Mask: 0x01)   */
#define I2C2_I2C2_INTR_STAT_REG_R_STOP_DET_Pos (9UL)                    /*!< I2C2 I2C2_INTR_STAT_REG: R_STOP_DET (Bit 9)                 */
#define I2C2_I2C2_INTR_STAT_REG_R_STOP_DET_Msk (0x200UL)                /*!< I2C2 I2C2_INTR_STAT_REG: R_STOP_DET (Bitfield-Mask: 0x01)   */
#define I2C2_I2C2_INTR_STAT_REG_R_START_DET_Pos (10UL)                  /*!< I2C2 I2C2_INTR_STAT_REG: R_START_DET (Bit 10)               */
#define I2C2_I2C2_INTR_STAT_REG_R_START_DET_Msk (0x400UL)               /*!< I2C2 I2C2_INTR_STAT_REG: R_START_DET (Bitfield-Mask: 0x01)  */
#define I2C2_I2C2_INTR_STAT_REG_R_GEN_CALL_Pos (11UL)                   /*!< I2C2 I2C2_INTR_STAT_REG: R_GEN_CALL (Bit 11)                */
#define I2C2_I2C2_INTR_STAT_REG_R_GEN_CALL_Msk (0x800UL)                /*!< I2C2 I2C2_INTR_STAT_REG: R_GEN_CALL (Bitfield-Mask: 0x01)   */

/* ---------------------------  I2C2_I2C2_INTR_MASK_REG  -------------------------- */
#define I2C2_I2C2_INTR_MASK_REG_M_RX_UNDER_Pos (0UL)                    /*!< I2C2 I2C2_INTR_MASK_REG: M_RX_UNDER (Bit 0)                 */
#define I2C2_I2C2_INTR_MASK_REG_M_RX_UNDER_Msk (0x1UL)                  /*!< I2C2 I2C2_INTR_MASK_REG: M_RX_UNDER (Bitfield-Mask: 0x01)   */
#define I2C2_I2C2_INTR_MASK_REG_M_RX_OVER_Pos (1UL)                     /*!< I2C2 I2C2_INTR_MASK_REG: M_RX_OVER (Bit 1)                  */
#define I2C2_I2C2_INTR_MASK_REG_M_RX_OVER_Msk (0x2UL)                   /*!< I2C2 I2C2_INTR_MASK_REG: M_RX_OVER (Bitfield-Mask: 0x01)    */
#define I2C2_I2C2_INTR_MASK_REG_M_RX_FULL_Pos (2UL)                     /*!< I2C2 I2C2_INTR_MASK_REG: M_RX_FULL (Bit 2)                  */
#define I2C2_I2C2_INTR_MASK_REG_M_RX_FULL_Msk (0x4UL)                   /*!< I2C2 I2C2_INTR_MASK_REG: M_RX_FULL (Bitfield-Mask: 0x01)    */
#define I2C2_I2C2_INTR_MASK_REG_M_TX_OVER_Pos (3UL)                     /*!< I2C2 I2C2_INTR_MASK_REG: M_TX_OVER (Bit 3)                  */
#define I2C2_I2C2_INTR_MASK_REG_M_TX_OVER_Msk (0x8UL)                   /*!< I2C2 I2C2_INTR_MASK_REG: M_TX_OVER (Bitfield-Mask: 0x01)    */
#define I2C2_I2C2_INTR_MASK_REG_M_TX_EMPTY_Pos (4UL)                    /*!< I2C2 I2C2_INTR_MASK_REG: M_TX_EMPTY (Bit 4)                 */
#define I2C2_I2C2_INTR_MASK_REG_M_TX_EMPTY_Msk (0x10UL)                 /*!< I2C2 I2C2_INTR_MASK_REG: M_TX_EMPTY (Bitfield-Mask: 0x01)   */
#define I2C2_I2C2_INTR_MASK_REG_M_RD_REQ_Pos  (5UL)                     /*!< I2C2 I2C2_INTR_MASK_REG: M_RD_REQ (Bit 5)                   */
#define I2C2_I2C2_INTR_MASK_REG_M_RD_REQ_Msk  (0x20UL)                  /*!< I2C2 I2C2_INTR_MASK_REG: M_RD_REQ (Bitfield-Mask: 0x01)     */
#define I2C2_I2C2_INTR_MASK_REG_M_TX_ABRT_Pos (6UL)                     /*!< I2C2 I2C2_INTR_MASK_REG: M_TX_ABRT (Bit 6)                  */
#define I2C2_I2C2_INTR_MASK_REG_M_TX_ABRT_Msk (0x40UL)                  /*!< I2C2 I2C2_INTR_MASK_REG: M_TX_ABRT (Bitfield-Mask: 0x01)    */
#define I2C2_I2C2_INTR_MASK_REG_M_RX_DONE_Pos (7UL)                     /*!< I2C2 I2C2_INTR_MASK_REG: M_RX_DONE (Bit 7)                  */
#define I2C2_I2C2_INTR_MASK_REG_M_RX_DONE_Msk (0x80UL)                  /*!< I2C2 I2C2_INTR_MASK_REG: M_RX_DONE (Bitfield-Mask: 0x01)    */
#define I2C2_I2C2_INTR_MASK_REG_M_ACTIVITY_Pos (8UL)                    /*!< I2C2 I2C2_INTR_MASK_REG: M_ACTIVITY (Bit 8)                 */
#define I2C2_I2C2_INTR_MASK_REG_M_ACTIVITY_Msk (0x100UL)                /*!< I2C2 I2C2_INTR_MASK_REG: M_ACTIVITY (Bitfield-Mask: 0x01)   */
#define I2C2_I2C2_INTR_MASK_REG_M_STOP_DET_Pos (9UL)                    /*!< I2C2 I2C2_INTR_MASK_REG: M_STOP_DET (Bit 9)                 */
#define I2C2_I2C2_INTR_MASK_REG_M_STOP_DET_Msk (0x200UL)                /*!< I2C2 I2C2_INTR_MASK_REG: M_STOP_DET (Bitfield-Mask: 0x01)   */
#define I2C2_I2C2_INTR_MASK_REG_M_START_DET_Pos (10UL)                  /*!< I2C2 I2C2_INTR_MASK_REG: M_START_DET (Bit 10)               */
#define I2C2_I2C2_INTR_MASK_REG_M_START_DET_Msk (0x400UL)               /*!< I2C2 I2C2_INTR_MASK_REG: M_START_DET (Bitfield-Mask: 0x01)  */
#define I2C2_I2C2_INTR_MASK_REG_M_GEN_CALL_Pos (11UL)                   /*!< I2C2 I2C2_INTR_MASK_REG: M_GEN_CALL (Bit 11)                */
#define I2C2_I2C2_INTR_MASK_REG_M_GEN_CALL_Msk (0x800UL)                /*!< I2C2 I2C2_INTR_MASK_REG: M_GEN_CALL (Bitfield-Mask: 0x01)   */

/* -------------------------  I2C2_I2C2_RAW_INTR_STAT_REG  ------------------------ */
#define I2C2_I2C2_RAW_INTR_STAT_REG_RX_UNDER_Pos (0UL)                  /*!< I2C2 I2C2_RAW_INTR_STAT_REG: RX_UNDER (Bit 0)               */
#define I2C2_I2C2_RAW_INTR_STAT_REG_RX_UNDER_Msk (0x1UL)                /*!< I2C2 I2C2_RAW_INTR_STAT_REG: RX_UNDER (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_RAW_INTR_STAT_REG_RX_OVER_Pos (1UL)                   /*!< I2C2 I2C2_RAW_INTR_STAT_REG: RX_OVER (Bit 1)                */
#define I2C2_I2C2_RAW_INTR_STAT_REG_RX_OVER_Msk (0x2UL)                 /*!< I2C2 I2C2_RAW_INTR_STAT_REG: RX_OVER (Bitfield-Mask: 0x01)  */
#define I2C2_I2C2_RAW_INTR_STAT_REG_RX_FULL_Pos (2UL)                   /*!< I2C2 I2C2_RAW_INTR_STAT_REG: RX_FULL (Bit 2)                */
#define I2C2_I2C2_RAW_INTR_STAT_REG_RX_FULL_Msk (0x4UL)                 /*!< I2C2 I2C2_RAW_INTR_STAT_REG: RX_FULL (Bitfield-Mask: 0x01)  */
#define I2C2_I2C2_RAW_INTR_STAT_REG_TX_OVER_Pos (3UL)                   /*!< I2C2 I2C2_RAW_INTR_STAT_REG: TX_OVER (Bit 3)                */
#define I2C2_I2C2_RAW_INTR_STAT_REG_TX_OVER_Msk (0x8UL)                 /*!< I2C2 I2C2_RAW_INTR_STAT_REG: TX_OVER (Bitfield-Mask: 0x01)  */
#define I2C2_I2C2_RAW_INTR_STAT_REG_TX_EMPTY_Pos (4UL)                  /*!< I2C2 I2C2_RAW_INTR_STAT_REG: TX_EMPTY (Bit 4)               */
#define I2C2_I2C2_RAW_INTR_STAT_REG_TX_EMPTY_Msk (0x10UL)               /*!< I2C2 I2C2_RAW_INTR_STAT_REG: TX_EMPTY (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_RAW_INTR_STAT_REG_RD_REQ_Pos (5UL)                    /*!< I2C2 I2C2_RAW_INTR_STAT_REG: RD_REQ (Bit 5)                 */
#define I2C2_I2C2_RAW_INTR_STAT_REG_RD_REQ_Msk (0x20UL)                 /*!< I2C2 I2C2_RAW_INTR_STAT_REG: RD_REQ (Bitfield-Mask: 0x01)   */
#define I2C2_I2C2_RAW_INTR_STAT_REG_TX_ABRT_Pos (6UL)                   /*!< I2C2 I2C2_RAW_INTR_STAT_REG: TX_ABRT (Bit 6)                */
#define I2C2_I2C2_RAW_INTR_STAT_REG_TX_ABRT_Msk (0x40UL)                /*!< I2C2 I2C2_RAW_INTR_STAT_REG: TX_ABRT (Bitfield-Mask: 0x01)  */
#define I2C2_I2C2_RAW_INTR_STAT_REG_RX_DONE_Pos (7UL)                   /*!< I2C2 I2C2_RAW_INTR_STAT_REG: RX_DONE (Bit 7)                */
#define I2C2_I2C2_RAW_INTR_STAT_REG_RX_DONE_Msk (0x80UL)                /*!< I2C2 I2C2_RAW_INTR_STAT_REG: RX_DONE (Bitfield-Mask: 0x01)  */
#define I2C2_I2C2_RAW_INTR_STAT_REG_ACTIVITY_Pos (8UL)                  /*!< I2C2 I2C2_RAW_INTR_STAT_REG: ACTIVITY (Bit 8)               */
#define I2C2_I2C2_RAW_INTR_STAT_REG_ACTIVITY_Msk (0x100UL)              /*!< I2C2 I2C2_RAW_INTR_STAT_REG: ACTIVITY (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_RAW_INTR_STAT_REG_STOP_DET_Pos (9UL)                  /*!< I2C2 I2C2_RAW_INTR_STAT_REG: STOP_DET (Bit 9)               */
#define I2C2_I2C2_RAW_INTR_STAT_REG_STOP_DET_Msk (0x200UL)              /*!< I2C2 I2C2_RAW_INTR_STAT_REG: STOP_DET (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_RAW_INTR_STAT_REG_START_DET_Pos (10UL)                /*!< I2C2 I2C2_RAW_INTR_STAT_REG: START_DET (Bit 10)             */
#define I2C2_I2C2_RAW_INTR_STAT_REG_START_DET_Msk (0x400UL)             /*!< I2C2 I2C2_RAW_INTR_STAT_REG: START_DET (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_RAW_INTR_STAT_REG_GEN_CALL_Pos (11UL)                 /*!< I2C2 I2C2_RAW_INTR_STAT_REG: GEN_CALL (Bit 11)              */
#define I2C2_I2C2_RAW_INTR_STAT_REG_GEN_CALL_Msk (0x800UL)              /*!< I2C2 I2C2_RAW_INTR_STAT_REG: GEN_CALL (Bitfield-Mask: 0x01) */

/* -----------------------------  I2C2_I2C2_RX_TL_REG  ---------------------------- */
#define I2C2_I2C2_RX_TL_REG_RX_TL_Pos         (0UL)                     /*!< I2C2 I2C2_RX_TL_REG: RX_TL (Bit 0)                          */
#define I2C2_I2C2_RX_TL_REG_RX_TL_Msk         (0x1fUL)                  /*!< I2C2 I2C2_RX_TL_REG: RX_TL (Bitfield-Mask: 0x1f)            */

/* -----------------------------  I2C2_I2C2_TX_TL_REG  ---------------------------- */
#define I2C2_I2C2_TX_TL_REG_RX_TL_Pos         (0UL)                     /*!< I2C2 I2C2_TX_TL_REG: RX_TL (Bit 0)                          */
#define I2C2_I2C2_TX_TL_REG_RX_TL_Msk         (0x1fUL)                  /*!< I2C2 I2C2_TX_TL_REG: RX_TL (Bitfield-Mask: 0x1f)            */

/* ---------------------------  I2C2_I2C2_CLR_INTR_REG  --------------------------- */
#define I2C2_I2C2_CLR_INTR_REG_CLR_INTR_Pos   (0UL)                     /*!< I2C2 I2C2_CLR_INTR_REG: CLR_INTR (Bit 0)                    */
#define I2C2_I2C2_CLR_INTR_REG_CLR_INTR_Msk   (0x1UL)                   /*!< I2C2 I2C2_CLR_INTR_REG: CLR_INTR (Bitfield-Mask: 0x01)      */

/* -------------------------  I2C2_I2C2_CLR_RX_UNDER_REG  ------------------------- */
#define I2C2_I2C2_CLR_RX_UNDER_REG_CLR_RX_UNDER_Pos (0UL)               /*!< I2C2 I2C2_CLR_RX_UNDER_REG: CLR_RX_UNDER (Bit 0)            */
#define I2C2_I2C2_CLR_RX_UNDER_REG_CLR_RX_UNDER_Msk (0x1UL)             /*!< I2C2 I2C2_CLR_RX_UNDER_REG: CLR_RX_UNDER (Bitfield-Mask: 0x01) */

/* --------------------------  I2C2_I2C2_CLR_RX_OVER_REG  ------------------------- */
#define I2C2_I2C2_CLR_RX_OVER_REG_CLR_RX_OVER_Pos (0UL)                 /*!< I2C2 I2C2_CLR_RX_OVER_REG: CLR_RX_OVER (Bit 0)              */
#define I2C2_I2C2_CLR_RX_OVER_REG_CLR_RX_OVER_Msk (0x1UL)               /*!< I2C2 I2C2_CLR_RX_OVER_REG: CLR_RX_OVER (Bitfield-Mask: 0x01) */

