wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* ------------------------------  IR_IR_STATUS_REG  ------------------------------ */
#define IR_IR_STATUS_REG_IR_CODE_FIFO_WRDS_Pos (0UL)                    /*!< IR IR_STATUS_REG: IR_CODE_FIFO_WRDS (Bit 0)                 */
#define IR_IR_STATUS_REG_IR_CODE_FIFO_WRDS_Msk (0x3fUL)                 /*!< IR IR_STATUS_REG: IR_CODE_FIFO_WRDS (Bitfield-Mask: 0x3f)   */
#define IR_IR_STATUS_REG_IR_REP_FIFO_WRDS_Pos (6UL)                     /*!< IR IR_STATUS_REG: IR_REP_FIFO_WRDS (Bit 6)                  */
#define IR_IR_STATUS_REG_IR_REP_FIFO_WRDS_Msk (0x3c0UL)                 /*!< IR IR_STATUS_REG: IR_REP_FIFO_WRDS (Bitfield-Mask: 0x0f)    */
#define IR_IR_STATUS_REG_IR_BUSY_Pos          (10UL)                    /*!< IR IR_STATUS_REG: IR_BUSY (Bit 10)                          */
#define IR_IR_STATUS_REG_IR_BUSY_Msk          (0x400UL)                 /*!< IR IR_STATUS_REG: IR_BUSY (Bitfield-Mask: 0x01)             */

/* ----------------------------  IR_IR_REPEAT_TIME_REG  --------------------------- */
#define IR_IR_REPEAT_TIME_REG_IR_REPEAT_TIME_Pos (0UL)                  /*!< IR IR_REPEAT_TIME_REG: IR_REPEAT_TIME (Bit 0)               */
#define IR_IR_REPEAT_TIME_REG_IR_REPEAT_TIME_Msk (0xffffUL)             /*!< IR IR_REPEAT_TIME_REG: IR_REPEAT_TIME (Bitfield-Mask: 0xffff) */

/* -----------------------------  IR_IR_MAIN_FIFO_REG  ---------------------------- */
#define IR_IR_MAIN_FIFO_REG_IR_CODE_FIFO_DATA_Pos (0UL)                 /*!< IR IR_MAIN_FIFO_REG: IR_CODE_FIFO_DATA (Bit 0)              */
#define IR_IR_MAIN_FIFO_REG_IR_CODE_FIFO_DATA_Msk (0xffffUL)            /*!< IR IR_MAIN_FIFO_REG: IR_CODE_FIFO_DATA (Bitfield-Mask: 0xffff) */

/* ----------------------------  IR_IR_REPEAT_FIFO_REG  --------------------------- */
#define IR_IR_REPEAT_FIFO_REG_IR_REPEAT_FIFO_DATA_Pos (0UL)             /*!< IR IR_REPEAT_FIFO_REG: IR_REPEAT_FIFO_DATA (Bit 0)          */
#define IR_IR_REPEAT_FIFO_REG_IR_REPEAT_FIFO_DATA_Msk (0xffffUL)        /*!< IR IR_REPEAT_FIFO_REG: IR_REPEAT_FIFO_DATA (Bitfield-Mask: 0xffff) */

/* ----------------------------  IR_IR_IRQ_STATUS_REG  ---------------------------- */
#define IR_IR_IRQ_STATUS_REG_IR_IRQ_ACK_Pos   (0UL)                     /*!< IR IR_IRQ_STATUS_REG: IR_IRQ_ACK (Bit 0)                    */
#define IR_IR_IRQ_STATUS_REG_IR_IRQ_ACK_Msk   (0x1UL)                   /*!< IR IR_IRQ_STATUS_REG: IR_IRQ_ACK (Bitfield-Mask: 0x01)      */


/* ================================================================================ */
/* ================         struct 'KBSCAN' Position & Mask        ================ */
/* ================================================================================ */


/* ----------------------------  KBSCAN_KBSCN_CTRL_REG  --------------------------- */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_EN_Pos    (0UL)                     /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_EN (Bit 0)                     */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_EN_Msk    (0x1UL)                   /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_EN (Bitfield-Mask: 0x01)       */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_IRQ_MESSAGE_MASK_Pos (1UL)          /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_IRQ_MESSAGE_MASK (Bit 1)       */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_IRQ_MESSAGE_MASK_Msk (0x2UL)        /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_IRQ_MESSAGE_MASK (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_IRQ_INACTIVE_MASK_Pos (2UL)         /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_IRQ_INACTIVE_MASK (Bit 2)      */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_IRQ_INACTIVE_MASK_Msk (0x4UL)       /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_IRQ_INACTIVE_MASK (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_IRQ_FIFO_MASK_Pos (3UL)             /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_IRQ_FIFO_MASK (Bit 3)          */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_IRQ_FIFO_MASK_Msk (0x8UL)           /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_IRQ_FIFO_MASK (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_INACTIVE_TIME_Pos (4UL)             /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_INACTIVE_TIME (Bit 4)          */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_INACTIVE_TIME_Msk (0x7f0UL)         /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_INACTIVE_TIME (Bitfield-Mask: 0x7f) */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_INACTIVE_EN_Pos (11UL)              /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_INACTIVE_EN (Bit 11)           */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_INACTIVE_EN_Msk (0x800UL)           /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_INACTIVE_EN (Bitfield-Mask: 0x01) */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_CLKDIV_Pos (12UL)                   /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_CLKDIV (Bit 12)                */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_CLKDIV_Msk (0x3000UL)               /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_CLKDIV (Bitfield-Mask: 0x03)   */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_RESET_FIFO_Pos (14UL)               /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_RESET_FIFO (Bit 14)            */
#define KBSCAN_KBSCN_CTRL_REG_KBSCN_RESET_FIFO_Msk (0x4000UL)           /*!< KBSCAN KBSCN_CTRL_REG: KBSCN_RESET_FIFO (Bitfield-Mask: 0x01) */

/* ---------------------------  KBSCAN_KBSCN_CTRL2_REG  --------------------------- */
#define KBSCAN_KBSCN_CTRL2_REG_KBSCN_ROW_ACTIVE_TIME_Pos (0UL)          /*!< KBSCAN KBSCN_CTRL2_REG: KBSCN_ROW_ACTIVE_TIME (Bit 0)       */
#define KBSCAN_KBSCN_CTRL2_REG_KBSCN_ROW_ACTIVE_TIME_Msk (0xffffUL)     /*!< KBSCAN KBSCN_CTRL2_REG: KBSCN_ROW_ACTIVE_TIME (Bitfield-Mask: 0xffff) */

/* ------------------------  KBSCAN_KBSCN_MATRIX_SIZE_REG  ------------------------ */
#define KBSCAN_KBSCN_MATRIX_SIZE_REG_KBSCN_MATRIX_ROW_Pos (0UL)         /*!< KBSCAN KBSCN_MATRIX_SIZE_REG: KBSCN_MATRIX_ROW (Bit 0)      */
#define KBSCAN_KBSCN_MATRIX_SIZE_REG_KBSCN_MATRIX_ROW_Msk (0xfUL)       /*!< KBSCAN KBSCN_MATRIX_SIZE_REG: KBSCN_MATRIX_ROW (Bitfield-Mask: 0x0f) */
#define KBSCAN_KBSCN_MATRIX_SIZE_REG_KBSCN_MATRIX_COLUMN_Pos (4UL)      /*!< KBSCAN KBSCN_MATRIX_SIZE_REG: KBSCN_MATRIX_COLUMN (Bit 4)   */
#define KBSCAN_KBSCN_MATRIX_SIZE_REG_KBSCN_MATRIX_COLUMN_Msk (0x1f0UL)  /*!< KBSCAN KBSCN_MATRIX_SIZE_REG: KBSCN_MATRIX_COLUMN (Bitfield-Mask: 0x1f) */

