wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* --------------------------  KBSCAN_KBSCN_P11_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P11_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P11_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P11_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P11_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P11_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P11_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P11_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P11_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P11_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P11_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P11_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P11_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P12_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P12_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P12_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P12_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P12_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P12_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P12_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P12_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P12_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P12_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P12_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P12_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P12_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P13_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P13_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P13_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P13_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P13_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P13_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P13_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P13_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P13_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P13_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P13_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P13_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P13_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P14_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P14_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P14_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P14_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P14_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P14_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P14_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P14_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P14_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P14_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P14_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P14_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P14_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P15_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P15_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P15_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P15_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P15_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P15_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P15_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P15_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P15_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P15_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P15_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P15_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P15_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P16_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P16_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P16_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P16_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P16_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P16_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P16_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P16_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P16_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P16_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P16_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P16_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P16_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P17_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P17_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P17_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P17_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P17_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P17_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P17_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P17_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P17_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P17_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P17_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P17_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P17_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P20_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P20_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P20_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P20_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P20_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P20_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P20_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P20_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P20_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P20_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P20_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P20_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P20_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P21_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P21_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P21_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P21_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P21_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P21_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P21_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P21_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P21_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P21_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P21_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P21_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P21_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P22_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P22_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P22_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P22_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P22_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P22_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P22_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P22_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P22_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P22_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P22_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P22_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P22_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P23_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P23_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P23_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P23_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P23_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P23_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P23_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P23_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P23_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P23_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P23_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P23_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P23_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

/* --------------------------  KBSCAN_KBSCN_P24_MODE_REG  ------------------------- */
#define KBSCAN_KBSCN_P24_MODE_REG_KBSCN_MODE_Pos (0UL)                  /*!< KBSCAN KBSCN_P24_MODE_REG: KBSCN_MODE (Bit 0)               */
#define KBSCAN_KBSCN_P24_MODE_REG_KBSCN_MODE_Msk (0x1fUL)               /*!< KBSCAN KBSCN_P24_MODE_REG: KBSCN_MODE (Bitfield-Mask: 0x1f) */
#define KBSCAN_KBSCN_P24_MODE_REG_KBSCN_ROW_Pos (5UL)                   /*!< KBSCAN KBSCN_P24_MODE_REG: KBSCN_ROW (Bit 5)                */
#define KBSCAN_KBSCN_P24_MODE_REG_KBSCN_ROW_Msk (0x20UL)                /*!< KBSCAN KBSCN_P24_MODE_REG: KBSCN_ROW (Bitfield-Mask: 0x01)  */
#define KBSCAN_KBSCN_P24_MODE_REG_KBSCN_GPIO_EN_Pos (6UL)               /*!< KBSCAN KBSCN_P24_MODE_REG: KBSCN_GPIO_EN (Bit 6)            */
#define KBSCAN_KBSCN_P24_MODE_REG_KBSCN_GPIO_EN_Msk (0x40UL)            /*!< KBSCAN KBSCN_P24_MODE_REG: KBSCN_GPIO_EN (Bitfield-Mask: 0x01) */

