wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* -----------------------------  OTPC_OTPC_TIM2_REG  ----------------------------- */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_CC_STBY_THR_Pos (0UL)              /*!< OTPC OTPC_TIM2_REG: OTPC_TIM2_CC_STBY_THR (Bit 0)           */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_CC_STBY_THR_Msk (0x3ffUL)          /*!< OTPC OTPC_TIM2_REG: OTPC_TIM2_CC_STBY_THR (Bitfield-Mask: 0x3ff) */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_CC_T_BCHK_Pos (16UL)               /*!< OTPC OTPC_TIM2_REG: OTPC_TIM2_CC_T_BCHK (Bit 16)            */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_CC_T_BCHK_Msk (0x7f0000UL)         /*!< OTPC OTPC_TIM2_REG: OTPC_TIM2_CC_T_BCHK (Bitfield-Mask: 0x7f) */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_RDENL_PROT_Pos (23UL)              /*!< OTPC OTPC_TIM2_REG: OTPC_TIM2_RDENL_PROT (Bit 23)           */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_RDENL_PROT_Msk (0x800000UL)        /*!< OTPC OTPC_TIM2_REG: OTPC_TIM2_RDENL_PROT (Bitfield-Mask: 0x01) */


/* ================================================================================ */
/* ================         struct 'PATCH' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------  PATCH_PATCH_VALID_REG  --------------------------- */
#define PATCH_PATCH_VALID_REG_PATCH_VALID_Pos (0UL)                     /*!< PATCH PATCH_VALID_REG: PATCH_VALID (Bit 0)                  */
#define PATCH_PATCH_VALID_REG_PATCH_VALID_Msk (0xfffffffUL)             /*!< PATCH PATCH_VALID_REG: PATCH_VALID (Bitfield-Mask: 0xfffffff) */

/* --------------------------  PATCH_PATCH_VALID_SET_REG  ------------------------- */
#define PATCH_PATCH_VALID_SET_REG_PATCH_VALID_Pos (0UL)                 /*!< PATCH PATCH_VALID_SET_REG: PATCH_VALID (Bit 0)              */
#define PATCH_PATCH_VALID_SET_REG_PATCH_VALID_Msk (0xfffffffUL)         /*!< PATCH PATCH_VALID_SET_REG: PATCH_VALID (Bitfield-Mask: 0xfffffff) */

/* -------------------------  PATCH_PATCH_VALID_RESET_REG  ------------------------ */
#define PATCH_PATCH_VALID_RESET_REG_PATCH_VALID_Pos (0UL)               /*!< PATCH PATCH_VALID_RESET_REG: PATCH_VALID (Bit 0)            */
#define PATCH_PATCH_VALID_RESET_REG_PATCH_VALID_Msk (0xfffffffUL)       /*!< PATCH PATCH_VALID_RESET_REG: PATCH_VALID (Bitfield-Mask: 0xfffffff) */

/* ----------------------------  PATCH_PATCH_ADDR0_REG  --------------------------- */
#define PATCH_PATCH_ADDR0_REG_PATCH_ADDR_C_Pos (1UL)                    /*!< PATCH PATCH_ADDR0_REG: PATCH_ADDR_C (Bit 1)                 */
#define PATCH_PATCH_ADDR0_REG_PATCH_ADDR_C_Msk (0x1fffeUL)              /*!< PATCH PATCH_ADDR0_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR0_REG_PATCH_ADDR_19_Pos (19UL)                  /*!< PATCH PATCH_ADDR0_REG: PATCH_ADDR_19 (Bit 19)               */
#define PATCH_PATCH_ADDR0_REG_PATCH_ADDR_19_Msk (0x80000UL)             /*!< PATCH PATCH_ADDR0_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01)  */

/* ----------------------------  PATCH_PATCH_ADDR1_REG  --------------------------- */
#define PATCH_PATCH_ADDR1_REG_PATCH_ADDR_C_Pos (1UL)                    /*!< PATCH PATCH_ADDR1_REG: PATCH_ADDR_C (Bit 1)                 */
#define PATCH_PATCH_ADDR1_REG_PATCH_ADDR_C_Msk (0x1fffeUL)              /*!< PATCH PATCH_ADDR1_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR1_REG_PATCH_ADDR_19_Pos (19UL)                  /*!< PATCH PATCH_ADDR1_REG: PATCH_ADDR_19 (Bit 19)               */
#define PATCH_PATCH_ADDR1_REG_PATCH_ADDR_19_Msk (0x80000UL)             /*!< PATCH PATCH_ADDR1_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01)  */

/* ----------------------------  PATCH_PATCH_ADDR2_REG  --------------------------- */
#define PATCH_PATCH_ADDR2_REG_PATCH_ADDR_C_Pos (1UL)                    /*!< PATCH PATCH_ADDR2_REG: PATCH_ADDR_C (Bit 1)                 */
#define PATCH_PATCH_ADDR2_REG_PATCH_ADDR_C_Msk (0x1fffeUL)              /*!< PATCH PATCH_ADDR2_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR2_REG_PATCH_ADDR_19_Pos (19UL)                  /*!< PATCH PATCH_ADDR2_REG: PATCH_ADDR_19 (Bit 19)               */
#define PATCH_PATCH_ADDR2_REG_PATCH_ADDR_19_Msk (0x80000UL)             /*!< PATCH PATCH_ADDR2_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01)  */

/* ----------------------------  PATCH_PATCH_ADDR3_REG  --------------------------- */
#define PATCH_PATCH_ADDR3_REG_PATCH_ADDR_C_Pos (1UL)                    /*!< PATCH PATCH_ADDR3_REG: PATCH_ADDR_C (Bit 1)                 */
#define PATCH_PATCH_ADDR3_REG_PATCH_ADDR_C_Msk (0x1fffeUL)              /*!< PATCH PATCH_ADDR3_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR3_REG_PATCH_ADDR_19_Pos (19UL)                  /*!< PATCH PATCH_ADDR3_REG: PATCH_ADDR_19 (Bit 19)               */
#define PATCH_PATCH_ADDR3_REG_PATCH_ADDR_19_Msk (0x80000UL)             /*!< PATCH PATCH_ADDR3_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01)  */

/* ----------------------------  PATCH_PATCH_ADDR4_REG  --------------------------- */
#define PATCH_PATCH_ADDR4_REG_PATCH_ADDR_C_Pos (1UL)                    /*!< PATCH PATCH_ADDR4_REG: PATCH_ADDR_C (Bit 1)                 */
#define PATCH_PATCH_ADDR4_REG_PATCH_ADDR_C_Msk (0x1fffeUL)              /*!< PATCH PATCH_ADDR4_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR4_REG_PATCH_ADDR_19_Pos (19UL)                  /*!< PATCH PATCH_ADDR4_REG: PATCH_ADDR_19 (Bit 19)               */
#define PATCH_PATCH_ADDR4_REG_PATCH_ADDR_19_Msk (0x80000UL)             /*!< PATCH PATCH_ADDR4_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01)  */

/* ----------------------------  PATCH_PATCH_ADDR5_REG  --------------------------- */
#define PATCH_PATCH_ADDR5_REG_PATCH_ADDR_C_Pos (1UL)                    /*!< PATCH PATCH_ADDR5_REG: PATCH_ADDR_C (Bit 1)                 */
#define PATCH_PATCH_ADDR5_REG_PATCH_ADDR_C_Msk (0x1fffeUL)              /*!< PATCH PATCH_ADDR5_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR5_REG_PATCH_ADDR_19_Pos (19UL)                  /*!< PATCH PATCH_ADDR5_REG: PATCH_ADDR_19 (Bit 19)               */
#define PATCH_PATCH_ADDR5_REG_PATCH_ADDR_19_Msk (0x80000UL)             /*!< PATCH PATCH_ADDR5_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01)  */

