wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* ---------------------------  RFCU_RF_SPARE1_FTDF_REG  -------------------------- */
#define RFCU_RF_SPARE1_FTDF_REG_RF_XTAL_RFCLK_TEST_Pos (0UL)            /*!< RFCU RF_SPARE1_FTDF_REG: RF_XTAL_RFCLK_TEST (Bit 0)         */
#define RFCU_RF_SPARE1_FTDF_REG_RF_XTAL_RFCLK_TEST_Msk (0x1UL)          /*!< RFCU RF_SPARE1_FTDF_REG: RF_XTAL_RFCLK_TEST (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_FTDF_REG_RF_XTAL_PLL_DXTAL16_TEST_Pos (1UL)      /*!< RFCU RF_SPARE1_FTDF_REG: RF_XTAL_PLL_DXTAL16_TEST (Bit 1)   */
#define RFCU_RF_SPARE1_FTDF_REG_RF_XTAL_PLL_DXTAL16_TEST_Msk (0x2UL)    /*!< RFCU RF_SPARE1_FTDF_REG: RF_XTAL_PLL_DXTAL16_TEST (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_FTDF_REG_RF_VTUNE_TO_ADC_TEST_EN_Pos (2UL)       /*!< RFCU RF_SPARE1_FTDF_REG: RF_VTUNE_TO_ADC_TEST_EN (Bit 2)    */
#define RFCU_RF_SPARE1_FTDF_REG_RF_VTUNE_TO_ADC_TEST_EN_Msk (0x4UL)     /*!< RFCU RF_SPARE1_FTDF_REG: RF_VTUNE_TO_ADC_TEST_EN (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_FTDF_REG_DEM_AFC_ACTIVATION_MODE_Pos (11UL)      /*!< RFCU RF_SPARE1_FTDF_REG: DEM_AFC_ACTIVATION_MODE (Bit 11)   */
#define RFCU_RF_SPARE1_FTDF_REG_DEM_AFC_ACTIVATION_MODE_Msk (0x800UL)   /*!< RFCU RF_SPARE1_FTDF_REG: DEM_AFC_ACTIVATION_MODE (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_FTDF_REG_VCO_COARSECAL_DELAY_Pos (12UL)          /*!< RFCU RF_SPARE1_FTDF_REG: VCO_COARSECAL_DELAY (Bit 12)       */
#define RFCU_RF_SPARE1_FTDF_REG_VCO_COARSECAL_DELAY_Msk (0x3000UL)      /*!< RFCU RF_SPARE1_FTDF_REG: VCO_COARSECAL_DELAY (Bitfield-Mask: 0x03) */
#define RFCU_RF_SPARE1_FTDF_REG_DEM_PAD_WRAP_Pos (14UL)                 /*!< RFCU RF_SPARE1_FTDF_REG: DEM_PAD_WRAP (Bit 14)              */
#define RFCU_RF_SPARE1_FTDF_REG_DEM_PAD_WRAP_Msk (0x4000UL)             /*!< RFCU RF_SPARE1_FTDF_REG: DEM_PAD_WRAP (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_FTDF_REG_DEM_PAD_SAT_TO_ZERO_Pos (15UL)          /*!< RFCU RF_SPARE1_FTDF_REG: DEM_PAD_SAT_TO_ZERO (Bit 15)       */
#define RFCU_RF_SPARE1_FTDF_REG_DEM_PAD_SAT_TO_ZERO_Msk (0x8000UL)      /*!< RFCU RF_SPARE1_FTDF_REG: DEM_PAD_SAT_TO_ZERO (Bitfield-Mask: 0x01) */

/* -------------------------  RFCU_RF_BIAS_CTRL1_BLE_REG  ------------------------- */
#define RFCU_RF_BIAS_CTRL1_BLE_REG_MIX_BIAS_BLE_SET_Pos (0UL)           /*!< RFCU RF_BIAS_CTRL1_BLE_REG: MIX_BIAS_BLE_SET (Bit 0)        */
#define RFCU_RF_BIAS_CTRL1_BLE_REG_MIX_BIAS_BLE_SET_Msk (0xfUL)         /*!< RFCU RF_BIAS_CTRL1_BLE_REG: MIX_BIAS_BLE_SET (Bitfield-Mask: 0x0f) */
#define RFCU_RF_BIAS_CTRL1_BLE_REG_CP_BIAS_BLE_SET_Pos (4UL)            /*!< RFCU RF_BIAS_CTRL1_BLE_REG: CP_BIAS_BLE_SET (Bit 4)         */
#define RFCU_RF_BIAS_CTRL1_BLE_REG_CP_BIAS_BLE_SET_Msk (0xf0UL)         /*!< RFCU RF_BIAS_CTRL1_BLE_REG: CP_BIAS_BLE_SET (Bitfield-Mask: 0x0f) */
#define RFCU_RF_BIAS_CTRL1_BLE_REG_VCO_BIAS_BLE_SET_Pos (8UL)           /*!< RFCU RF_BIAS_CTRL1_BLE_REG: VCO_BIAS_BLE_SET (Bit 8)        */
#define RFCU_RF_BIAS_CTRL1_BLE_REG_VCO_BIAS_BLE_SET_Msk (0xf00UL)       /*!< RFCU RF_BIAS_CTRL1_BLE_REG: VCO_BIAS_BLE_SET (Bitfield-Mask: 0x0f) */
#define RFCU_RF_BIAS_CTRL1_BLE_REG_IFF_BIAS_BLE_SET_Pos (12UL)          /*!< RFCU RF_BIAS_CTRL1_BLE_REG: IFF_BIAS_BLE_SET (Bit 12)       */
#define RFCU_RF_BIAS_CTRL1_BLE_REG_IFF_BIAS_BLE_SET_Msk (0xf000UL)      /*!< RFCU RF_BIAS_CTRL1_BLE_REG: IFF_BIAS_BLE_SET (Bitfield-Mask: 0x0f) */

/* -------------------------  RFCU_RF_BIAS_CTRL1_FTDF_REG  ------------------------ */
#define RFCU_RF_BIAS_CTRL1_FTDF_REG_MIX_BIAS_FTDF_SET_Pos (0UL)         /*!< RFCU RF_BIAS_CTRL1_FTDF_REG: MIX_BIAS_FTDF_SET (Bit 0)      */
#define RFCU_RF_BIAS_CTRL1_FTDF_REG_MIX_BIAS_FTDF_SET_Msk (0xfUL)       /*!< RFCU RF_BIAS_CTRL1_FTDF_REG: MIX_BIAS_FTDF_SET (Bitfield-Mask: 0x0f) */
#define RFCU_RF_BIAS_CTRL1_FTDF_REG_CP_BIAS_FTDF_SET_Pos (4UL)          /*!< RFCU RF_BIAS_CTRL1_FTDF_REG: CP_BIAS_FTDF_SET (Bit 4)       */
#define RFCU_RF_BIAS_CTRL1_FTDF_REG_CP_BIAS_FTDF_SET_Msk (0xf0UL)       /*!< RFCU RF_BIAS_CTRL1_FTDF_REG: CP_BIAS_FTDF_SET (Bitfield-Mask: 0x0f) */
#define RFCU_RF_BIAS_CTRL1_FTDF_REG_VCO_BIAS_FTDF_SET_Pos (8UL)         /*!< RFCU RF_BIAS_CTRL1_FTDF_REG: VCO_BIAS_FTDF_SET (Bit 8)      */
#define RFCU_RF_BIAS_CTRL1_FTDF_REG_VCO_BIAS_FTDF_SET_Msk (0xf00UL)     /*!< RFCU RF_BIAS_CTRL1_FTDF_REG: VCO_BIAS_FTDF_SET (Bitfield-Mask: 0x0f) */
#define RFCU_RF_BIAS_CTRL1_FTDF_REG_IFF_BIAS_FTDF_SET_Pos (12UL)        /*!< RFCU RF_BIAS_CTRL1_FTDF_REG: IFF_BIAS_FTDF_SET (Bit 12)     */
#define RFCU_RF_BIAS_CTRL1_FTDF_REG_IFF_BIAS_FTDF_SET_Msk (0xf000UL)    /*!< RFCU RF_BIAS_CTRL1_FTDF_REG: IFF_BIAS_FTDF_SET (Bitfield-Mask: 0x0f) */

/* ----------------------------  RFCU_RF_IFF_CTRL1_REG  --------------------------- */
#define RFCU_RF_IFF_CTRL1_REG_IF_CAL_CAP_Pos  (0UL)                     /*!< RFCU RF_IFF_CTRL1_REG: IF_CAL_CAP (Bit 0)                   */
#define RFCU_RF_IFF_CTRL1_REG_IF_CAL_CAP_Msk  (0x1fUL)                  /*!< RFCU RF_IFF_CTRL1_REG: IF_CAL_CAP (Bitfield-Mask: 0x1f)     */
#define RFCU_RF_IFF_CTRL1_REG_IF_MUTE_Pos     (5UL)                     /*!< RFCU RF_IFF_CTRL1_REG: IF_MUTE (Bit 5)                      */
#define RFCU_RF_IFF_CTRL1_REG_IF_MUTE_Msk     (0x20UL)                  /*!< RFCU RF_IFF_CTRL1_REG: IF_MUTE (Bitfield-Mask: 0x01)        */
#define RFCU_RF_IFF_CTRL1_REG_IFF_DCOC_DAC_DIS_Pos (6UL)                /*!< RFCU RF_IFF_CTRL1_REG: IFF_DCOC_DAC_DIS (Bit 6)             */
#define RFCU_RF_IFF_CTRL1_REG_IFF_DCOC_DAC_DIS_Msk (0x40UL)             /*!< RFCU RF_IFF_CTRL1_REG: IFF_DCOC_DAC_DIS (Bitfield-Mask: 0x01) */
#define RFCU_RF_IFF_CTRL1_REG_RO_TO_PINS_Pos  (7UL)                     /*!< RFCU RF_IFF_CTRL1_REG: RO_TO_PINS (Bit 7)                   */
#define RFCU_RF_IFF_CTRL1_REG_RO_TO_PINS_Msk  (0x80UL)                  /*!< RFCU RF_IFF_CTRL1_REG: RO_TO_PINS (Bitfield-Mask: 0x01)     */
#define RFCU_RF_IFF_CTRL1_REG_IF_SEL_SET2_GT_Pos (8UL)                  /*!< RFCU RF_IFF_CTRL1_REG: IF_SEL_SET2_GT (Bit 8)               */
#define RFCU_RF_IFF_CTRL1_REG_IF_SEL_SET2_GT_Msk (0xf00UL)              /*!< RFCU RF_IFF_CTRL1_REG: IF_SEL_SET2_GT (Bitfield-Mask: 0x0f) */
#define RFCU_RF_IFF_CTRL1_REG_IF_SELECT_FSM_Pos (12UL)                  /*!< RFCU RF_IFF_CTRL1_REG: IF_SELECT_FSM (Bit 12)               */
#define RFCU_RF_IFF_CTRL1_REG_IF_SELECT_FSM_Msk (0x1000UL)              /*!< RFCU RF_IFF_CTRL1_REG: IF_SELECT_FSM (Bitfield-Mask: 0x01)  */
#define RFCU_RF_IFF_CTRL1_REG_IFF_COMPLEX_DIS_Pos (13UL)                /*!< RFCU RF_IFF_CTRL1_REG: IFF_COMPLEX_DIS (Bit 13)             */
#define RFCU_RF_IFF_CTRL1_REG_IFF_COMPLEX_DIS_Msk (0x2000UL)            /*!< RFCU RF_IFF_CTRL1_REG: IFF_COMPLEX_DIS (Bitfield-Mask: 0x01) */

/* ----------------------------  RFCU_RF_ADC_CTRL1_REG  --------------------------- */
#define RFCU_RF_ADC_CTRL1_REG_ADC_DC_OFFSET_SEL_Pos (0UL)               /*!< RFCU RF_ADC_CTRL1_REG: ADC_DC_OFFSET_SEL (Bit 0)            */
#define RFCU_RF_ADC_CTRL1_REG_ADC_DC_OFFSET_SEL_Msk (0x1UL)             /*!< RFCU RF_ADC_CTRL1_REG: ADC_DC_OFFSET_SEL (Bitfield-Mask: 0x01) */
#define RFCU_RF_ADC_CTRL1_REG_ADC_MUTE_Pos    (13UL)                    /*!< RFCU RF_ADC_CTRL1_REG: ADC_MUTE (Bit 13)                    */
#define RFCU_RF_ADC_CTRL1_REG_ADC_MUTE_Msk    (0x2000UL)                /*!< RFCU RF_ADC_CTRL1_REG: ADC_MUTE (Bitfield-Mask: 0x01)       */
#define RFCU_RF_ADC_CTRL1_REG_ADC_SIGN_Pos    (14UL)                    /*!< RFCU RF_ADC_CTRL1_REG: ADC_SIGN (Bit 14)                    */
#define RFCU_RF_ADC_CTRL1_REG_ADC_SIGN_Msk    (0x4000UL)                /*!< RFCU RF_ADC_CTRL1_REG: ADC_SIGN (Bitfield-Mask: 0x01)       */

/* ----------------------------  RFCU_RF_ADC_CTRL2_REG  --------------------------- */
#define RFCU_RF_ADC_CTRL2_REG_ADC_OFFP_I_WR_Pos (0UL)                   /*!< RFCU RF_ADC_CTRL2_REG: ADC_OFFP_I_WR (Bit 0)                */
#define RFCU_RF_ADC_CTRL2_REG_ADC_OFFP_I_WR_Msk (0xffUL)                /*!< RFCU RF_ADC_CTRL2_REG: ADC_OFFP_I_WR (Bitfield-Mask: 0xff)  */
#define RFCU_RF_ADC_CTRL2_REG_ADC_OFFN_I_WR_Pos (8UL)                   /*!< RFCU RF_ADC_CTRL2_REG: ADC_OFFN_I_WR (Bit 8)                */
#define RFCU_RF_ADC_CTRL2_REG_ADC_OFFN_I_WR_Msk (0xff00UL)              /*!< RFCU RF_ADC_CTRL2_REG: ADC_OFFN_I_WR (Bitfield-Mask: 0xff)  */

