wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* ------------------------  RFCU_POWER_RF_ALWAYS_EN3_REG  ------------------------ */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_MIX_BIAS_SH_Pos (0UL)       /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_MIX_BIAS_SH (Bit 0)    */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_MIX_BIAS_SH_Msk (0x1UL)     /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_MIX_BIAS_SH (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_PLL_DIG_EN_Pos (1UL)        /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_PLL_DIG_EN (Bit 1)     */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_PLL_DIG_EN_Msk (0x2UL)      /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_PLL_DIG_EN (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_PLLCLOSED_EN_Pos (2UL)      /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_PLLCLOSED_EN (Bit 2)   */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_PLLCLOSED_EN_Msk (0x4UL)    /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_PLLCLOSED_EN (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_DEM_EN_Pos (3UL)            /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_DEM_EN (Bit 3)         */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_DEM_EN_Msk (0x8UL)          /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_DEM_EN (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_LDO_ZERO_EN_Pos (4UL)       /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_LDO_ZERO_EN (Bit 4)    */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_LDO_ZERO_EN_Msk (0x10UL)    /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_LDO_ZERO_EN (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_CAL_EN_Pos (5UL)            /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_CAL_EN (Bit 5)         */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_CAL_EN_Msk (0x20UL)         /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_CAL_EN (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_TDC_EN_Pos (6UL)            /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_TDC_EN (Bit 6)         */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_TDC_EN_Msk (0x40UL)         /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_TDC_EN (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_LDO_RFIO_EN_Pos (7UL)       /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_LDO_RFIO_EN (Bit 7)    */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_LDO_RFIO_EN_Msk (0x80UL)    /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_LDO_RFIO_EN (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_RFIO_BIAS_EN_Pos (8UL)      /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_RFIO_BIAS_EN (Bit 8)   */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_RFIO_BIAS_EN_Msk (0x100UL)  /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_RFIO_BIAS_EN (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_RFIO_BIAS_SH_Pos (9UL)      /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_RFIO_BIAS_SH (Bit 9)   */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_RFIO_BIAS_SH_Msk (0x200UL)  /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_RFIO_BIAS_SH (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_LDO_RADIO_EN_Pos (10UL)     /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_LDO_RADIO_EN (Bit 10)  */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_LDO_RADIO_EN_Msk (0x400UL)  /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_LDO_RADIO_EN (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_ADC_CLK_EN_Pos (11UL)       /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_ADC_CLK_EN (Bit 11)    */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_ADC_CLK_EN_Msk (0x800UL)    /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_ADC_CLK_EN (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_TR_PWRM_OFF_EN_Pos (12UL)   /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_TR_PWRM_OFF_EN (Bit 12) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_TR_PWRM_OFF_EN_Msk (0x1000UL) /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_TR_PWRM_OFF_EN (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_TXDAC_EN_Pos (13UL)         /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_TXDAC_EN (Bit 13)      */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_TXDAC_EN_Msk (0x2000UL)     /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_TXDAC_EN (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_SPARE2_EN_Pos (14UL)        /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_SPARE2_EN (Bit 14)     */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_SPARE2_EN_Msk (0x4000UL)    /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_SPARE2_EN (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_SPARE3_EN_Pos (15UL)        /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_SPARE3_EN (Bit 15)     */
#define RFCU_POWER_RF_ALWAYS_EN3_REG_ALW_EN_SPARE3_EN_Msk (0x8000UL)    /*!< RFCU_POWER RF_ALWAYS_EN3_REG: ALW_EN_SPARE3_EN (Bitfield-Mask: 0x01) */

/* ------------------------  RFCU_POWER_RF_ALWAYS_EN4_REG  ------------------------ */
#define RFCU_POWER_RF_ALWAYS_EN4_REG_ALW_EN_SPARE4_EN_Pos (0UL)         /*!< RFCU_POWER RF_ALWAYS_EN4_REG: ALW_EN_SPARE4_EN (Bit 0)      */
#define RFCU_POWER_RF_ALWAYS_EN4_REG_ALW_EN_SPARE4_EN_Msk (0x1UL)       /*!< RFCU_POWER RF_ALWAYS_EN4_REG: ALW_EN_SPARE4_EN (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_ALWAYS_EN4_REG_ALW_EN_DEM_FTDF_EN_Pos (1UL)       /*!< RFCU_POWER RF_ALWAYS_EN4_REG: ALW_EN_DEM_FTDF_EN (Bit 1)    */
#define RFCU_POWER_RF_ALWAYS_EN4_REG_ALW_EN_DEM_FTDF_EN_Msk (0x2UL)     /*!< RFCU_POWER RF_ALWAYS_EN4_REG: ALW_EN_DEM_FTDF_EN (Bitfield-Mask: 0x01) */

/* --------------------------  RFCU_POWER_RF_PORT_EN_REG  ------------------------- */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT0_RX_Pos (0UL)                 /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT0_RX (Bit 0)              */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT0_RX_Msk (0x1UL)               /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT0_RX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT0_TX_Pos (1UL)                 /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT0_TX (Bit 1)              */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT0_TX_Msk (0x2UL)               /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT0_TX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT1_RX_Pos (2UL)                 /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT1_RX (Bit 2)              */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT1_RX_Msk (0x4UL)               /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT1_RX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT1_TX_Pos (3UL)                 /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT1_TX (Bit 3)              */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT1_TX_Msk (0x8UL)               /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT1_TX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT2_RX_Pos (4UL)                 /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT2_RX (Bit 4)              */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT2_RX_Msk (0x10UL)              /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT2_RX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT2_TX_Pos (5UL)                 /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT2_TX (Bit 5)              */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT2_TX_Msk (0x20UL)              /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT2_TX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT3_RX_Pos (6UL)                 /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT3_RX (Bit 6)              */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT3_RX_Msk (0x40UL)              /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT3_RX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT3_TX_Pos (7UL)                 /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT3_TX (Bit 7)              */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT3_TX_Msk (0x80UL)              /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT3_TX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT4_RX_Pos (8UL)                 /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT4_RX (Bit 8)              */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT4_RX_Msk (0x100UL)             /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT4_RX (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT4_TX_Pos (9UL)                 /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT4_TX (Bit 9)              */
#define RFCU_POWER_RF_PORT_EN_REG_RF_PORT4_TX_Msk (0x200UL)             /*!< RFCU_POWER RF_PORT_EN_REG: RF_PORT4_TX (Bitfield-Mask: 0x01) */

/* -------------------------  RFCU_POWER_RF_PORT_POL_REG  ------------------------- */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT0_POL_Pos (0UL)               /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT0_POL (Bit 0)            */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT0_POL_Msk (0x1UL)             /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT0_POL (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT1_POL_Pos (1UL)               /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT1_POL (Bit 1)            */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT1_POL_Msk (0x2UL)             /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT1_POL (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT2_POL_Pos (2UL)               /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT2_POL (Bit 2)            */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT2_POL_Msk (0x4UL)             /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT2_POL (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT3_POL_Pos (3UL)               /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT3_POL (Bit 3)            */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT3_POL_Msk (0x8UL)             /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT3_POL (Bitfield-Mask: 0x01) */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT4_POL_Pos (4UL)               /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT4_POL (Bit 4)            */
#define RFCU_POWER_RF_PORT_POL_REG_RF_PORT4_POL_Msk (0x10UL)            /*!< RFCU_POWER RF_PORT_POL_REG: RF_PORT4_POL (Bitfield-Mask: 0x01) */


/* ================================================================================ */
/* ================          struct 'RFPT' Position & Mask         ================ */
/* ================================================================================ */


