wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/sdk/bsp/include/DA14680AC.h
/* ------------------------------  USB_USB_ALTEV_REG  ----------------------------- */
#define USB_USB_ALTEV_REG_USB_EOP_Pos         (3UL)                     /*!< USB USB_ALTEV_REG: USB_EOP (Bit 3)                          */
#define USB_USB_ALTEV_REG_USB_EOP_Msk         (0x8UL)                   /*!< USB USB_ALTEV_REG: USB_EOP (Bitfield-Mask: 0x01)            */
#define USB_USB_ALTEV_REG_USB_SD3_Pos         (4UL)                     /*!< USB USB_ALTEV_REG: USB_SD3 (Bit 4)                          */
#define USB_USB_ALTEV_REG_USB_SD3_Msk         (0x10UL)                  /*!< USB USB_ALTEV_REG: USB_SD3 (Bitfield-Mask: 0x01)            */
#define USB_USB_ALTEV_REG_USB_SD5_Pos         (5UL)                     /*!< USB USB_ALTEV_REG: USB_SD5 (Bit 5)                          */
#define USB_USB_ALTEV_REG_USB_SD5_Msk         (0x20UL)                  /*!< USB USB_ALTEV_REG: USB_SD5 (Bitfield-Mask: 0x01)            */
#define USB_USB_ALTEV_REG_USB_RESET_Pos       (6UL)                     /*!< USB USB_ALTEV_REG: USB_RESET (Bit 6)                        */
#define USB_USB_ALTEV_REG_USB_RESET_Msk       (0x40UL)                  /*!< USB USB_ALTEV_REG: USB_RESET (Bitfield-Mask: 0x01)          */
#define USB_USB_ALTEV_REG_USB_RESUME_Pos      (7UL)                     /*!< USB USB_ALTEV_REG: USB_RESUME (Bit 7)                       */
#define USB_USB_ALTEV_REG_USB_RESUME_Msk      (0x80UL)                  /*!< USB USB_ALTEV_REG: USB_RESUME (Bitfield-Mask: 0x01)         */

/* -----------------------------  USB_USB_ALTMSK_REG  ----------------------------- */
#define USB_USB_ALTMSK_REG_USB_M_EOP_Pos      (3UL)                     /*!< USB USB_ALTMSK_REG: USB_M_EOP (Bit 3)                       */
#define USB_USB_ALTMSK_REG_USB_M_EOP_Msk      (0x8UL)                   /*!< USB USB_ALTMSK_REG: USB_M_EOP (Bitfield-Mask: 0x01)         */
#define USB_USB_ALTMSK_REG_USB_M_SD3_Pos      (4UL)                     /*!< USB USB_ALTMSK_REG: USB_M_SD3 (Bit 4)                       */
#define USB_USB_ALTMSK_REG_USB_M_SD3_Msk      (0x10UL)                  /*!< USB USB_ALTMSK_REG: USB_M_SD3 (Bitfield-Mask: 0x01)         */
#define USB_USB_ALTMSK_REG_USB_M_SD5_Pos      (5UL)                     /*!< USB USB_ALTMSK_REG: USB_M_SD5 (Bit 5)                       */
#define USB_USB_ALTMSK_REG_USB_M_SD5_Msk      (0x20UL)                  /*!< USB USB_ALTMSK_REG: USB_M_SD5 (Bitfield-Mask: 0x01)         */
#define USB_USB_ALTMSK_REG_USB_M_RESET_Pos    (6UL)                     /*!< USB USB_ALTMSK_REG: USB_M_RESET (Bit 6)                     */
#define USB_USB_ALTMSK_REG_USB_M_RESET_Msk    (0x40UL)                  /*!< USB USB_ALTMSK_REG: USB_M_RESET (Bitfield-Mask: 0x01)       */
#define USB_USB_ALTMSK_REG_USB_M_RESUME_Pos   (7UL)                     /*!< USB USB_ALTMSK_REG: USB_M_RESUME (Bit 7)                    */
#define USB_USB_ALTMSK_REG_USB_M_RESUME_Msk   (0x80UL)                  /*!< USB USB_ALTMSK_REG: USB_M_RESUME (Bitfield-Mask: 0x01)      */

/* ------------------------------  USB_USB_TXEV_REG  ------------------------------ */
#define USB_USB_TXEV_REG_USB_TXFIFO31_Pos     (0UL)                     /*!< USB USB_TXEV_REG: USB_TXFIFO31 (Bit 0)                      */
#define USB_USB_TXEV_REG_USB_TXFIFO31_Msk     (0x7UL)                   /*!< USB USB_TXEV_REG: USB_TXFIFO31 (Bitfield-Mask: 0x07)        */
#define USB_USB_TXEV_REG_USB_TXUDRRN31_Pos    (4UL)                     /*!< USB USB_TXEV_REG: USB_TXUDRRN31 (Bit 4)                     */
#define USB_USB_TXEV_REG_USB_TXUDRRN31_Msk    (0x70UL)                  /*!< USB USB_TXEV_REG: USB_TXUDRRN31 (Bitfield-Mask: 0x07)       */

/* ------------------------------  USB_USB_TXMSK_REG  ----------------------------- */
#define USB_USB_TXMSK_REG_USB_M_TXFIFO31_Pos  (0UL)                     /*!< USB USB_TXMSK_REG: USB_M_TXFIFO31 (Bit 0)                   */
#define USB_USB_TXMSK_REG_USB_M_TXFIFO31_Msk  (0x7UL)                   /*!< USB USB_TXMSK_REG: USB_M_TXFIFO31 (Bitfield-Mask: 0x07)     */
#define USB_USB_TXMSK_REG_USB_M_TXUDRRN31_Pos (4UL)                     /*!< USB USB_TXMSK_REG: USB_M_TXUDRRN31 (Bit 4)                  */
#define USB_USB_TXMSK_REG_USB_M_TXUDRRN31_Msk (0x70UL)                  /*!< USB USB_TXMSK_REG: USB_M_TXUDRRN31 (Bitfield-Mask: 0x07)    */

/* ------------------------------  USB_USB_RXEV_REG  ------------------------------ */
#define USB_USB_RXEV_REG_USB_RXFIFO31_Pos     (0UL)                     /*!< USB USB_RXEV_REG: USB_RXFIFO31 (Bit 0)                      */
#define USB_USB_RXEV_REG_USB_RXFIFO31_Msk     (0x7UL)                   /*!< USB USB_RXEV_REG: USB_RXFIFO31 (Bitfield-Mask: 0x07)        */
#define USB_USB_RXEV_REG_USB_RXOVRRN31_Pos    (4UL)                     /*!< USB USB_RXEV_REG: USB_RXOVRRN31 (Bit 4)                     */
#define USB_USB_RXEV_REG_USB_RXOVRRN31_Msk    (0x70UL)                  /*!< USB USB_RXEV_REG: USB_RXOVRRN31 (Bitfield-Mask: 0x07)       */

/* ------------------------------  USB_USB_RXMSK_REG  ----------------------------- */
#define USB_USB_RXMSK_REG_USB_M_RXFIFO31_Pos  (0UL)                     /*!< USB USB_RXMSK_REG: USB_M_RXFIFO31 (Bit 0)                   */
#define USB_USB_RXMSK_REG_USB_M_RXFIFO31_Msk  (0x7UL)                   /*!< USB USB_RXMSK_REG: USB_M_RXFIFO31 (Bitfield-Mask: 0x07)     */
#define USB_USB_RXMSK_REG_USB_M_RXOVRRN31_Pos (4UL)                     /*!< USB USB_RXMSK_REG: USB_M_RXOVRRN31 (Bit 4)                  */
#define USB_USB_RXMSK_REG_USB_M_RXOVRRN31_Msk (0x70UL)                  /*!< USB USB_RXMSK_REG: USB_M_RXOVRRN31 (Bitfield-Mask: 0x07)    */

/* ------------------------------  USB_USB_NAKEV_REG  ----------------------------- */
#define USB_USB_NAKEV_REG_USB_IN31_Pos        (0UL)                     /*!< USB USB_NAKEV_REG: USB_IN31 (Bit 0)                         */
#define USB_USB_NAKEV_REG_USB_IN31_Msk        (0x7UL)                   /*!< USB USB_NAKEV_REG: USB_IN31 (Bitfield-Mask: 0x07)           */
#define USB_USB_NAKEV_REG_USB_OUT31_Pos       (4UL)                     /*!< USB USB_NAKEV_REG: USB_OUT31 (Bit 4)                        */
#define USB_USB_NAKEV_REG_USB_OUT31_Msk       (0x70UL)                  /*!< USB USB_NAKEV_REG: USB_OUT31 (Bitfield-Mask: 0x07)          */

/* -----------------------------  USB_USB_NAKMSK_REG  ----------------------------- */
#define USB_USB_NAKMSK_REG_USB_M_IN31_Pos     (0UL)                     /*!< USB USB_NAKMSK_REG: USB_M_IN31 (Bit 0)                      */
#define USB_USB_NAKMSK_REG_USB_M_IN31_Msk     (0x7UL)                   /*!< USB USB_NAKMSK_REG: USB_M_IN31 (Bitfield-Mask: 0x07)        */
#define USB_USB_NAKMSK_REG_USB_M_OUT31_Pos    (4UL)                     /*!< USB USB_NAKMSK_REG: USB_M_OUT31 (Bit 4)                     */
#define USB_USB_NAKMSK_REG_USB_M_OUT31_Msk    (0x70UL)                  /*!< USB USB_NAKMSK_REG: USB_M_OUT31 (Bitfield-Mask: 0x07)       */

/* ------------------------------  USB_USB_FWEV_REG  ------------------------------ */
#define USB_USB_FWEV_REG_USB_TXWARN31_Pos     (0UL)                     /*!< USB USB_FWEV_REG: USB_TXWARN31 (Bit 0)                      */
#define USB_USB_FWEV_REG_USB_TXWARN31_Msk     (0x7UL)                   /*!< USB USB_FWEV_REG: USB_TXWARN31 (Bitfield-Mask: 0x07)        */
#define USB_USB_FWEV_REG_USB_RXWARN31_Pos     (4UL)                     /*!< USB USB_FWEV_REG: USB_RXWARN31 (Bit 4)                      */
#define USB_USB_FWEV_REG_USB_RXWARN31_Msk     (0x70UL)                  /*!< USB USB_FWEV_REG: USB_RXWARN31 (Bitfield-Mask: 0x07)        */

